recipes.org
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+STARTUP: showeverything
#+OPTIONS: toc:2
* Beverages
** Chai Tea
*** Ingredients
- 1 Tblsp fennel or anise seed
- 6 green cardamom pods
- 12 cloves
- 1 cinnamon stick
- \frac14 inch ginger root, sliced thinly
- \frac14 teasp black pepper corns
- 2 bay leaves
- 7 cups water
- 2 Tblsp Darjeeling tea
- 3 Tblsp honey or brown sugar (was 6)
- 1 cup milk
*** Method
1. Boil fennel, cardamom, cloves, cinnamon, ginger root, pepper corns, bay leaves and water for 5 minutes, then steep for 10 minutes.
2. Add tea, honey and milk. Bring to a boil and simmer 5 minutes. Strain.
*** Yield Serves 8.
*** Credits
+ From Chai! The Enthusiast's Online Chai Resource www.odie.org/chai/index.html
+ (date created: 6/27/2007 4:42:13 PM)
** Mojito (Cuban Mint and Rum Cocktail)
- Total Time: 5 mins
- Servings: 1
*** Ingredients
- crushed ice
- 12 leaves fresh spearmint
- 3 tablespoons lime juice ( preferably fresh, do not use Rose's Lime)
- 1-2 tablespoon sugar syrup, to taste
- 1 1/2-2 ounces rum, to taste
- 2 ounces club soda, more to taste
*** Method
1. Fill a glass 1/3 full with crushed ice, and place mint leaves and sugar syrup on top.
2. Using a muddle stick or wooden pestle, mash them together for about 20 seconds.
3. Add the rum and club soda and lime juice and stir well.
4. Garnish with mint sprig, serve, and enjoy!
5. *To make sugar syrup, dissolve 1 part sugar into 1 part hot water and boil until thickened.
*** Credits
- 107.8 Calories Per Serving
- By Julesong on December 19, 2002
- http://www.food.com/recipe/mojito-cuban-mint-and-rum-cocktail-49310
- (date created: 7/17/2012 11:56:39 AM)
** Mojitos
*** Method (for 1 serving):
**** In a 16-oz mixing glass, gently muddle together:
+ 1 large sprig spearmint
+ .75 oz simple syrup (1:1 sugar to water; /boiled for 3 minutes/)
**** Add:
+ Half a spent lime hull, and
+ 1 oz of lime juice (no less, no more)
+ 2 oz white rum
+ 3 oz sparkling mineral water 
+ Top with crushed ice and mix with a straw until drink is combined and glass is frosty.
*** Method (for 4 servings):
**** In a pitcher, gently muddle together:
1.     4 large sprig spearmint
2.     3 oz simple syrup (1:1 sugar to water; /boiled for 3 minutes/)
