recipes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-26 Fri 09:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4adf574">Beverages</a>
<ul>
<li><a href="#org4140958">Chai Tea</a></li>
<li><a href="#orgf30f9a9">Mojito (Cuban Mint and Rum Cocktail)</a></li>
<li><a href="#orgd55c78a">Mojitos</a></li>
<li><a href="#org2636fdc">Sangria</a></li>
</ul>
</li>
<li><a href="#org943c097">Bread</a>
<ul>
<li><a href="#org2f910a4">Amazing Rosemary Bread</a></li>
<li><a href="#org643d814">Cheesy Herb Rolls</a></li>
<li><a href="#org1c9ea2e">Cheesy Herb Rolls (double batch)</a></li>
<li><a href="#orga3da177">Cinnabons (using Bread Machine)</a></li>
<li><a href="#orga052b58">Crackling Cornbread (from Silver Palate)</a></li>
<li><a href="#org3658595">Crusty European-Style Hard Rolls</a></li>
<li><a href="#org32cf4d8">Currant Soda</a></li>
<li><a href="#org4616fa5">Custardy Popovers</a></li>
<li><a href="#org035eedf">Homemade Pretzels</a></li>
<li><a href="#orgc0b1328">Easy Hot Cross Buns</a></li>
<li><a href="#org8c71782">Irish Soda Bread</a></li>
<li><a href="#org08d28df">Italian Country Bread</a></li>
<li><a href="#org18c74e1">Japanese Milk Bread Rolls</a></li>
<li><a href="#org2f20715">Lemon-Poppy Seed Muffins and/or Quick Bread Loaf</a></li>
<li><a href="#org894fe90">No-knead Crusty Bread</a></li>
<li><a href="#org868626a">Black Bread Castelvetrano</a></li>
<li><a href="#org97b2d87">Pane Pugliese</a></li>
<li><a href="#orgca291bb">Pita Bread</a></li>
<li><a href="#org76ed1ed">New York Variation Pizza Dough</a></li>
<li><a href="#orgbd00c19">Portuguese Rolls - Papo Secos</a></li>
<li><a href="#org8cb38e8">Pumpkin Bread</a></li>
<li><a href="#org0388d6c">Quick Homemade Gluten</a></li>
<li><a href="#org202f08f">Rustic Bread</a></li>
<li><a href="#org2030d68">Texas-Style Cornbread</a></li>
<li><a href="#org99a4129">Tortillas</a></li>
</ul>
</li>
<li><a href="#org868115d">Breakfast</a>
<ul>
<li><a href="#orgd42bb01">Banana Muffins</a></li>
<li><a href="#org860a584">Baron Bagels</a></li>
<li><a href="#org92e477a">Belgian Waffles</a></li>
<li><a href="#org09e62bf">Best Bran Muffins</a></li>
<li><a href="#orgc559f71">Best Buttermilk Waffles</a></li>
<li><a href="#orge92b989">Blueberry Buttermilk Muffins</a></li>
<li><a href="#org53fbddd">Buttermilk Scones with Raisins</a></li>
<li><a href="#org2606369">Buttermilk Syrup</a></li>
<li><a href="#orgc9a6fae">Claridge’s Scones</a></li>
<li><a href="#org048a8cc">Cranberry Muffins</a></li>
<li><a href="#org85fb817">Fruit and Nut Muffins</a></li>
<li><a href="#orgf2d6400">German Pancakes</a></li>
<li><a href="#org7dd75a0">Great Granola</a></li>
<li><a href="#orgdba976c">Scones, Irish</a></li>
<li><a href="#org4d9b7a0">Lauren Groveman's Bagels</a></li>
<li><a href="#org365ba03">Golden Raisin Oat Bran Muffins</a></li>
<li><a href="#org0e85226">Oatmeal Raisin Pancakes with Cinnamon Sour Cream</a></li>
<li><a href="#org60fcae8">Pancakes, Buttermilk</a></li>
<li><a href="#orgbfde927">Pancakes, Classic Sourdough</a></li>
<li><a href="#orgb28682a">Pancakes</a></li>
<li><a href="#orgc0f5bef">Pumpkin Muffins</a></li>
<li><a href="#org2895c84">Stuffed French Toast</a></li>
<li><a href="#org43a2dba">The Baker's Banana Nut Muffins</a></li>
<li><a href="#orge038e78">Yum Buns</a></li>
</ul>
</li>
<li><a href="#orgdf230de">Desserts</a>
<ul>
<li><a href="#orgc1644e3">Almond Horns</a></li>
<li><a href="#orgeb68606">Apple Fritters</a></li>
<li><a href="#org8725311">Apple Twist Bread</a></li>
<li><a href="#org4a24049">Aunt Anna's Apple Cake</a></li>
<li><a href="#org24ac3dc">Banana Bread</a></li>
<li><a href="#org4110872">Biscotti</a></li>
<li><a href="#org1331946">Blueberry Cobbler</a></li>
<li><a href="#org0f8e676">Blueberry Hand Pies</a></li>
<li><a href="#org7af5839">Bread Pudding</a></li>
<li><a href="#org867ef45">Chocolate Chip Cookies</a></li>
<li><a href="#orgbadd18f">Chocolate Cream Pie</a></li>
<li><a href="#orgb72a5a6">Chocolate Truffle Cookies</a></li>
<li><a href="#org012b720">Chocolate Zucchini Cake</a></li>
<li><a href="#org006209c">Classic Pie Crust (King Arthur)</a></li>
<li><a href="#orgddfc1f5">Classic Single Pie Dough</a></li>
<li><a href="#org2cd5a8e">Coconut Layer Cake</a></li>
<li><a href="#org5518ab3">Double Lemon-Poppy Seed Bundt Cake</a></li>
<li><a href="#org73b3f12">East 62nd Street Lemon Cake</a></li>
<li><a href="#org7fb7094">Flaky Pie Crust</a></li>
<li><a href="#org7af5c6f">Ginger Snaps</a></li>
<li><a href="#org93bd41b">Lemon Cornmeal Cake with Lemon Glaze and Crushed-Blueberry Sauce Glaze:</a></li>
<li><a href="#orga28de47">Orange Pineapple Cake</a></li>
<li><a href="#org3610d4b">Peach Melba Cream Cake</a></li>
<li><a href="#org1db63c0">Pie Crust (Classic)</a></li>
<li><a href="#org3c8ba34">Spoon Cookies</a></li>
<li><a href="#orgf6127d3">Tiramisu</a></li>
</ul>
</li>
<li><a href="#org392dbf9">Entrees</a>
<ul>
<li><a href="#org712d316">Asparagus Frittata with Basil, Shallots and Parmesan</a></li>
<li><a href="#orgb495a4e">Butternut Squash Soup</a></li>
<li><a href="#orge7a41d8">Cajun Meat Loaf with Chili Sauce</a></li>
<li><a href="#org8d04ce4">Corn Chowder</a></li>
<li><a href="#orgce02d2c">Corn Souffle</a></li>
<li><a href="#orgcf69d72">Crispy Red Potatoes with Warm Asian Slaw &amp; Limey Sauce</a></li>
<li><a href="#orgfb7c04a">Curried Lentil Dish</a></li>
<li><a href="#org5a539c1">Dried Mushroom Soup with Barley</a></li>
<li><a href="#orgabd92ab">General Tso's Cauliflower</a></li>
<li><a href="#org9c49ca8">General Tso's Tofu</a></li>
<li><a href="#org28b31f1">Grilled Corn and Sweet Onion Salad</a></li>
<li><a href="#orga2354dd">Grilled Vegetable Gratin</a></li>
<li><a href="#org8797f2a">Mexican Lasagna</a></li>
<li><a href="#orgb0d77c0">Mushroom Pate</a></li>
<li><a href="#org7b0fa8c">Noodle Kugel</a></li>
<li><a href="#org7a7747f">Pasta Quills with Cheesy Aubergine (Eggplant) Sauce</a></li>
<li><a href="#orgc5617c0">Chicago-Style Deep-Dish Pizza</a></li>
<li><a href="#org1cb9e5b">Vegetable Pot Pie</a></li>
<li><a href="#orgd93a50d">Quiche</a></li>
<li><a href="#org98ee1b0">Refried Bean, Zucchini and Corn Gratin</a></li>
<li><a href="#org88c92d1">Roasted Eggplant, Crisp Garlic, and Basil Pasta</a></li>
<li><a href="#orgdda36b9">Southwestern Quiche With Potato Crust</a></li>
<li><a href="#orgcb7fa30">Spicy Black Bean Cakes</a></li>
<li><a href="#org8da0a8e">Thai Red Curry Summer Squash</a></li>
<li><a href="#orgdf43050">Pizza</a></li>
<li><a href="#orgff4d48e">Ultimate Veggie Burger Recipe</a></li>
<li><a href="#org45ef0d3">Vegetable Enchiladas</a></li>
<li><a href="#org80e06fb">Vegetable Pot Pie</a></li>
<li><a href="#orga3404d3">Vegetarian Lentil Burger Recipe</a></li>
</ul>
</li>
<li><a href="#org8f6cfef">Sides</a>
<ul>
<li><a href="#orgeaf29a4">Authentic Thai Peanut Sauce</a></li>
<li><a href="#org08ffde4">Avacado with Cheese Dressing</a></li>
<li><a href="#org8a20608">Syrupy "Aged" Balsamic in Minutes</a></li>
<li><a href="#orgc41506f">Takeout Style Broccoli with Garlic Sauce</a></li>
<li><a href="#orgd5d6df6">Caramelized Onion and Sun-Dried Tomato Dip</a></li>
<li><a href="#orge457498">Champ</a></li>
<li><a href="#org45efd86">Cheese Grits</a></li>
<li><a href="#orgc7dcad0">Chipotle Ranch Dressing</a></li>
<li><a href="#org27a26ba">Easy Red Pepper Hummus</a></li>
<li><a href="#org1b46ee0">Gougeres</a></li>
<li><a href="#orgefb22a4">Habanero Hot Sauce</a></li>
<li><a href="#org353918f">Hollandaise Sauce</a></li>
<li><a href="#orgf1cff04">Indian-Style Rice Salad</a></li>
<li><a href="#org9870106">Japanese Ginger Dressing</a></li>
<li><a href="#org5b239da">Patatas Bravas</a></li>
<li><a href="#org78fd27f">Persian Carrots</a></li>
<li><a href="#orgec7646c">Socca (Farinata)</a></li>
<li><a href="#orgb21e146">Soup of Bitter Greens with Cheese Dumplings</a></li>
<li><a href="#org328664c">White Corn Tortilla Soup</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4adf574" class="outline-2">
<h2 id="org4adf574">Beverages</h2>
<div class="outline-text-2" id="text-org4adf574">
</div>
<div id="outline-container-org4140958" class="outline-3">
<h3 id="org4140958">Chai Tea</h3>
<div class="outline-text-3" id="text-org4140958">
</div>
<div id="outline-container-org7dcfb0f" class="outline-4">
<h4 id="org7dcfb0f">Ingredients</h4>
<div class="outline-text-4" id="text-org7dcfb0f">
<ul class="org-ul">
<li>1 Tblsp fennel or anise seed</li>
<li>6 green cardamom pods</li>
<li>12 cloves</li>
<li>1 cinnamon stick</li>
<li>&frac14; inch ginger root, sliced thinly</li>
<li>&frac14; teasp black pepper corns</li>
<li>2 bay leaves</li>
<li>7 cups water</li>
<li>2 Tblsp Darjeeling tea</li>
<li>3 Tblsp honey or brown sugar (was 6)</li>
<li>1 cup milk</li>
</ul>
</div>
</div>
<div id="outline-container-org283593e" class="outline-4">
<h4 id="org283593e">Method</h4>
<div class="outline-text-4" id="text-org283593e">
<ol class="org-ol">
<li>Boil fennel, cardamom, cloves, cinnamon, ginger root, pepper corns, bay leaves and water for 5 minutes, then steep for 10 minutes.</li>
<li>Add tea, honey and milk. Bring to a boil and simmer 5 minutes. Strain.</li>
</ol>
</div>
</div>
<div id="outline-container-org3e034c2" class="outline-4">
<h4 id="org3e034c2">Yield Serves 8.</h4>
</div>
<div id="outline-container-org88c017c" class="outline-4">
<h4 id="org88c017c">Credits</h4>
<div class="outline-text-4" id="text-org88c017c">
<ul class="org-ul">
<li>From Chai! The Enthusiast's Online Chai Resource www.odie.org/chai/index.html</li>
<li>(date created: 6/27/2007 4:42:13 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf30f9a9" class="outline-3">
<h3 id="orgf30f9a9">Mojito (Cuban Mint and Rum Cocktail)</h3>
<div class="outline-text-3" id="text-orgf30f9a9">
<ul class="org-ul">
<li>Total Time: 5 mins</li>
<li>Servings: 1</li>
</ul>
</div>
<div id="outline-container-org50eb761" class="outline-4">
<h4 id="org50eb761">Ingredients</h4>
<div class="outline-text-4" id="text-org50eb761">
<ul class="org-ul">
<li>crushed ice</li>
<li>12 leaves fresh spearmint</li>
<li>3 tablespoons lime juice ( preferably fresh, do not use Rose's Lime)</li>
<li>1-2 tablespoon sugar syrup, to taste</li>
<li>1 1/2-2 ounces rum, to taste</li>
<li>2 ounces club soda, more to taste</li>
</ul>
</div>
</div>
<div id="outline-container-orgffb6503" class="outline-4">
<h4 id="orgffb6503">Method</h4>
<div class="outline-text-4" id="text-orgffb6503">
<ol class="org-ol">
<li>Fill a glass 1/3 full with crushed ice, and place mint leaves and sugar syrup on top.</li>
<li>Using a muddle stick or wooden pestle, mash them together for about 20 seconds.</li>
<li>Add the rum and club soda and lime juice and stir well.</li>
<li>Garnish with mint sprig, serve, and enjoy!</li>
<li>*To make sugar syrup, dissolve 1 part sugar into 1 part hot water and boil until thickened.</li>
</ol>
</div>
</div>
<div id="outline-container-orgd9f061c" class="outline-4">
<h4 id="orgd9f061c">Credits</h4>
<div class="outline-text-4" id="text-orgd9f061c">
<ul class="org-ul">
<li>107.8 Calories Per Serving</li>
<li>By Julesong on December 19, 2002</li>
<li><a href="http://www.food.com/recipe/mojito-cuban-mint-and-rum-cocktail-49310">http://www.food.com/recipe/mojito-cuban-mint-and-rum-cocktail-49310</a></li>
<li>(date created: 7/17/2012 11:56:39 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd55c78a" class="outline-3">
<h3 id="orgd55c78a">Mojitos</h3>
<div class="outline-text-3" id="text-orgd55c78a">
</div>
<div id="outline-container-org6c16ac8" class="outline-4">
<h4 id="org6c16ac8">Method (for 1 serving):</h4>
<div class="outline-text-4" id="text-org6c16ac8">
</div>
<ul class="org-ul">
<li><a id="org6565f4c"></a>In a 16-oz mixing glass, gently muddle together:<br />
<div class="outline-text-5" id="text-org6565f4c">
<ul class="org-ul">
<li>1 large sprig spearmint</li>
<li>.75 oz simple syrup (1:1 sugar to water; <i>boiled for 3 minutes</i>)</li>
</ul>
</div>
</li>
<li><a id="org15f3fbc"></a>Add:<br />
<div class="outline-text-5" id="text-org15f3fbc">
<ul class="org-ul">
<li>Half a spent lime hull, and</li>
<li>1 oz of lime juice (no less, no more)</li>
<li>2 oz white rum</li>
<li>3 oz sparkling mineral water</li>
<li>Top with crushed ice and mix with a straw until drink is combined and glass is frosty.</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgf7917e1" class="outline-4">
<h4 id="orgf7917e1">Method (for 4 servings):</h4>
<div class="outline-text-4" id="text-orgf7917e1">
</div>
<ul class="org-ul">
<li><a id="orgfbea197"></a>In a pitcher, gently muddle together:<br />
<div class="outline-text-5" id="text-orgfbea197">
<ol class="org-ol">
<li>4 large sprig spearmint</li>
<li>3 oz simple syrup (1:1 sugar to water; <i>boiled for 3 minutes</i>)</li>
</ol>
</div>
</li>
