recipes.org
**** Add:
1. Four halves of spent lime hull, and
2. 4 oz of lime juice (no less, no more)
3. 8 oz white rum
4. 12 oz sparkling mineral water 
5. Top with crushed ice and mix with a straw until drink is combined and glass is frosty.
*** Credits
- http://www.jeffreymorgenthaler.com/2007/mojito/
- Made at our 50/50 party, July 2011. A big hit!
- (date created: 7/21/2011 8:21:52 PM)
** Sangria
Depending on the type of red wine you use, whether it is light bodied like a Beaujolais or deep and rich like a Cabernet, add the sparkling water to taste. Sangria is best enjoyed the day it is made, otherwise the oils from the citrus rind begin to impart flavor.
Prep Time: 15 minutes
Total Time: 2 hours
Yield: About 1 1/2 Quarts
*** Ingredients
- 1 (750-ml) bottle red wine
- 1/4 cup brandy
- 1/4 cup orange flavored liqueur (recommended: triple sec or Grand Marnier)
- 2 tablespoons fresh lime juice
- 2 tablespoons fresh orange juice
- 1/4 cup sugar
- 1/2 orange, thinly sliced
- 1/2 lemon, thinly sliced
- 1 unwaxed apple, cored, and cut into thin wedges
- 1 (750-ml) bottle sparkling water, or to taste, chilled
*** Method
1. Combine everything but the sparkling water in a large plastic container or glass pitchers.
2. Cover and chill completely, 1 to 2 hours. When ready to serve, add 2 cups of the sparkling water, adding more to taste, if desired.
*** Credits
- http://emerils.com/print/124088
- Made for Jan's Ice Cream Social [2017-06-13 Tue]
    + swapped strawberries for apples and cranberry juice or orange
* Bread
** Amazing Rosemary Bread
*** Ingredients
- 1 tablespoon yeast
- 1 tablespoon sugar
- 1 cup warm water
- 2 1/2 cups flour
- 1 teaspoon salt
- 2 tablespoons fresh rosemary
- 2 tablespoons vegan margarine
*** Method
1. Place yeast, sugar and water in large bowl or food processor and allow mixture to become bubbly. Mix in 1 tablespoon margarine, salt, and 2 cups of flour. Add one tablespoon of the fresh chopped rosemary. Knead for about 10 minutes by hand or in food processor about 5 minutes until smooth and elastic. Add more flour if necessary.
2. Oil a bowl, put dough in it and cover with a towel. Let dough rise in a warm place for one hour until doubled.
3. Punch down dough and divide in half. Let dough rest about 5 minutes.
4. Spray baking pan or cookie sheet with cooking spray. Shape the dough into 2 small rounded oval loaves. Sprinkle remaining 1 Tablespoon of rosemary over the loaves and press lightly into the surface.  Let loaves rise again until doubled, about 45 minutes.
5. Preheat oven to 375 degrees Fahrenheit. Bake for 15 to 20 minutes, until lightly browned. Carefully remove from oven, brush with remaining vegan margarine (and salt if desired).
*** Yield 
- Makes 2 loaves
- Preparation time: 2 hours, Baking time: 20 minutes
*** Credits
- http://vegweb.com/index.php?PHPSESSID=7404f53c6ca2ebfde2c6d58855366e29&action=printpage;topic=21486.0
- 2009-06-30
- (date created: 6/30/2009 8:37:19 AM)
** Cheesy Herb Rolls
*** Ingredients
- 3 3/4 cups (450g) unbleached all-purpose flour, plus more for dusting the work surface.
- 2 teaspoons salt
- 1/2 cup warm low fat milk (about 110 degrees)
- 1/2 cup heavy cream
- 1/3 cup warm water
- 2 1/4 teaspoons rapid rise yeast
- 2 teaspoons sugar
- 2 1/2 tablespoons unsalted butter, melted
- 1/4 cup sugar
- 1 1/2 large eggs, beaten (crack one egg into a bowl, whisk, and then use half that amount with 1 whole egg.)
*** Method
1. Mix 3 1/2 cups of the flour and the salt in a bowl.
2. Mix the milk, cream, butter, and 1/4 cup sugar in a saucepan and heat over medium heat until foam forms around the edges. remove from the burner and place on a hot pad in the fridge to cool only to luke warm. You do not want cold milk, but it cannot be hot either.
3. In a glass measuring cup, add the warm water and yeast with the 2 teaspoons of sugar. allow to foam for 5-10 minutes.
4. In a bowl of a standing mixer, add the milk mixture and about 1 cup of the flour. using the dough hook, mix for about 30 seconds. scrape down the sides of the bowl and add the yeast mixture. beat again for 3 minutes. add the eggs and beat for 30 seconds. add the remaining flour and beat on medium then medium high for 1-2 minutes or until the dough is pulling away from the mixer but still slightly sticky to the touch.
5. Place in a clean, lightly oiled bowl and cover with a towel to rise for 1-2 hours, sometimes I let mine go for 3 hours.
6. Punch down the dough and place on a lightly floured surface. form into balls and then roll in butter, herb mixture and then place in greased pie dishes (about 2 dishes), covered lightly with a towel to rise for 1 hour or until doubled in size.
7. Adjust oven rack to the lowest position and heat to 200 degrees. once the oven temp reaches 200, maintain the heat for 10 minutes and turn off the oven.
8. Bake at 375 for 15-20 minutes or until lightly golden on top. serve immediately. see notes for further instructions on freezing etc.
*** Herbs
**** Ingredients
- 1/4 teaspoon parsley
- 1/4 teaspoon dill
- 1/4 teaspoon thyme
- 1/4 teaspoon basil
- 1/4 teaspoon rosemary
- 1/2 cup parmesan cheese, (kraft powdered kind)
- 1/2 cup butter, melted
- 2 teaspoons garlic
instructions
**** Method
1. Put butter and garlic in a bowl, seasoning and cheese in another.
** Cheesy Herb Rolls (double batch)
*** Ingredients
- 7 1/2 cups (900g) unbleached all-purpose flour, plus more for dusting the work surface.
- 4 teaspoons salt
- 1 cup warm low fat milk (about 110 degrees)
- 1 cup heavy cream
- 2/3 cup warm water
- 2 scant tablespoons rapid rise yeast
- 4 teaspoons sugar
- 5 tablespoons unsalted butter, melted
- 1/2 cup sugar
- 3 large eggs, beaten
