recipes.html
<li><a id="orgcec97c4"></a>Add:<br />
<div class="outline-text-5" id="text-orgcec97c4">
<ol class="org-ol">
<li>Four halves of spent lime hull, and</li>
<li>4 oz of lime juice (no less, no more)</li>
<li>8 oz white rum</li>
<li>12 oz sparkling mineral water</li>
<li>Top with crushed ice and mix with a straw until drink is combined and glass is frosty.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org56004fd" class="outline-4">
<h4 id="org56004fd">Credits</h4>
<div class="outline-text-4" id="text-org56004fd">
<ul class="org-ul">
<li><a href="http://www.jeffreymorgenthaler.com/2007/mojito/">http://www.jeffreymorgenthaler.com/2007/mojito/</a></li>
<li>Made at our 50/50 party, July 2011. A big hit!</li>
<li>(date created: 7/21/2011 8:21:52 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2636fdc" class="outline-3">
<h3 id="org2636fdc">Sangria</h3>
<div class="outline-text-3" id="text-org2636fdc">
<p>
Depending on the type of red wine you use, whether it is light bodied like a Beaujolais or deep and rich like a Cabernet, add the sparkling water to taste. Sangria is best enjoyed the day it is made, otherwise the oils from the citrus rind begin to impart flavor.
Prep Time: 15 minutes
Total Time: 2 hours
Yield: About 1 1/2 Quarts
</p>
</div>
<div id="outline-container-orgbc7a278" class="outline-4">
<h4 id="orgbc7a278">Ingredients</h4>
<div class="outline-text-4" id="text-orgbc7a278">
<ul class="org-ul">
<li>1 (750-ml) bottle red wine</li>
<li>1/4 cup brandy</li>
<li>1/4 cup orange flavored liqueur (recommended: triple sec or Grand Marnier)</li>
<li>2 tablespoons fresh lime juice</li>
<li>2 tablespoons fresh orange juice</li>
<li>1/4 cup sugar</li>
<li>1/2 orange, thinly sliced</li>
<li>1/2 lemon, thinly sliced</li>
<li>1 unwaxed apple, cored, and cut into thin wedges</li>
<li>1 (750-ml) bottle sparkling water, or to taste, chilled</li>
</ul>
</div>
</div>
<div id="outline-container-orgf82b266" class="outline-4">
<h4 id="orgf82b266">Method</h4>
<div class="outline-text-4" id="text-orgf82b266">
<ol class="org-ol">
<li>Combine everything but the sparkling water in a large plastic container or glass pitchers.</li>
<li>Cover and chill completely, 1 to 2 hours. When ready to serve, add 2 cups of the sparkling water, adding more to taste, if desired.</li>
</ol>
</div>
</div>
<div id="outline-container-org597aa5b" class="outline-4">
<h4 id="org597aa5b">Credits</h4>
<div class="outline-text-4" id="text-org597aa5b">
<ul class="org-ul">
<li><a href="http://emerils.com/print/124088">http://emerils.com/print/124088</a></li>
<li>Made for Jan's Ice Cream Social <span class="timestamp-wrapper"><span class="timestamp">[2017-06-13 Tue]</span></span>
<ul class="org-ul">
<li>swapped strawberries for apples and cranberry juice or orange</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org943c097" class="outline-2">
<h2 id="org943c097">Bread</h2>
<div class="outline-text-2" id="text-org943c097">
</div>
<div id="outline-container-org2f910a4" class="outline-3">
<h3 id="org2f910a4">Amazing Rosemary Bread</h3>
<div class="outline-text-3" id="text-org2f910a4">
</div>
<div id="outline-container-org9a42639" class="outline-4">
<h4 id="org9a42639">Ingredients</h4>
<div class="outline-text-4" id="text-org9a42639">
<ul class="org-ul">
<li>1 tablespoon yeast</li>
<li>1 tablespoon sugar</li>
<li>1 cup warm water</li>
<li>2 1/2 cups flour</li>
<li>1 teaspoon salt</li>
<li>2 tablespoons fresh rosemary</li>
<li>2 tablespoons vegan margarine</li>
</ul>
</div>
</div>
<div id="outline-container-orgb1677ce" class="outline-4">
<h4 id="orgb1677ce">Method</h4>
<div class="outline-text-4" id="text-orgb1677ce">
<ol class="org-ol">
<li>Place yeast, sugar and water in large bowl or food processor and allow mixture to become bubbly. Mix in 1 tablespoon margarine, salt, and 2 cups of flour. Add one tablespoon of the fresh chopped rosemary. Knead for about 10 minutes by hand or in food processor about 5 minutes until smooth and elastic. Add more flour if necessary.</li>
<li>Oil a bowl, put dough in it and cover with a towel. Let dough rise in a warm place for one hour until doubled.</li>
<li>Punch down dough and divide in half. Let dough rest about 5 minutes.</li>
<li>Spray baking pan or cookie sheet with cooking spray. Shape the dough into 2 small rounded oval loaves. Sprinkle remaining 1 Tablespoon of rosemary over the loaves and press lightly into the surface.  Let loaves rise again until doubled, about 45 minutes.</li>
<li>Preheat oven to 375 degrees Fahrenheit. Bake for 15 to 20 minutes, until lightly browned. Carefully remove from oven, brush with remaining vegan margarine (and salt if desired).</li>
</ol>
</div>
</div>
<div id="outline-container-org4d822c0" class="outline-4">
<h4 id="org4d822c0">Yield</h4>
<div class="outline-text-4" id="text-org4d822c0">
<ul class="org-ul">
<li>Makes 2 loaves</li>
<li>Preparation time: 2 hours, Baking time: 20 minutes</li>
</ul>
</div>
</div>
<div id="outline-container-orgb2c7183" class="outline-4">
<h4 id="orgb2c7183">Credits</h4>
<div class="outline-text-4" id="text-orgb2c7183">
<ul class="org-ul">
<li><a href="http://vegweb.com/index.php?PHPSESSID=7404f53c6ca2ebfde2c6d58855366e29&amp;action=printpage;topic=21486.0">http://vegweb.com/index.php?PHPSESSID=7404f53c6ca2ebfde2c6d58855366e29&amp;action=printpage;topic=21486.0</a></li>
<li>2009-06-30</li>
<li>(date created: 6/30/2009 8:37:19 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org643d814" class="outline-3">
<h3 id="org643d814">Cheesy Herb Rolls</h3>
<div class="outline-text-3" id="text-org643d814">
</div>
<div id="outline-container-org8bfab01" class="outline-4">
<h4 id="org8bfab01">Ingredients</h4>
<div class="outline-text-4" id="text-org8bfab01">
<ul class="org-ul">
<li>3 3/4 cups (450g) unbleached all-purpose flour, plus more for dusting the work surface.</li>
<li>2 teaspoons salt</li>
<li>1/2 cup warm low fat milk (about 110 degrees)</li>
<li>1/2 cup heavy cream</li>
<li>1/3 cup warm water</li>
<li>2 1/4 teaspoons rapid rise yeast</li>
<li>2 teaspoons sugar</li>
<li>2 1/2 tablespoons unsalted butter, melted</li>
<li>1/4 cup sugar</li>
<li>1 1/2 large eggs, beaten (crack one egg into a bowl, whisk, and then use half that amount with 1 whole egg.)</li>
</ul>
</div>
</div>
<div id="outline-container-org714cccb" class="outline-4">
<h4 id="org714cccb">Method</h4>
<div class="outline-text-4" id="text-org714cccb">
<ol class="org-ol">
<li>Mix 3 1/2 cups of the flour and the salt in a bowl.</li>
<li>Mix the milk, cream, butter, and 1/4 cup sugar in a saucepan and heat over medium heat until foam forms around the edges. remove from the burner and place on a hot pad in the fridge to cool only to luke warm. You do not want cold milk, but it cannot be hot either.</li>
<li>In a glass measuring cup, add the warm water and yeast with the 2 teaspoons of sugar. allow to foam for 5-10 minutes.</li>
<li>In a bowl of a standing mixer, add the milk mixture and about 1 cup of the flour. using the dough hook, mix for about 30 seconds. scrape down the sides of the bowl and add the yeast mixture. beat again for 3 minutes. add the eggs and beat for 30 seconds. add the remaining flour and beat on medium then medium high for 1-2 minutes or until the dough is pulling away from the mixer but still slightly sticky to the touch.</li>
<li>Place in a clean, lightly oiled bowl and cover with a towel to rise for 1-2 hours, sometimes I let mine go for 3 hours.</li>
<li>Punch down the dough and place on a lightly floured surface. form into balls and then roll in butter, herb mixture and then place in greased pie dishes (about 2 dishes), covered lightly with a towel to rise for 1 hour or until doubled in size.</li>
<li>Adjust oven rack to the lowest position and heat to 200 degrees. once the oven temp reaches 200, maintain the heat for 10 minutes and turn off the oven.</li>
<li>Bake at 375 for 15-20 minutes or until lightly golden on top. serve immediately. see notes for further instructions on freezing etc.</li>
</ol>
</div>
</div>
<div id="outline-container-orgf66dc9d" class="outline-4">
<h4 id="orgf66dc9d">Herbs</h4>
<div class="outline-text-4" id="text-orgf66dc9d">
</div>
<ul class="org-ul">
<li><a id="orgf9d28b0"></a>Ingredients<br />
<div class="outline-text-5" id="text-orgf9d28b0">
<ul class="org-ul">
<li>1/4 teaspoon parsley</li>
<li>1/4 teaspoon dill</li>
<li>1/4 teaspoon thyme</li>
<li>1/4 teaspoon basil</li>
<li>1/4 teaspoon rosemary</li>
<li>1/2 cup parmesan cheese, (kraft powdered kind)</li>
<li>1/2 cup butter, melted</li>
<li>2 teaspoons garlic</li>
</ul>
<p>
instructions
</p>
</div>
</li>
<li><a id="org72f08e4"></a>Method<br />
<div class="outline-text-5" id="text-org72f08e4">
<ol class="org-ol">
<li>Put butter and garlic in a bowl, seasoning and cheese in another.</li>
</ol>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1c9ea2e" class="outline-3">
<h3 id="org1c9ea2e">Cheesy Herb Rolls (double batch)</h3>
<div class="outline-text-3" id="text-org1c9ea2e">
</div>
<div id="outline-container-org49b6e2b" class="outline-4">
<h4 id="org49b6e2b">Ingredients</h4>
<div class="outline-text-4" id="text-org49b6e2b">
<ul class="org-ul">
<li>7 1/2 cups (900g) unbleached all-purpose flour, plus more for dusting the work surface.</li>
<li>4 teaspoons salt</li>
<li>1 cup warm low fat milk (about 110 degrees)</li>
<li>1 cup heavy cream</li>
<li>2/3 cup warm water</li>
<li>2 scant tablespoons rapid rise yeast</li>
<li>4 teaspoons sugar</li>
<li>5 tablespoons unsalted butter, melted</li>
<li>1/2 cup sugar</li>
<li>3 large eggs, beaten</li>
</ul>
</div>
</div>
