recipes.org
*** Method
1. Adjust oven rack to the lowest position and heat to 200 degrees. once the oven temp reaches 200, maintain the heat for 10 minutes and turn off the oven.
2. Mix 7 cups (840g) of the flour and the salt in a bowl.
3. Mix the milk,cream, butter, and 1/2 cup sugar in a saucepan and heat over medium heat until foam forms around the edges. Remove from the burner and place on a hot pad in the fridge to cool only to luke warm. You do not want cold milk, but it cannot be hot either.
4. In a glass measuring cup, add the warm water and yeast with the 4 teaspoons of sugar. Allow to foam for 5-10 minutes.
5. In a bowl of a standing mixer, add the milk mixture and about 2 cups (240g) of the flour. Using the dough hook, mix for about 30 seconds. scrape down the sides of the bowl and add the yeast mixture. beat again for 3 minutes. Add the eggs and beat for 30 seconds. Add the remaining flour and beat on medium then medium high for 1-2 minutes or until the dough is pulling away from the mixer but still slightly sticky to the touch.
6. Place in a clean, lightly oiled bowl and cover with a towel to rise for 1-2 hours, sometimes I let mine go for 3 hours.
7. Punch down the dough and place on a lightly floured surface. form into balls and then roll in butter, herb mixture and then place in greased pie dishes (about 2 dishes), covered lightly with a towel to rise for 1 hour or until doubled in size.
8. Bake at 375 for 15-20 minutes or until lightly golden on top. Serve immediately.
*** Herbs
**** Ingredients
- 1/4 teaspoon parsley
- 1/4 teaspoon dill
- 1/4 teaspoon thyme
- 1/4 teaspoon basil
- 1/4 teaspoon rosemary
- 1/2 cup parmesan cheese, (kraft powdered kind)
- 1/2 cup butter, melted
- 2 teaspoons garlic
**** Method
1. Put butter and garlic in a bowl, seasoning and cheese in another.
*** Credits
http://www.ohsweetbasil.com/herby-garlicky-cheesy-bread.html
Made for 4th of July party [2016-07-03 Sun]. They were a big hit with the crowd, but I thought they were a lot like the stuff you get at Olive Garden.
** Cinnabons (using Bread Machine)
*** Ingredients
- 1/4 cup butter, melted
- 1/4 cup water
- 1/2 pkg. instant vanilla pudding (1/2 of a 3.4 oz. box)
- 1 cup milk
- 1 egg, beaten
- 1 tbsp. sugar
- 1/2 tsp. salt
- 4 cup bread flour
- 2 1/2 tsp. yeast
*** Method
1. 1/2 cup butter, softened
2. 1 cup brown sugar
3. 2 tsp. cinnamon
4. 4 oz. cream cheese, softened
5. 1/4 cup butter, softened
6. 1 1/2 cup confectioners sugar
7. 1/2 tsp. vanilla
8. 1 1/2 tsp. milk
9. Place ingredients in machine following the specifications of that
10. particular machine. Set for dough cycle. After complete on dough
11. cycle, remove from machine and roll out to 17x10" (approx.) rectangle.
12. Mix together brown sugar and cinnamon. Spread softened butter over
13. dough. Sprinkle brown sugar and cinnamon mixture over top. Roll
14. tightly from long end, pinching edges closed when completely rolled.
15. Slice rolled dough into 1/2" slices (or large if a larger bun is
16. preferred).  Place into greased cake pans or a cookie sheet.  If
17. using cake pans, use 3 9" pans. Let rise until doubled. Bake at
18. 350 for 15-20 minutes, until golden. Do not overbake.
19. Spread on very warm rolls. They are best when eaten fresh, but we
20. have found that 10-15 seconds in the microwave rejuvenates them.
21. Note:  You may add chopped nuts with the filling, and use twice
22. the amount of cinnamon.
23. (date created: 6/27/2007 4:42:14 PM)
*** Credits
# -*- mode: org; coding: utf-8 -*-
** Crackling Cornbread (from Silver Palate)
Southern-style goodness. Serve this comforting bread warm with lots of butter and honey.
Total Time: under 1 hour
*** Ingredients
- Butter, for greasing the pan
- 1 cup stone-ground cornmeal
- 1 cup unbleached all-purpose flour
- 1/3 cup sugar
- 2½ teaspoons baking powder
- ¼ teaspoon salt
- 1 cup buttermilk
- 6 tablespoons (¾ stick) unsalted butter, melted
- 1 egg, lightly beaten
*** Method
1. Preheat the oven to 400 degreesF. Grease a 9-inch square baking pan.
2. Stir the dry ingredients together in a bowl. Then stir in the buttermilk, melted butter, and egg and mix gently.
3. Pour the batter into the prepared pan, set on the center rack of the oven, and bake for 25 minutes. The corn bread is done when the edges are lightly browned and a knife inserted in the center comes out clean. Cut into 3-inch squares to serve.
4. Variation: Spoon the batter into 10 greased muffin cups and bake for about 20 minutes.
*** Credits
9 squares
Read more at http://www.cookstr.com/recipes/crackling-corn-bread#UIc5zjOZugckUws9.99
** Crusty European-Style Hard Rolls
These rolls have a delicious crackly/crunchy crust, partly the result of allowing them to proof in the refrigerator, partly from an egg white wash applied just prior to baking. Their texture is light and airy, rather than substantial, which makes them a wonderful mini-sandwich roll. Make them slightly larger, and they're perfect for hamburgers or grilled sausage. Or serve them at breakfast, with butter and preserves, as they do in Europe. 
Notice that this recipe includes just over 1/4 teaspoon yeast. Why so little? Because of the extra-long fermentation, key to developing the rolls' flavor. As the dough rests, the yeast will continue to multiply; thus there's no need to "front-load" with lots of yeast initially.
Note: These take roughly a whole day, including *9 hours* on "day of" to make!
*** Ingredients
**** Starter
- 113g cool water
- 120g King Arthur Unbleached All-Purpose Flour
- 1/8 teaspoon instant yeast
**** Dough
- all of the starter
- 418g King Arthur Unbleached All-Purpose Flour
- 227g lukewarm water
- 1 1/2 teaspoons salt
- 1/4 teaspoon instant yeast
**** Egg wash
- 1 large egg white mixed with 1-2 tablespoon cool water
