recipes.html
<div id="outline-container-org92c05d8" class="outline-4">
<h4 id="org92c05d8">Method</h4>
<div class="outline-text-4" id="text-org92c05d8">
<ol class="org-ol">
<li>Adjust oven rack to the lowest position and heat to 200 degrees. once the oven temp reaches 200, maintain the heat for 10 minutes and turn off the oven.</li>
<li>Mix 7 cups (840g) of the flour and the salt in a bowl.</li>
<li>Mix the milk,cream, butter, and 1/2 cup sugar in a saucepan and heat over medium heat until foam forms around the edges. Remove from the burner and place on a hot pad in the fridge to cool only to luke warm. You do not want cold milk, but it cannot be hot either.</li>
<li>In a glass measuring cup, add the warm water and yeast with the 4 teaspoons of sugar. Allow to foam for 5-10 minutes.</li>
<li>In a bowl of a standing mixer, add the milk mixture and about 2 cups (240g) of the flour. Using the dough hook, mix for about 30 seconds. scrape down the sides of the bowl and add the yeast mixture. beat again for 3 minutes. Add the eggs and beat for 30 seconds. Add the remaining flour and beat on medium then medium high for 1-2 minutes or until the dough is pulling away from the mixer but still slightly sticky to the touch.</li>
<li>Place in a clean, lightly oiled bowl and cover with a towel to rise for 1-2 hours, sometimes I let mine go for 3 hours.</li>
<li>Punch down the dough and place on a lightly floured surface. form into balls and then roll in butter, herb mixture and then place in greased pie dishes (about 2 dishes), covered lightly with a towel to rise for 1 hour or until doubled in size.</li>
<li>Bake at 375 for 15-20 minutes or until lightly golden on top. Serve immediately.</li>
</ol>
</div>
</div>
<div id="outline-container-orgf31e4de" class="outline-4">
<h4 id="orgf31e4de">Herbs</h4>
<div class="outline-text-4" id="text-orgf31e4de">
</div>
<ul class="org-ul">
<li><a id="org6b895bc"></a>Ingredients<br />
<div class="outline-text-5" id="text-org6b895bc">
<ul class="org-ul">
<li>1/4 teaspoon parsley</li>
<li>1/4 teaspoon dill</li>
<li>1/4 teaspoon thyme</li>
<li>1/4 teaspoon basil</li>
<li>1/4 teaspoon rosemary</li>
<li>1/2 cup parmesan cheese, (kraft powdered kind)</li>
<li>1/2 cup butter, melted</li>
<li>2 teaspoons garlic</li>
</ul>
</div>
</li>
<li><a id="org483f054"></a>Method<br />
<div class="outline-text-5" id="text-org483f054">
<ol class="org-ol">
<li>Put butter and garlic in a bowl, seasoning and cheese in another.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org55c1301" class="outline-4">
<h4 id="org55c1301">Credits</h4>
<div class="outline-text-4" id="text-org55c1301">
<p>
<a href="http://www.ohsweetbasil.com/herby-garlicky-cheesy-bread.html">http://www.ohsweetbasil.com/herby-garlicky-cheesy-bread.html</a>
Made for 4th of July party <span class="timestamp-wrapper"><span class="timestamp">[2016-07-03 Sun]</span></span>. They were a big hit with the crowd, but I thought they were a lot like the stuff you get at Olive Garden.
</p>
</div>
</div>
</div>
<div id="outline-container-orga3da177" class="outline-3">
<h3 id="orga3da177">Cinnabons (using Bread Machine)</h3>
<div class="outline-text-3" id="text-orga3da177">
</div>
<div id="outline-container-org16121a9" class="outline-4">
<h4 id="org16121a9">Ingredients</h4>
<div class="outline-text-4" id="text-org16121a9">
<ul class="org-ul">
<li>1/4 cup butter, melted</li>
<li>1/4 cup water</li>
<li>1/2 pkg. instant vanilla pudding (1/2 of a 3.4 oz. box)</li>
<li>1 cup milk</li>
<li>1 egg, beaten</li>
<li>1 tbsp. sugar</li>
<li>1/2 tsp. salt</li>
<li>4 cup bread flour</li>
<li>2 1/2 tsp. yeast</li>
</ul>
</div>
</div>
<div id="outline-container-orgb6d3815" class="outline-4">
<h4 id="orgb6d3815">Method</h4>
<div class="outline-text-4" id="text-orgb6d3815">
<ol class="org-ol">
<li>1/2 cup butter, softened</li>
<li>1 cup brown sugar</li>
<li>2 tsp. cinnamon</li>
<li>4 oz. cream cheese, softened</li>
<li>1/4 cup butter, softened</li>
<li>1 1/2 cup confectioners sugar</li>
<li>1/2 tsp. vanilla</li>
<li>1 1/2 tsp. milk</li>
<li>Place ingredients in machine following the specifications of that</li>
<li>particular machine. Set for dough cycle. After complete on dough</li>
<li>cycle, remove from machine and roll out to 17x10" (approx.) rectangle.</li>
<li>Mix together brown sugar and cinnamon. Spread softened butter over</li>
<li>dough. Sprinkle brown sugar and cinnamon mixture over top. Roll</li>
<li>tightly from long end, pinching edges closed when completely rolled.</li>
<li>Slice rolled dough into 1/2" slices (or large if a larger bun is</li>
<li>preferred).  Place into greased cake pans or a cookie sheet.  If</li>
<li>using cake pans, use 3 9" pans. Let rise until doubled. Bake at</li>
<li>350 for 15-20 minutes, until golden. Do not overbake.</li>
<li>Spread on very warm rolls. They are best when eaten fresh, but we</li>
<li>have found that 10-15 seconds in the microwave rejuvenates them.</li>
<li>Note:  You may add chopped nuts with the filling, and use twice</li>
<li>the amount of cinnamon.</li>
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ol>
</div>
</div>
<div id="outline-container-org4a0a1e2" class="outline-4">
<h4 id="org4a0a1e2">Credits</h4>
<div class="outline-text-4" id="text-org4a0a1e2">
</div>
</div>
</div>
<div id="outline-container-orga052b58" class="outline-3">
<h3 id="orga052b58">Crackling Cornbread (from Silver Palate)</h3>
<div class="outline-text-3" id="text-orga052b58">
<p>
Southern-style goodness. Serve this comforting bread warm with lots of butter and honey.
Total Time: under 1 hour
</p>
</div>
<div id="outline-container-org1002fc8" class="outline-4">
<h4 id="org1002fc8">Ingredients</h4>
<div class="outline-text-4" id="text-org1002fc8">
<ul class="org-ul">
<li>Butter, for greasing the pan</li>
<li>1 cup stone-ground cornmeal</li>
<li>1 cup unbleached all-purpose flour</li>
<li>1/3 cup sugar</li>
<li>2½ teaspoons baking powder</li>
<li>¼ teaspoon salt</li>
<li>1 cup buttermilk</li>
<li>6 tablespoons (¾ stick) unsalted butter, melted</li>
<li>1 egg, lightly beaten</li>
</ul>
</div>
</div>
<div id="outline-container-orge635f2a" class="outline-4">
<h4 id="orge635f2a">Method</h4>
<div class="outline-text-4" id="text-orge635f2a">
<ol class="org-ol">
<li>Preheat the oven to 400 degreesF. Grease a 9-inch square baking pan.</li>
<li>Stir the dry ingredients together in a bowl. Then stir in the buttermilk, melted butter, and egg and mix gently.</li>
<li>Pour the batter into the prepared pan, set on the center rack of the oven, and bake for 25 minutes. The corn bread is done when the edges are lightly browned and a knife inserted in the center comes out clean. Cut into 3-inch squares to serve.</li>
<li>Variation: Spoon the batter into 10 greased muffin cups and bake for about 20 minutes.</li>
</ol>
</div>
</div>
<div id="outline-container-org7052b0f" class="outline-4">
<h4 id="org7052b0f">Credits</h4>
<div class="outline-text-4" id="text-org7052b0f">
<p>
9 squares
Read more at <a href="http://www.cookstr.com/recipes/crackling-corn-bread#UIc5zjOZugckUws9.99">http://www.cookstr.com/recipes/crackling-corn-bread#UIc5zjOZugckUws9.99</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org3658595" class="outline-3">
<h3 id="org3658595">Crusty European-Style Hard Rolls</h3>
<div class="outline-text-3" id="text-org3658595">
<p>
These rolls have a delicious crackly/crunchy crust, partly the result of allowing them to proof in the refrigerator, partly from an egg white wash applied just prior to baking. Their texture is light and airy, rather than substantial, which makes them a wonderful mini-sandwich roll. Make them slightly larger, and they're perfect for hamburgers or grilled sausage. Or serve them at breakfast, with butter and preserves, as they do in Europe. 
Notice that this recipe includes just over 1/4 teaspoon yeast. Why so little? Because of the extra-long fermentation, key to developing the rolls' flavor. As the dough rests, the yeast will continue to multiply; thus there's no need to "front-load" with lots of yeast initially.
Note: These take roughly a whole day, including <b>9 hours</b> on "day of" to make!
</p>
</div>
<div id="outline-container-org815f3b4" class="outline-4">
<h4 id="org815f3b4">Ingredients</h4>
<div class="outline-text-4" id="text-org815f3b4">
</div>
<ul class="org-ul">
<li><a id="org8b8e1db"></a>Starter<br />
<div class="outline-text-5" id="text-org8b8e1db">
<ul class="org-ul">
<li>113g cool water</li>
<li>120g King Arthur Unbleached All-Purpose Flour</li>
<li>1/8 teaspoon instant yeast</li>
</ul>
</div>
</li>
<li><a id="org7dcc8ad"></a>Dough<br />
<div class="outline-text-5" id="text-org7dcc8ad">
<ul class="org-ul">
<li>all of the starter</li>
<li>418g King Arthur Unbleached All-Purpose Flour</li>
<li>227g lukewarm water</li>
<li>1 1/2 teaspoons salt</li>
<li>1/4 teaspoon instant yeast</li>
</ul>
</div>
</li>
<li><a id="orgf9a7b7e"></a>Egg wash<br />
<div class="outline-text-5" id="text-orgf9a7b7e">
<ul class="org-ul">
<li>1 large egg white mixed with 1-2 tablespoon cool water</li>
</ul>
</div>
</li>
</ul>
</div>
