recipes.org
*** Method
1. To make the starter: Mix the starter ingredients together until smooth, cover, and let rest at room temperature overnight.
2. Combine all of the dough ingredients and mix and knead them together - by hand, mixer or bread machine - until you've made a soft, somewhat smooth dough; it should be cohesive, but the surface may still be a bit rough. It may also stick to the bowl just the tiniest bit.
3. Allow the dough to rise, covered, for 3 hours, gently deflating it and turning it over after 1 hour, and again after 2 hours.
4. Turn the dough out onto a lightly greased work surface. Divide it into 12 pieces, shape the pieces into balls, and firm them up by rolling them under your lightly cupped fingers.
5. Place the rolls on a parchment-lined baking sheet, cover them, and let them rise for 1 to 2 hours, until they're puffy, though not doubled in size. They'll flatten out a bit as they rise; that's OK.
6. Cover the rolls, and refrigerate them for 2 to 3 hours. Towards the end of the rolls' chill, preheat the oven to 425 degreesF.
7. Whisk together the egg white and water until frothy. Remove the rolls from the refrigerator, and brush them with the wash; you won't use it all up. Again, don't be discouraged if the rolls seem a bit flat; they'll pick up when the hit the oven's heat.
8. Slash a 1/4" deep cut across the top of each roll. Immediately put the rolls into the oven.
9. Bake the rolls for 20 to 25 minutes, until they're a deep golden brown. Remove them from the oven, and cool on a rack. Or, for best crunch, open the oven door, and allow the rolls to cool in the turned-off, open-door oven.
*** Yield
- 12 small rolls
*** Credits
For larger rolls, divide the dough into 8 pieces, rather than 12. Bake for a minute or two longer.
http://www.kingarthurflour.com/recipes/PrintRecipe?RID=1927&radio=3
** Currant Soda
*** Ingredients
- 4 cups soda bread flour (or all-purpose plus 1 heaping teaspoon baking soda and 1 heaping teaspoon of cream of tartar)
- 1 heaping teaspoon baking soda
- pinch salt
- 1/4 cup granulated sugar
- 4 oz. dried fruit
- 1 3/4-2 cups buttermilk
- 1 tablespoon butter
*** Method
1. Sift the flour and baking soda into a large mixing bowl, then stir in th esalt, sugar, and fruit. Make a well in the ceter and pour in almost all the buttermilk.  Stir with a broad-bladed knife or wooden spoon to form a loose dough, adding the rest of the milk if necessary.
2. Use the butter to grease an 8-inch round cake pan, approximately 3 inches deep. Place the dough in the pan, leaving the surface rough. Sprinkle with a little flour, set the pan on a baking sheet, and bake in a preheated oven for 30 minutes.
3. Reduce the temperature and cook for a further 30 minutes until the bread is golden-brown and crisp to the touch. A skewer inserted in the center should come out clean.  Remove from the cake pan and wrap in a clean cloth. When col, cut in slices and serve buttered.
4. makes 1 round loaf
5. Prep time: 10-15 minutes
6. Cooking time: 1-1 1/4 hours
7. Oven temperature: 400 degrees F for 30 minutes, then reduce the temperature to 300 degrees F for a further 30-40 minutes.
*** Credits
- Irish Food & Folklore by Clare Connery
- Greg's 9/3/01 
- (date created: 6/27/2007 4:42:14 PM)
** Custardy Popovers
*** Ingredients
- 4 eggs
- 1 cup unbleached white flour
- 1 cup milk
- 1/2 tsp. salt
- 4 Tbs. melted butter
*** Method
1. Turn on the oven (to 375F) and put the muffin tin in while preheating.
2. Beat together the eggs and milk. Add flour and salt. Beat with a whisk until uniform. Don't over beat or whip.
3. When ready and the oven is preheated, take out the muffin tin, use a brush to coat all sides and bottom of the muffin wells with the melted butter. Work quickly before the muffin tin cools down.
4. Fill each muffin hole about 2/3 full with batter. Put tin back in the oven as quickly as you can.
5. Bake for 15 minutes in a convection oven or 35 minutes in a conventional oven without opening the oven door.
6. Take the muffins out, prick with a fork to let steam escape and help them hold their shape. Serve immediately with butter, jam and/or berries.
*** Credits
[[http://galsonfamilycookbook.blogspot.com/2010/11/custardy-popovers-from-moosewood.html][Galson Family Cookbook]], taken from the first Moosewood book
I've made these a few times; always a hit!
But you've got to eat them quick; they have a short shelf life.
** Homemade Pretzels
*** Ingredients
- 1 (1/4 ounce) package active dry years
- 1 cup warm water
- 2 Tbls butter, softened
- 1 Tbl sugar
- 1/2 tsp salt
- 2 3/4 cup all-purpose flour
- 4 cup water
- 2 Tbls baking soda
- Coarse salt
- Prepared mustard
*** Method
1. In large mixing bowl, dissoved yeast in warm water. Add butter, sugar, salt and 2 cups flour. Beat until smooth. Stir in remaining flour for soft dough.
2. Cover and let rise in warm place for 20 minutes.
3. Punch dough down. Divide into equal pieces.
4. On a lightly floured surface, roll each piece into a 15-inch long strip. Twist into pretzel shapes to make 1 dozen.
5. In a large non-aluminum saucepan, bring water to a boil. Add baking soda.
6. Drop 2 pretzels into water, boil for 1 minute. Remove with slotted spoon; drain.
7. Place on greased baking sheet; sprinkle with coarse salt.
8. Repeat with remaining pretzels.
9. Bake in oven at 475 degrees for 10 to 12 minutes.
*** Yields 1 dozen pretzels.
*** Credits
- 31 Dec 2005 -- The Hunterdon Observer
- (date created: 6/27/2007 4:42:12 PM)
** Easy Hot Cross Buns
*** Times
- PREP:  25 mins. to 35 mins.
- BAKE:  20 mins. to 20 mins.
- TOTAL:  2 hrs 45 mins. to 3 hrs 15 mins.
- YIELD: 12 to 14 buns
This soft dough is easily shaped, and makes tender, aromatic buns, ready for an icing cross on top.
*** Ingredients
