recipes.html
<div id="outline-container-org02dfe3b" class="outline-4">
<h4 id="org02dfe3b">Method</h4>
<div class="outline-text-4" id="text-org02dfe3b">
<ol class="org-ol">
<li>To make the starter: Mix the starter ingredients together until smooth, cover, and let rest at room temperature overnight.</li>
<li>Combine all of the dough ingredients and mix and knead them together - by hand, mixer or bread machine - until you've made a soft, somewhat smooth dough; it should be cohesive, but the surface may still be a bit rough. It may also stick to the bowl just the tiniest bit.</li>
<li>Allow the dough to rise, covered, for 3 hours, gently deflating it and turning it over after 1 hour, and again after 2 hours.</li>
<li>Turn the dough out onto a lightly greased work surface. Divide it into 12 pieces, shape the pieces into balls, and firm them up by rolling them under your lightly cupped fingers.</li>
<li>Place the rolls on a parchment-lined baking sheet, cover them, and let them rise for 1 to 2 hours, until they're puffy, though not doubled in size. They'll flatten out a bit as they rise; that's OK.</li>
<li>Cover the rolls, and refrigerate them for 2 to 3 hours. Towards the end of the rolls' chill, preheat the oven to 425 degreesF.</li>
<li>Whisk together the egg white and water until frothy. Remove the rolls from the refrigerator, and brush them with the wash; you won't use it all up. Again, don't be discouraged if the rolls seem a bit flat; they'll pick up when the hit the oven's heat.</li>
<li>Slash a 1/4" deep cut across the top of each roll. Immediately put the rolls into the oven.</li>
<li>Bake the rolls for 20 to 25 minutes, until they're a deep golden brown. Remove them from the oven, and cool on a rack. Or, for best crunch, open the oven door, and allow the rolls to cool in the turned-off, open-door oven.</li>
</ol>
</div>
</div>
<div id="outline-container-org3dfcaa9" class="outline-4">
<h4 id="org3dfcaa9">Yield</h4>
<div class="outline-text-4" id="text-org3dfcaa9">
<ul class="org-ul">
<li>12 small rolls</li>
</ul>
</div>
</div>
<div id="outline-container-org225701c" class="outline-4">
<h4 id="org225701c">Credits</h4>
<div class="outline-text-4" id="text-org225701c">
<p>
For larger rolls, divide the dough into 8 pieces, rather than 12. Bake for a minute or two longer.
<a href="http://www.kingarthurflour.com/recipes/PrintRecipe?RID=1927&amp;radio=3">http://www.kingarthurflour.com/recipes/PrintRecipe?RID=1927&amp;radio=3</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org32cf4d8" class="outline-3">
<h3 id="org32cf4d8">Currant Soda</h3>
<div class="outline-text-3" id="text-org32cf4d8">
</div>
<div id="outline-container-orgaf951ed" class="outline-4">
<h4 id="orgaf951ed">Ingredients</h4>
<div class="outline-text-4" id="text-orgaf951ed">
<ul class="org-ul">
<li>4 cups soda bread flour (or all-purpose plus 1 heaping teaspoon baking soda and 1 heaping teaspoon of cream of tartar)</li>
<li>1 heaping teaspoon baking soda</li>
<li>pinch salt</li>
<li>1/4 cup granulated sugar</li>
<li>4 oz. dried fruit</li>
<li>1 3/4-2 cups buttermilk</li>
<li>1 tablespoon butter</li>
</ul>
</div>
</div>
<div id="outline-container-org3d3b804" class="outline-4">
<h4 id="org3d3b804">Method</h4>
<div class="outline-text-4" id="text-org3d3b804">
<ol class="org-ol">
<li>Sift the flour and baking soda into a large mixing bowl, then stir in th esalt, sugar, and fruit. Make a well in the ceter and pour in almost all the buttermilk.  Stir with a broad-bladed knife or wooden spoon to form a loose dough, adding the rest of the milk if necessary.</li>
<li>Use the butter to grease an 8-inch round cake pan, approximately 3 inches deep. Place the dough in the pan, leaving the surface rough. Sprinkle with a little flour, set the pan on a baking sheet, and bake in a preheated oven for 30 minutes.</li>
<li>Reduce the temperature and cook for a further 30 minutes until the bread is golden-brown and crisp to the touch. A skewer inserted in the center should come out clean.  Remove from the cake pan and wrap in a clean cloth. When col, cut in slices and serve buttered.</li>
<li>makes 1 round loaf</li>
<li>Prep time: 10-15 minutes</li>
<li>Cooking time: 1-1 1/4 hours</li>
<li>Oven temperature: 400 degrees F for 30 minutes, then reduce the temperature to 300 degrees F for a further 30-40 minutes.</li>
</ol>
</div>
</div>
<div id="outline-container-org580091d" class="outline-4">
<h4 id="org580091d">Credits</h4>
<div class="outline-text-4" id="text-org580091d">
<ul class="org-ul">
<li>Irish Food &amp; Folklore by Clare Connery</li>
<li>Greg's 9/3/01</li>
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4616fa5" class="outline-3">
<h3 id="org4616fa5">Custardy Popovers</h3>
<div class="outline-text-3" id="text-org4616fa5">
</div>
<div id="outline-container-org2212785" class="outline-4">
<h4 id="org2212785">Ingredients</h4>
<div class="outline-text-4" id="text-org2212785">
<ul class="org-ul">
<li>4 eggs</li>
<li>1 cup milk</li>
<li>1 cup unbleached white flour</li>
<li>1/2 tsp. salt</li>
<li>4 Tbs. melted butter</li>
</ul>
</div>
</div>
<div id="outline-container-org8fac41e" class="outline-4">
<h4 id="org8fac41e">Method</h4>
<div class="outline-text-4" id="text-org8fac41e">
<ol class="org-ol">
<li>Turn on the oven (to 375F) and put the muffin tin in while preheating.</li>
<li>Beat together the eggs and milk. Add flour and salt. Beat with a whisk until uniform. Don't over beat or whip.</li>
<li>When ready and the oven is preheated, take out the muffin tin, use a brush to coat all sides and bottom of the muffin wells with the melted butter. Work quickly before the muffin tin cools down.</li>
<li>Fill each muffin hole about 2/3 full with batter. Put tin back in the oven as quickly as you can.</li>
<li>Bake for 15 minutes in a convection oven or 35 minutes in a conventional oven without opening the oven door.</li>
<li>Take the muffins out, prick with a fork to let steam escape and help them hold their shape. Serve immediately with butter, jam and/or berries.</li>
</ol>
</div>
</div>
<div id="outline-container-org44a77ac" class="outline-4">
<h4 id="org44a77ac">Credits</h4>
<div class="outline-text-4" id="text-org44a77ac">
<p>
<a href="http://galsonfamilycookbook.blogspot.com/2010/11/custardy-popovers-from-moosewood.html">Galson Family Cookbook</a>, taken from the first Moosewood book
I've made these a few times; always a hit!
But you've got to eat them quick; they have a short shelf life.
</p>
</div>
</div>
</div>
<div id="outline-container-org035eedf" class="outline-3">
<h3 id="org035eedf">Homemade Pretzels</h3>
<div class="outline-text-3" id="text-org035eedf">
</div>
<div id="outline-container-orge56d86b" class="outline-4">
<h4 id="orge56d86b">Ingredients</h4>
<div class="outline-text-4" id="text-orge56d86b">
<ul class="org-ul">
<li>1 (1/4 ounce) package active dry years</li>
<li>1 cup warm water</li>
<li>2 Tbls butter, softened</li>
<li>1 Tbl sugar</li>
<li>1/2 tsp salt</li>
<li>2 3/4 cup all-purpose flour</li>
<li>4 cup water</li>
<li>2 Tbls baking soda</li>
<li>Coarse salt</li>
<li>Prepared mustard</li>
</ul>
</div>
</div>
<div id="outline-container-org03adcfe" class="outline-4">
<h4 id="org03adcfe">Method</h4>
<div class="outline-text-4" id="text-org03adcfe">
<ol class="org-ol">
<li>In large mixing bowl, dissoved yeast in warm water. Add butter, sugar, salt and 2 cups flour. Beat until smooth. Stir in remaining flour for soft dough.</li>
<li>Cover and let rise in warm place for 20 minutes.</li>
<li>Punch dough down. Divide into equal pieces.</li>
<li>On a lightly floured surface, roll each piece into a 15-inch long strip. Twist into pretzel shapes to make 1 dozen.</li>
<li>In a large non-aluminum saucepan, bring water to a boil. Add baking soda.</li>
<li>Drop 2 pretzels into water, boil for 1 minute. Remove with slotted spoon; drain.</li>
<li>Place on greased baking sheet; sprinkle with coarse salt.</li>
<li>Repeat with remaining pretzels.</li>
<li>Bake in oven at 475 degrees for 10 to 12 minutes.</li>
</ol>
</div>
</div>
<div id="outline-container-orgddbb5b1" class="outline-4">
<h4 id="orgddbb5b1">Yields 1 dozen pretzels.</h4>
</div>
<div id="outline-container-org7133887" class="outline-4">
<h4 id="org7133887">Credits</h4>
<div class="outline-text-4" id="text-org7133887">
<ul class="org-ul">
<li>31 Dec 2005 &#x2013; The Hunterdon Observer</li>
<li>(date created: 6/27/2007 4:42:12 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc0b1328" class="outline-3">
<h3 id="orgc0b1328">Easy Hot Cross Buns</h3>
<div class="outline-text-3" id="text-orgc0b1328">
</div>
<div id="outline-container-org613ecc8" class="outline-4">
<h4 id="org613ecc8">Times</h4>
<div class="outline-text-4" id="text-org613ecc8">
<ul class="org-ul">
<li>PREP:  25 mins. to 35 mins.</li>
<li>BAKE:  20 mins. to 20 mins.</li>
<li>TOTAL:  2 hrs 45 mins. to 3 hrs 15 mins.</li>
<li>YIELD: 12 to 14 buns</li>
</ul>
<p>
This soft dough is easily shaped, and makes tender, aromatic buns, ready for an icing cross on top.
</p>
</div>
</div>
