recipes.org
**** Buns:
- 1/4 cup (57g) apple juice or rum
- 1/2 cup (78g) mixed dried fruit
- 1/2 cup (78g) raisins or dried currants
- 1.25 cup (283g) milk, room temperature
- 2 large eggs, plus 1 egg yolk (save the white for the topping)
- 6 tablespoons (85g) butter, room temperature
- 2 teaspoons instant yeast
- 1/4 cup (53g) light brown sugar, firmly packed
- 1 teaspoon ground cinnamon
- 1/4 teaspoon ground cloves or allspice
- 1/4 teaspoon ground nutmeg
- 1 3/4 teaspoons salt
- 1 tablespoon baking powder
- 4.5 cups (539g) King Arthur Unbleached All-Purpose Flour
**** Topping:
- 1 large egg white, reserved from above
- t Tablespoon (14g) milk
**** Icing:
- 1 cup + 2 tablespoons (128g) confectioners' sugar
- 1/2 teaspoon vanilla extract
- pinch of salt
- 4 teaspoons milk, or enough to make a thick, pipeable icing
*** Method
1. Lightly grease a 10" square pan or 9" x 13" pan.
2. Mix the rum or apple juice with the dried fruit and raisins, cover with plastic wrap, and microwave briefly, just till the fruit and liquid are very warm, and the plastic starts to "shrink wrap" itself over the top of the bowl. Set aside to cool to room temperature. Note: If you worry about using plastic wrap in your microwave, simply cover the bowl with a glass lid.
3. When the fruit is cool, mix together all of the dough ingredients (including the eggs and the egg yolk from the separated egg); hold out the fruit for the time being. Knead the mixture, using an electric mixer or bread machine, until the dough is soft and elastic. Mix in the fruit and any liquid not absorbed.
4. Let the dough rise for 1 hour, covered. It should become puffy, though may not double in bulk.
5. Divide the dough into billiard ball-sized pieces, about 3 3/4 ounces each. A heaped muffin scoop (about 1/3 cup) makes about the right portion. You'll make 12 to 14 buns. Use your greased hands to round them into balls. Arrange them in the prepared pan.
6. Cover the pan, and let the buns rise for 1 hour, or until they've puffed up and are touching one another. While the dough is rising, preheat the oven to 375 degreesF.
7. Whisk together the reserved egg white and milk, and brush it over the buns.
8. Bake the buns for 20 minutes, until they're golden brown. Remove from the oven, carefully turn the buns out of the pan (they should come out in one large piece), and transfer them to a rack to cool.
9. Mix together the icing ingredients, and when the buns are completely cool, pipe it in a cross shape atop each bun.
**** Tips from our bakers
Want to make these buns a day or so ahead of time? Try the *tangzhong technique*, a Japanese method for increasing the softness and shelf life of yeast rolls. 
- Begin by measuring out the flour and milk you'll be using in the recipe. 
- Now take 3 tablespoons of the measured flour and 1/2 cup of the measured milk; put them in a saucepan set over medium-high heat.
- Cook the mixture, whisking constantly, until it thickens and forms a thick slurry; this will take about 1 1/2 to 2 1/2 minutes. 
- Transfer the cooked mixture to a bowl, let it cool to lukewarm, then combine it with the remaining flour, milk, and other dough ingredients. 
- Proceed with the recipe as directed. 
- Well-wrapped and stored at room temperature, your finished hot cross buns should stay soft and fresh for several days.
*** Credits
https://www.kingarthurflour.com/recipes/PrintRecipe?RID=352&radio=1
** Irish Soda Bread
Printed from COOKS.COM
*** Ingredients
- 2 c. unsifted all-purpose flour
- 2 tbsp. sugar
- 1 tsp. baking powder
- 1 tsp. baking soda
- 1/2 tsp. salt
- 3 tbsp. butter, softened
- 1/2 c. dark seedless raisins
- 1 c. buttermilk
- 1 tbsp. butter, melted
*** Method
1. Preheat oven to 375 degrees. Using solid vegetable shortening, lightly grease the surface of a small baking sheet. Set aside until bread is shaped.
2. Assemble all ingredients for Irish soda bread. (Make bread the same day you plan to serve it.)
3. Put flour, sugar, baking powder, baking soda and salt in a sifter; sift over a large bowl.
4. Add softened butter and cut into flour mixture, using a pastry blender or fork until mixture looks like fine crumbs.
5. Add raisins and toss thoroughly.
6. Pour buttermilk into flour mixture all at once.
7. Gently toss mixture together with a fork until all dry ingredients are just moistened. Do not overmix.
8. Using hands, gently gather flour mixture together and press firmly into a ball.
9. Put dough on a lightly floured pastry cloth or board. Knead gently with the palms of your hands until dough is smooth (about 1 minute). Shape into a smooth round ball and place on the prepared baking sheet.
10. Using hands, flatten dough into a circle that is about seven inches in diameter. (Dough will be about 1 1/2" thick.) Press a large floured knife into center of loaf, halfway through dough. Repeat, at right angle, to divide loaf into quarters.
11. Bake bread for 30 to 40 minutes, or until top is golden brown and loaf sounds hollow when tapped on the bottom and sides with a wooden spoon.
12. Remove to a wire rack to cool. Brush top with melted butter and later, dust with flour. Makes one loaf.
*** Credits
- http://www.cooks.com/rec/doc/0,194,157171-238200,00.html
- (date created: 5/2/2009 2:38:16 PM)
** Italian Country Bread
Makes 2 large loaves
*** Description
This is a classic rustic bread, sometimes known as /pane bianco/ or /pane casalinga/, made into one large round and baked on a hot stone to produce a crusty, domed outer crust and a moist interior full of irregular holes. It is perfect with food and wonderful to have on hand to serve with wines before a meal. Note that the technique varies from traditional American bread receipes: cool liquid, a small amount of yeast, an initial rising with a sponge, along resting time to develop taste, moist dough and a high baking temperature. It appeals to the purist since nothing is added to detract from the developed fragrance and flavor of the grain. Note that unbleached all-purpose flour is used, as it has a protein content similar to that of 00 grade flour in Italy (12 percent) and creates a fine, white loaf.
*** Ingredients
**** Sponge
- 1 teaspoon active dry yeast
- 1/3 cup lukewarm water (90 - 100 degrees)
- 2/3 cup milk at room temperature
- 1 teaspoon honey, maple syrup or malt syrup
- 2 cups (240 grams) unbleached all-purpose flour
