recipes.html
<div id="outline-container-org6c0911d" class="outline-4">
<h4 id="org6c0911d">Ingredients</h4>
<div class="outline-text-4" id="text-org6c0911d">
</div>
<ul class="org-ul">
<li><a id="org731532e"></a>Buns:<br />
<div class="outline-text-5" id="text-org731532e">
<ul class="org-ul">
<li>1/4 cup (57g) apple juice or rum</li>
<li>1/2 cup (78g) mixed dried fruit</li>
<li>1/2 cup (78g) raisins or dried currants</li>
<li>1.25 cup (283g) milk, room temperature</li>
<li>2 large eggs, plus 1 egg yolk (save the white for the topping)</li>
<li>6 tablespoons (85g) butter, room temperature</li>
<li>2 teaspoons instant yeast</li>
<li>1/4 cup (53g) light brown sugar, firmly packed</li>
<li>1 teaspoon ground cinnamon</li>
<li>1/4 teaspoon ground cloves or allspice</li>
<li>1/4 teaspoon ground nutmeg</li>
<li>1 3/4 teaspoons salt</li>
<li>1 tablespoon baking powder</li>
<li>4.5 cups (539g) King Arthur Unbleached All-Purpose Flour</li>
</ul>
</div>
</li>
<li><a id="org580d02f"></a>Topping:<br />
<div class="outline-text-5" id="text-org580d02f">
<ul class="org-ul">
<li>1 large egg white, reserved from above</li>
<li>t Tablespoon (14g) milk</li>
</ul>
</div>
</li>
<li><a id="org775eddf"></a>Icing:<br />
<div class="outline-text-5" id="text-org775eddf">
<ul class="org-ul">
<li>1 cup + 2 tablespoons (128g) confectioners' sugar</li>
<li>1/2 teaspoon vanilla extract</li>
<li>pinch of salt</li>
<li>4 teaspoons milk, or enough to make a thick, pipeable icing</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org26be30b" class="outline-4">
<h4 id="org26be30b">Method</h4>
<div class="outline-text-4" id="text-org26be30b">
<ol class="org-ol">
<li>Lightly grease a 10" square pan or 9" x 13" pan.</li>
<li>Mix the rum or apple juice with the dried fruit and raisins, cover with plastic wrap, and microwave briefly, just till the fruit and liquid are very warm, and the plastic starts to "shrink wrap" itself over the top of the bowl. Set aside to cool to room temperature. Note: If you worry about using plastic wrap in your microwave, simply cover the bowl with a glass lid.</li>
<li>When the fruit is cool, mix together all of the dough ingredients (including the eggs and the egg yolk from the separated egg); hold out the fruit for the time being. Knead the mixture, using an electric mixer or bread machine, until the dough is soft and elastic. Mix in the fruit and any liquid not absorbed.</li>
<li>Let the dough rise for 1 hour, covered. It should become puffy, though may not double in bulk.</li>
<li>Divide the dough into billiard ball-sized pieces, about 3 3/4 ounces each. A heaped muffin scoop (about 1/3 cup) makes about the right portion. You'll make 12 to 14 buns. Use your greased hands to round them into balls. Arrange them in the prepared pan.</li>
<li>Cover the pan, and let the buns rise for 1 hour, or until they've puffed up and are touching one another. While the dough is rising, preheat the oven to 375 degreesF.</li>
<li>Whisk together the reserved egg white and milk, and brush it over the buns.</li>
<li>Bake the buns for 20 minutes, until they're golden brown. Remove from the oven, carefully turn the buns out of the pan (they should come out in one large piece), and transfer them to a rack to cool.</li>
<li>Mix together the icing ingredients, and when the buns are completely cool, pipe it in a cross shape atop each bun.</li>
</ol>
</div>
<ul class="org-ul">
<li><a id="orga108780"></a>Tips from our bakers<br />
<div class="outline-text-5" id="text-orga108780">
<p>
Want to make these buns a day or so ahead of time? Try the <b>tangzhong technique</b>, a Japanese method for increasing the softness and shelf life of yeast rolls. 
</p>
<ul class="org-ul">
<li>Begin by measuring out the flour and milk you'll be using in the recipe.</li>
<li>Now take 3 tablespoons of the measured flour and 1/2 cup of the measured milk; put them in a saucepan set over medium-high heat.</li>
<li>Cook the mixture, whisking constantly, until it thickens and forms a thick slurry; this will take about 1 1/2 to 2 1/2 minutes.</li>
<li>Transfer the cooked mixture to a bowl, let it cool to lukewarm, then combine it with the remaining flour, milk, and other dough ingredients.</li>
<li>Proceed with the recipe as directed.</li>
<li>Well-wrapped and stored at room temperature, your finished hot cross buns should stay soft and fresh for several days.</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org5884ca1" class="outline-4">
<h4 id="org5884ca1">Credits</h4>
<div class="outline-text-4" id="text-org5884ca1">
<p>
<a href="https://www.kingarthurflour.com/recipes/PrintRecipe?RID=352&amp;radio=1">https://www.kingarthurflour.com/recipes/PrintRecipe?RID=352&amp;radio=1</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org8c71782" class="outline-3">
<h3 id="org8c71782">Irish Soda Bread</h3>
<div class="outline-text-3" id="text-org8c71782">
<p>
Printed from COOKS.COM
</p>
</div>
<div id="outline-container-org5486a5e" class="outline-4">
<h4 id="org5486a5e">Ingredients</h4>
<div class="outline-text-4" id="text-org5486a5e">
<ul class="org-ul">
<li>2 c. unsifted all-purpose flour</li>
<li>2 tbsp. sugar</li>
<li>1 tsp. baking powder</li>
<li>1 tsp. baking soda</li>
<li>1/2 tsp. salt</li>
<li>3 tbsp. butter, softened</li>
<li>1/2 c. dark seedless raisins</li>
<li>1 c. buttermilk</li>
<li>1 tbsp. butter, melted</li>
</ul>
</div>
</div>
<div id="outline-container-org32d5a6b" class="outline-4">
<h4 id="org32d5a6b">Method</h4>
<div class="outline-text-4" id="text-org32d5a6b">
<ol class="org-ol">
<li>Preheat oven to 375 degrees. Using solid vegetable shortening, lightly grease the surface of a small baking sheet. Set aside until bread is shaped.</li>
<li>Assemble all ingredients for Irish soda bread. (Make bread the same day you plan to serve it.)</li>
<li>Put flour, sugar, baking powder, baking soda and salt in a sifter; sift over a large bowl.</li>
<li>Add softened butter and cut into flour mixture, using a pastry blender or fork until mixture looks like fine crumbs.</li>
<li>Add raisins and toss thoroughly.</li>
<li>Pour buttermilk into flour mixture all at once.</li>
<li>Gently toss mixture together with a fork until all dry ingredients are just moistened. Do not overmix.</li>
<li>Using hands, gently gather flour mixture together and press firmly into a ball.</li>
<li>Put dough on a lightly floured pastry cloth or board. Knead gently with the palms of your hands until dough is smooth (about 1 minute). Shape into a smooth round ball and place on the prepared baking sheet.</li>
<li>Using hands, flatten dough into a circle that is about seven inches in diameter. (Dough will be about 1 1/2" thick.) Press a large floured knife into center of loaf, halfway through dough. Repeat, at right angle, to divide loaf into quarters.</li>
<li>Bake bread for 30 to 40 minutes, or until top is golden brown and loaf sounds hollow when tapped on the bottom and sides with a wooden spoon.</li>
<li>Remove to a wire rack to cool. Brush top with melted butter and later, dust with flour. Makes one loaf.</li>
</ol>
</div>
</div>
<div id="outline-container-orga7659a1" class="outline-4">
<h4 id="orga7659a1">Credits</h4>
<div class="outline-text-4" id="text-orga7659a1">
<ul class="org-ul">
<li><a href="http://www.cooks.com/rec/doc/0,194,157171-238200,00.html">http://www.cooks.com/rec/doc/0,194,157171-238200,00.html</a></li>
<li>(date created: 5/2/2009 2:38:16 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org08d28df" class="outline-3">
<h3 id="org08d28df">Italian Country Bread</h3>
<div class="outline-text-3" id="text-org08d28df">
<p>
Makes 2 large loaves
</p>
</div>
<div id="outline-container-org6fb3e2d" class="outline-4">
<h4 id="org6fb3e2d">Description</h4>
<div class="outline-text-4" id="text-org6fb3e2d">
<p>
This is a classic rustic bread, sometimes known as <i>pane bianco</i> or <i>pane casalinga</i>, made into one large round and baked on a hot stone to produce a crusty, domed outer crust and a moist interior full of irregular holes. It is perfect with food and wonderful to have on hand to serve with wines before a meal. Note that the technique varies from traditional American bread receipes: cool liquid, a small amount of yeast, an initial rising with a sponge, along resting time to develop taste, moist dough and a high baking temperature. It appeals to the purist since nothing is added to detract from the developed fragrance and flavor of the grain. Note that unbleached all-purpose flour is used, as it has a protein content similar to that of 00 grade flour in Italy (12 percent) and creates a fine, white loaf.
</p>
</div>
</div>
<div id="outline-container-orgb914ba1" class="outline-4">
<h4 id="orgb914ba1">Ingredients</h4>
<div class="outline-text-4" id="text-orgb914ba1">
</div>
<ul class="org-ul">
<li><a id="org182eac1"></a>Sponge<br />
<div class="outline-text-5" id="text-org182eac1">
<ul class="org-ul">
<li>1 teaspoon active dry yeast</li>
<li>1/3 cup lukewarm water (90 - 100 degrees)</li>
<li>2/3 cup milk at room temperature</li>
<li>1 teaspoon honey, maple syrup or malt syrup</li>
<li>2 cups (240 grams) unbleached all-purpose flour</li>
</ul>
</div>
</li>
