recipes.org
**** Dough
- 1 teaspoon active dry yeast
- 2 cups water at room temperature
- 1 tablespoon salt
- 5 - 5 1/2 cups (600 - 660 grams) unbleached all-purpose flour
                       /or/
- 4 - 4 1/2 cups (480 - 540 grams) unbleached all-purpose flour + 1/3 cup (40 grams) stone-ground whole-wheat flour + 1/3 cup (40 grams) rye meal (pumpernickle flour)
*** Method
1. To prepare the sponge: In a large bowl, sprinkle the yeast over warm water and milk. Stir to dissolve. Add the honey or syrup and flour. Beat with a whisk (or spoon) until smooth. Cover loosely with plastic wrap and let stand at room temperature at least 4 hours to overnight. This sponge can be stored up to 1 week in the refrigerator before using, if necessary. It will be bubbly.
2. To make the dough: Add the yeast, water, salt and 1 cup of the flour to the sponge. Beat hard with a whisk for 3 minutes or for 1 minute in a heavy-duty electric mixer fitted with  the paddle attachment on medium speed. Add the remaining flour 1 cup at a time, switching to a wooden spoon when necessary if making by hand. The dough will be smooth, yet not pull away from the sides of the bowl.
3. Turn the dough out onto a lightly floured surface and knead vigorously until very elastic, yet still moist and tacky, about 5 minutes. This is important for a good, light texture. Slam the dough hard against the work surface to develop the gluten. Set aside uncovered for 5 to 10 minutes. Knead again, and the sticky dough will smooth out without any extra flour. *==> Seriously consider using a machine for kneading; the dough is /extremely/ sticky! <==*
4. Place in an ungreased deep container (plastic is good), cover with plastic wrap, and let rise at room temperature for 3 hours to overnight. The dough should triple in volume.
5. Remove the dough from the container. Place on the work surface, knead lightly into 1 large or 2 small rounds, and flatten slightly. Dust lightly with flour and place in 1 or 2 dusted cloth-lined baskets, or bannetons or on a greased or parchment-lined baking sheet, smooth side down. Let rise uncovered at room temperature until soft and springy, 1 to 3 hours. Twenty minutes before baking, preheat the oven to 400 degrees with a baking stone in it, if desired.
6. /==> Consider *not* scoring the loaves, which pop like balloons! <==/ 
Slash a criss-cross design into the top of the free-form loaves no deeper than 1/4 inch, using a serrated knife. Slide the baking sheet into the hot oven (or carefully invert the loaves directly into the baking tone from the baskets), and bake until very dark and crusty, about 55 to 60 minutes. Cool on a rack. This bread is best completely cooled and reheated.
*** Credits
Baking Bread: /Old and New Traditions/ By Beth Hensperger pg 42-43
[2018-04-15 Sun] Boy did I screw up this time! 
I was in a rush in making the sponge and while I used all the Sponge ingredients, I added the amount of flour from /Dough/. It was very dry and I realized what I had done, so I threw in another cup of water. The next day I used just one cup of water and the Sponge flour. It was a bit tough to mix together and the dough was *very* wet. I added even more flour. It came out ok.
** Japanese Milk Bread Rolls
*** Ingredients
**** TANGZHONG (starter)
- 43g (3T) water
- 43g (3T) whole milk
- 14g (2T) King Arthur Unbleached Bread Flour or Organic Bread Flour
**** DOUGH
- 298g (2.5 cups) King Arthur Unbleached Bread Flour or Organic Bread Flour
- 18g (2T) Baker's Special Dry Milk or 11g (2T) nonfat dry milk
- 50g (1/4 cup) sugar
- 1 teaspoon salt
- 1 tablespoon instant yeast
- 113g (1/2 cup) whole milk
- 1 large egg
- 57g (1/4 cup; 4T) melted unsalted butter
*** Method
1. To make the tangzhong: Combine all of the ingredients in a small saucepan, and whisk until no lumps remain.
2. Place the saucepan over low heat, and cook the mixture, whisking constantly, until thick and the whisk leaves lines on the bottom of the pan, about 3 to 5 minutes.
3. Transfer the tangzhong to a small mixing bowl or measuring cup and let it cool to room temperature.
4. To make the dough: Combine the tangzhong with the remaining dough ingredients, then mix and knead -- by hand, mixer, or bread machine -- until a smooth, elastic dough forms.
5. Shape the dough into a ball, and let it rest in a lightly greased covered bowl for 60 to 90 minutes, until puffy but not necessarily doubled in bulk.
6. Gently deflate the dough, divide it into 8 equal pieces, and shape each piece into a ball.
7. Place the rolls into a lightly greased round bun pan. Cover the pan, and let the rolls rest for 40 to 50 minutes, until puffy. To use another pan, see "tips," below.
8. Preheat the oven to 350F. Brush the rolls with milk or egg wash (1 large egg beaten with 1 tablespoon cold water), and bake for 28 to 32 minutes, until golden brown on top; a digital thermometer inserted into the center of the middle roll should read at least 190F.
9. Remove the rolls from the oven. Allow them to cool in the pan for 10 minutes, then transfer them to a rack to cool completely.
*** Yield 8 rolls.
*** Credits
https://www.kingarthurflour.com/recipes/japanese-milk-bread-rolls-recipe
[2018-08-19 Sun] I make them in an 8" cake tin for T and me. Taste, light. They were a bit large; consider using a muffin pan to make 10 or 12 rolls?
** Lemon-Poppy Seed Muffins and/or Quick Bread Loaf
By Carroll Pellegrinelli, About.com
- "Using a cake mix make making these muffins so much easier."
- Serve these muffins warm with real butter.
- Prep Time: 25 minutes
- Cook Time: 25 minutes
*** Ingredients
- 2 large eggs
- 1 cup milk
- 1/2 cup oil or 1/2 cup butter, softened
- juice and zest of 1 lemon
- 1 18.25 ounce lemon cake mix
- 4 tablespoons poppy seeds
- Optional Lemon Glaze:
    - 4 teaspoons lemon juice
    - 1/4 cup powdered sugar
    - zest of 1 lemon
*** Method
1. Preheat oven to 350 degrees F.
2. Grease 18 muffin cups or grease and flour 2-9" x 5" loaf pans.
3. In a large bowl, with a hand mixer combine eggs, milk and oil.
4. Add lemon juice and zest. Blend.
5. Hand stir in cake mix and poppy seeds, only stirring until ingredients are moistened. There will be some lumps.
6. Bake for 25 minutes or until tester comes out clean.
7. Remove from muffin pan and cool on wire rack.
8. If using glaze: Stir together juice, sugar and zest. Drizzle over warm muffins. 
*** Credits
- http://baking.about.com/od/quickandsweetbreads/r/lemonpoppyseed.htm
- (date created: 5/2/2009 2:42:16 PM)
** No-knead Crusty Bread
