recipes.html
<li><a id="org799958f"></a>Dough<br />
<div class="outline-text-5" id="text-org799958f">
<ul class="org-ul">
<li>1 teaspoon active dry yeast</li>
<li>2 cups water at room temperature</li>
<li>1 tablespoon salt</li>
<li>5 - 5 1/2 cups (600 - 660 grams) unbleached all-purpose flour
<i>or</i></li>
<li>4 - 4 1/2 cups (480 - 540 grams) unbleached all-purpose flour + 1/3 cup (40 grams) stone-ground whole-wheat flour + 1/3 cup (40 grams) rye meal (pumpernickle flour)</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org119b26b" class="outline-4">
<h4 id="org119b26b">Method</h4>
<div class="outline-text-4" id="text-org119b26b">
<ol class="org-ol">
<li>To prepare the sponge: In a large bowl, sprinkle the yeast over warm water and milk. Stir to dissolve. Add the honey or syrup and flour. Beat with a whisk (or spoon) until smooth. Cover loosely with plastic wrap and let stand at room temperature at least 4 hours to overnight. This sponge can be stored up to 1 week in the refrigerator before using, if necessary. It will be bubbly.</li>
<li>To make the dough: Add the yeast, water, salt and 1 cup of the flour to the sponge. Beat hard with a whisk for 3 minutes or for 1 minute in a heavy-duty electric mixer fitted with  the paddle attachment on medium speed. Add the remaining flour 1 cup at a time, switching to a wooden spoon when necessary if making by hand. The dough will be smooth, yet not pull away from the sides of the bowl.</li>
<li>Turn the dough out onto a lightly floured surface and knead vigorously until very elastic, yet still moist and tacky, about 5 minutes. This is important for a good, light texture. Slam the dough hard against the work surface to develop the gluten. Set aside uncovered for 5 to 10 minutes. Knead again, and the sticky dough will smooth out without any extra flour. <b><code>=&gt; Seriously consider using a machine for kneading; the dough is /extremely/ sticky! &lt;=</code></b></li>
<li>Place in an ungreased deep container (plastic is good), cover with plastic wrap, and let rise at room temperature for 3 hours to overnight. The dough should triple in volume.</li>
<li>Remove the dough from the container. Place on the work surface, knead lightly into 1 large or 2 small rounds, and flatten slightly. Dust lightly with flour and place in 1 or 2 dusted cloth-lined baskets, or bannetons or on a greased or parchment-lined baking sheet, smooth side down. Let rise uncovered at room temperature until soft and springy, 1 to 3 hours. Twenty minutes before baking, preheat the oven to 400 degrees with a baking stone in it, if desired.</li>
<li><i><code>=&gt; Consider *not* scoring the loaves, which pop like balloons! &lt;=</code></i></li>
</ol>
<p>
Slash a criss-cross design into the top of the free-form loaves no deeper than 1/4 inch, using a serrated knife. Slide the baking sheet into the hot oven (or carefully invert the loaves directly into the baking tone from the baskets), and bake until very dark and crusty, about 55 to 60 minutes. Cool on a rack. This bread is best completely cooled and reheated.
</p>
</div>
</div>
<div id="outline-container-org9478c6a" class="outline-4">
<h4 id="org9478c6a">Credits</h4>
<div class="outline-text-4" id="text-org9478c6a">
<p>
Baking Bread: <i>Old and New Traditions</i> By Beth Hensperger pg 42-43
<span class="timestamp-wrapper"><span class="timestamp">[2018-04-15 Sun] </span></span> Boy did I screw up this time! 
I was in a rush in making the sponge and while I used all the Sponge ingredients, I added the amount of flour from <i>Dough</i>. It was very dry and I realized what I had done, so I threw in another cup of water. The next day I used just one cup of water and the Sponge flour. It was a bit tough to mix together and the dough was <b>very</b> wet. I added even more flour. It came out ok.
</p>
</div>
</div>
</div>
<div id="outline-container-org18c74e1" class="outline-3">
<h3 id="org18c74e1">Japanese Milk Bread Rolls</h3>
<div class="outline-text-3" id="text-org18c74e1">
</div>
<div id="outline-container-org1371321" class="outline-4">
<h4 id="org1371321">Ingredients</h4>
<div class="outline-text-4" id="text-org1371321">
</div>
<ul class="org-ul">
<li><a id="orgb180441"></a>TANGZHONG (starter)<br />
<div class="outline-text-5" id="text-orgb180441">
<ul class="org-ul">
<li>43g (3T) water</li>
<li>43g (3T) whole milk</li>
<li>14g (2T) King Arthur Unbleached Bread Flour or Organic Bread Flour</li>
</ul>
</div>
</li>
<li><a id="org3a5c48a"></a>DOUGH<br />
<div class="outline-text-5" id="text-org3a5c48a">
<ul class="org-ul">
<li>298g (2.5 cups) King Arthur Unbleached Bread Flour or Organic Bread Flour</li>
<li>18g (2T) Baker's Special Dry Milk or 11g (2T) nonfat dry milk</li>
<li>50g (1/4 cup) sugar</li>
<li>1 teaspoon salt</li>
<li>1 tablespoon instant yeast</li>
<li>113g (1/2 cup) whole milk</li>
<li>1 large egg</li>
<li>57g (1/4 cup; 4T) melted unsalted butter</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orge51d3c4" class="outline-4">
<h4 id="orge51d3c4">Method</h4>
<div class="outline-text-4" id="text-orge51d3c4">
<ol class="org-ol">
<li>To make the tangzhong: Combine all of the ingredients in a small saucepan, and whisk until no lumps remain.</li>
<li>Place the saucepan over low heat, and cook the mixture, whisking constantly, until thick and the whisk leaves lines on the bottom of the pan, about 3 to 5 minutes.</li>
<li>Transfer the tangzhong to a small mixing bowl or measuring cup and let it cool to room temperature.</li>
<li>To make the dough: Combine the tangzhong with the remaining dough ingredients, then mix and knead &#x2013; by hand, mixer, or bread machine &#x2013; until a smooth, elastic dough forms.</li>
<li>Shape the dough into a ball, and let it rest in a lightly greased covered bowl for 60 to 90 minutes, until puffy but not necessarily doubled in bulk.</li>
<li>Gently deflate the dough, divide it into 8 equal pieces, and shape each piece into a ball.</li>
<li>Place the rolls into a lightly greased round bun pan. Cover the pan, and let the rolls rest for 40 to 50 minutes, until puffy. To use another pan, see "tips," below.</li>
<li>Preheat the oven to 350F. Brush the rolls with milk or egg wash (1 large egg beaten with 1 tablespoon cold water), and bake for 28 to 32 minutes, until golden brown on top; a digital thermometer inserted into the center of the middle roll should read at least 190F.</li>
<li>Remove the rolls from the oven. Allow them to cool in the pan for 10 minutes, then transfer them to a rack to cool completely.</li>
</ol>
</div>
</div>
<div id="outline-container-org85403cc" class="outline-4">
<h4 id="org85403cc">Yield 8 rolls.</h4>
</div>
<div id="outline-container-orgfb84c7c" class="outline-4">
<h4 id="orgfb84c7c">Credits</h4>
<div class="outline-text-4" id="text-orgfb84c7c">
<p>
<a href="https://www.kingarthurflour.com/recipes/japanese-milk-bread-rolls-recipe">https://www.kingarthurflour.com/recipes/japanese-milk-bread-rolls-recipe</a>
<span class="timestamp-wrapper"><span class="timestamp">[2018-08-19 Sun] </span></span> I make them in an 8" cake tin for T and me. Taste, light. They were a bit large; consider using a muffin pan to make 10 or 12 rolls?
</p>
</div>
</div>
</div>
<div id="outline-container-org2f20715" class="outline-3">
<h3 id="org2f20715">Lemon-Poppy Seed Muffins and/or Quick Bread Loaf</h3>
<div class="outline-text-3" id="text-org2f20715">
<p>
By Carroll Pellegrinelli, About.com
</p>
<ul class="org-ul">
<li>"Using a cake mix make making these muffins so much easier."</li>
<li>Serve these muffins warm with real butter.</li>
<li>Prep Time: 25 minutes</li>
<li>Cook Time: 25 minutes</li>
</ul>
</div>
<div id="outline-container-org84a1492" class="outline-4">
<h4 id="org84a1492">Ingredients</h4>
<div class="outline-text-4" id="text-org84a1492">
<ul class="org-ul">
<li>2 large eggs</li>
<li>1 cup milk</li>
<li>1/2 cup oil or 1/2 cup butter, softened</li>
<li>juice and zest of 1 lemon</li>
<li>1 18.25 ounce lemon cake mix</li>
<li>4 tablespoons poppy seeds</li>
<li>Optional Lemon Glaze:
<ul class="org-ul">
<li>4 teaspoons lemon juice</li>
<li>1/4 cup powdered sugar</li>
<li>zest of 1 lemon</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org24d7a25" class="outline-4">
<h4 id="org24d7a25">Method</h4>
<div class="outline-text-4" id="text-org24d7a25">
<ol class="org-ol">
<li>Preheat oven to 350 degrees F.</li>
<li>Grease 18 muffin cups or grease and flour 2-9" x 5" loaf pans.</li>
<li>In a large bowl, with a hand mixer combine eggs, milk and oil.</li>
<li>Add lemon juice and zest. Blend.</li>
<li>Hand stir in cake mix and poppy seeds, only stirring until ingredients are moistened. There will be some lumps.</li>
<li>Bake for 25 minutes or until tester comes out clean.</li>
<li>Remove from muffin pan and cool on wire rack.</li>
<li>If using glaze: Stir together juice, sugar and zest. Drizzle over warm muffins.</li>
</ol>
</div>
</div>
<div id="outline-container-org5279f74" class="outline-4">
<h4 id="org5279f74">Credits</h4>
<div class="outline-text-4" id="text-org5279f74">
<ul class="org-ul">
<li><a href="http://baking.about.com/od/quickandsweetbreads/r/lemonpoppyseed.htm">http://baking.about.com/od/quickandsweetbreads/r/lemonpoppyseed.htm</a></li>
<li>(date created: 5/2/2009 2:42:16 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org894fe90" class="outline-3">
<h3 id="org894fe90">No-knead Crusty Bread</h3>
<div class="outline-text-3" id="text-org894fe90">
</div>
