recipes.org
*** Ingredients
- 3     cups (360 grams) unbleached all-purpose flour
- 1 3/4 teaspoons salt
-   1/2 teaspoon yeast
- 1 1/2 cups water
*** Method
1. In a large mixing bowl, whisk together flour, salt and yeast.
2. Add water and mix until a shaggy mixture forms.
3. Cover bowl with plastic wrap and set aside for 12 - 18 hours.
   Overnight works great.
4. Heat oven to 450 degrees.  When the oven has reached 450 degrees
   place a cast iron pot with a lid in the oven and heat the pot for
   30 minutes.
5. [optional] Meanwhile, pour dough onto a heavily floured surface and
   shape into a ball.  Cover with plastic wrap and let set while the
   pot is heating.
6. Remove hot pot from the oven and drop in the dough.
7. Cover and return to oven for 30 minutes.
8. After 30 minutes remove the lid and bake an additional 15 minutes.
9. Remove bread from oven and place on a cooling rack to cool.
*** Credits
http://www.simplysogood.com/2013/03/artisan-no-knead-bread.html
** Black Bread Castelvetrano
To make the "Castelvetrano black bread" of this recipe, I used only the durum wheat flour Russello, Biancolilla and Tumminia (called also timilia); integral, biological and ground stone. More precisely, 31% of Russello, 31% of Biancolilla and 38% of Tumminia.
The following doses are sufficient for two loaves of half weight
around kilo, after cooking.
*** Ingredients
**** TOTALS
- FLOUR (688 g)
    + Tumminia wholemeal flour 262 g
    + Wholemeal flour of Russello 213 g
    + Biancolilla wholemeal flour 213 g
- Total water 505 g
- Sea salt 11 g
- Barley malt 5 g
- Mother yeast 50% hydrated 13.5 g
- Sesame seeds (to garnish) q.b.
**** PREFERMENT
- Flour mix {Tumminia, Russello, Biancolilla} 100% 88 g 
- Water 90% 79 g 
- Solid mother yeast refreshed 50% hydr. 15% 13.5 g 
(TOTAL 180.5 g)
**** FINAL IMPACT Quantity (g)
- Flour mix {Tumminia, Russello, Biancolilla} 100% 600 g
- Preferment (* see table) 30% 180 g
- Water 71% 426 g
- Sea salt 1.9% 11 g
- Barley malt 0.9% 5 g
(TOTAL 1222 g)
*** Method
1) PREFERMENT PREPARATION
   12-14 hours before proceeding to prepare the mixture, prepare the preferment, mixing the quantity of 50% hydrated solid yeast with water at a temperature of about 86/89.6 degreesF (+30/32  degreesC) and flour. Let it ferment in an airtight container. The final temperature of the mixture of the preferment must be about 86/89.6 degreesF (+30/32 degreesC).
2) MIXING OPERATION
   Pass the 12/14 hours necessary to the preferment. 
   In the water, which must have a temperature of about 86/89.6 degrees F (+30/32 degrees C), dissolve the salt. In a bowl large enough, mix the preferment with barley malt and add 80% of the water in which you have previously dissolved the salt, continuing to mix. A little at a time, add the flour and finally the remaining water. Continue until all the flour is hydrated and the dough it will be homogeneous and soft. Then turn it all over a floured work surface and continue to knead for another 5-6 minutes, until the dough will be quite smooth (I advise those who know it to use the method called "stretch and fold" or "slap and fold".)
   Use a kneading machine, after adding all the ingredients in the special mixing bowl for 5 minutes at the slower speed, until you get the correct homogeneity. Complete kneading at medium speed for another minute and a half. When the dough operation will be correct completed, the dough will be quite soft. The final temperature of the desired mix is about 89.6 degrees F (+32 degrees C).
3) FERMENTATION OF THE MIXTURE
   To ferment for 15-20 minutes at most, performing at least 2 sets of folds at intervals of 5-7 minutes.
4) PORTIONING AND FORMING
   Divide the dough into two parts of about 600g each, forming as desired (round loaf or loaf). Pass the upper surface in the seeds of sesame, and store in the appropriate leavening baskets or in cloths for cooks. Let rise with slightly, floured top up.
5) FINAL RISE
   Let rise for 2 or 3 hours depending on the ambient temperature.
6) BAKING
   Bake at 500 degreesF (+260 degreesC) with steam for 15 minutes, then lower the temperature to 392 degreesF (+200 degreesC) and continue cooking for 20-25 minutes. So conclude with another 10 minutes of draft (door of the ajar oven) to obtain the right degree of humidity.
*** Credits
https://www.lucazanardi.it/wp-content/uploads/2017/07/Pane_nero_Castelvetrano.pdf
** Pane Pugliese
Makes 2 loaves
*** Ingredients
**** Biga
0.5 cup (113g) cool water
1.25 cup (149g) King Arthur Unbleached All-Purpose Flour
1/8 teaspoon instant yeast
**** Dough
all of the biga (above)
1.5 cup (340g) lukewarm water
4 cups (482g) King Arthur Unbleached All-Purpose Flour
2 teaspoons salt
1 teaspoon instant yeast
*** Instructions
1. In a small mixing bowl, combine the water, flour, and yeast to form a soft dough. Don't knead it; just make sure all of the ingredients are well-incorporated. Set this mixture aside in a warm place, covered, for 12 to 16 hours; overnight is fine.
2. Knead all of the dough ingredients together, using a mixer or bread machine, until the dough is cohesive and elastic (though not necessarily smooth), about 10 minutes.
3. Cover the dough and let it rise in a warm place for 2 to 3 hours, gently stirring it down each hour. Letting it rise the full 3 hours will enhance the bread's flavor.
4. Lightly grease a half-sheet pan or other flat pan; or line with parchment. Scoop the very wet dough, in two separate pieces, onto the pan lengthwise, shaping each piece into a rough oval as best you can.
5. Cover the dough with heavily greased plastic wrap, and allow it to rise for about 90 minutes. It'll spread quite a bit; don't worry, it's supposed to. Towards the end of the rising time, preheat the oven to 450 degreesF.
6. Spray the loaves heavily with warm water, and bake them for 25 to 30 minutes, or until they're a deep golden brown.
7. Turn the oven off, prop the door open, transfer the loaves from the pan to the oven rack, and allow them to cool in the turned-off oven.
*** Credits
https://www.kingarthurflour.com/recipes/pane-pugliese-recipe
[2018-01-08 Mon] Made two loaves while I worked from home. T & I were both pleased with it overall: light and crusty. Somewhat reminiscent of [[https://www.kingarthurflour.com/recipes/no-knead-crusty-white-bread-recipe][No-knead crusty white bread]], but with a bit more character.
** Pita Bread
About 2 hours
