recipes.html
<div id="outline-container-orgd87cc00" class="outline-4">
<h4 id="orgd87cc00">Ingredients</h4>
<div class="outline-text-4" id="text-orgd87cc00">
<ul class="org-ul">
<li>3     cups (360 grams) unbleached all-purpose flour</li>
<li>1 3/4 teaspoons salt</li>
<li>1/2 teaspoon yeast</li>
<li>1 1/2 cups water</li>
</ul>
</div>
</div>
<div id="outline-container-org83f3045" class="outline-4">
<h4 id="org83f3045">Method</h4>
<div class="outline-text-4" id="text-org83f3045">
<ol class="org-ol">
<li>In a large mixing bowl, whisk together flour, salt and yeast.</li>
<li>Add water and mix until a shaggy mixture forms.</li>
<li>Cover bowl with plastic wrap and set aside for 12 - 18 hours.
Overnight works great.</li>
<li>Heat oven to 450 degrees.  When the oven has reached 450 degrees
place a cast iron pot with a lid in the oven and heat the pot for
30 minutes.</li>
<li>[optional] Meanwhile, pour dough onto a heavily floured surface and
shape into a ball.  Cover with plastic wrap and let set while the
pot is heating.</li>
<li>Remove hot pot from the oven and drop in the dough.</li>
<li>Cover and return to oven for 30 minutes.</li>
<li>After 30 minutes remove the lid and bake an additional 15 minutes.</li>
<li>Remove bread from oven and place on a cooling rack to cool.</li>
</ol>
</div>
</div>
<div id="outline-container-org88c64e7" class="outline-4">
<h4 id="org88c64e7">Credits</h4>
<div class="outline-text-4" id="text-org88c64e7">
<p>
<a href="http://www.simplysogood.com/2013/03/artisan-no-knead-bread.html">http://www.simplysogood.com/2013/03/artisan-no-knead-bread.html</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org868626a" class="outline-3">
<h3 id="org868626a">Black Bread Castelvetrano</h3>
<div class="outline-text-3" id="text-org868626a">
<p>
To make the "Castelvetrano black bread" of this recipe, I used only the durum wheat flour Russello, Biancolilla and Tumminia (called also timilia); integral, biological and ground stone. More precisely, 31% of Russello, 31% of Biancolilla and 38% of Tumminia.
The following doses are sufficient for two loaves of half weight
around kilo, after cooking.
</p>
</div>
<div id="outline-container-orgd237df5" class="outline-4">
<h4 id="orgd237df5">Ingredients</h4>
<div class="outline-text-4" id="text-orgd237df5">
</div>
<ul class="org-ul">
<li><a id="orgd4665f3"></a>TOTALS<br />
<div class="outline-text-5" id="text-orgd4665f3">
<ul class="org-ul">
<li>FLOUR (688 g)
<ul class="org-ul">
<li>Tumminia wholemeal flour 262 g</li>
<li>Wholemeal flour of Russello 213 g</li>
<li>Biancolilla wholemeal flour 213 g</li>
</ul></li>
<li>Total water 505 g</li>
<li>Sea salt 11 g</li>
<li>Barley malt 5 g</li>
<li>Mother yeast 50% hydrated 13.5 g</li>
<li>Sesame seeds (to garnish) q.b.</li>
</ul>
</div>
</li>
<li><a id="orgbd46a95"></a>PREFERMENT<br />
<div class="outline-text-5" id="text-orgbd46a95">
<ul class="org-ul">
<li>Flour mix {Tumminia, Russello, Biancolilla} 100% 88 g</li>
<li>Water 90% 79 g</li>
<li>Solid mother yeast refreshed 50% hydr. 15% 13.5 g</li>
</ul>
<p>
(TOTAL 180.5 g)
</p>
</div>
</li>
<li><a id="orgb7d7f48"></a>FINAL IMPACT Quantity (g)<br />
<div class="outline-text-5" id="text-orgb7d7f48">
<ul class="org-ul">
<li>Flour mix {Tumminia, Russello, Biancolilla} 100% 600 g</li>
<li>Preferment (* see table) 30% 180 g</li>
<li>Water 71% 426 g</li>
<li>Sea salt 1.9% 11 g</li>
<li>Barley malt 0.9% 5 g</li>
</ul>
<p>
(TOTAL 1222 g)
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org79dcaf6" class="outline-4">
<h4 id="org79dcaf6">Method</h4>
<div class="outline-text-4" id="text-org79dcaf6">
<ol class="org-ol">
<li>PREFERMENT PREPARATION
12-14 hours before proceeding to prepare the mixture, prepare the preferment, mixing the quantity of 50% hydrated solid yeast with water at a temperature of about 86/89.6 degreesF (+30/32  degreesC) and flour. Let it ferment in an airtight container. The final temperature of the mixture of the preferment must be about 86/89.6 degreesF (+30/32 degreesC).</li>
<li>MIXING OPERATION
Pass the 12/14 hours necessary to the preferment. 
In the water, which must have a temperature of about 86/89.6 degrees F (+30/32 degrees C), dissolve the salt. In a bowl large enough, mix the preferment with barley malt and add 80% of the water in which you have previously dissolved the salt, continuing to mix. A little at a time, add the flour and finally the remaining water. Continue until all the flour is hydrated and the dough it will be homogeneous and soft. Then turn it all over a floured work surface and continue to knead for another 5-6 minutes, until the dough will be quite smooth (I advise those who know it to use the method called "stretch and fold" or "slap and fold".)
Use a kneading machine, after adding all the ingredients in the special mixing bowl for 5 minutes at the slower speed, until you get the correct homogeneity. Complete kneading at medium speed for another minute and a half. When the dough operation will be correct completed, the dough will be quite soft. The final temperature of the desired mix is about 89.6 degrees F (+32 degrees C).</li>
<li>FERMENTATION OF THE MIXTURE
To ferment for 15-20 minutes at most, performing at least 2 sets of folds at intervals of 5-7 minutes.</li>
<li>PORTIONING AND FORMING
Divide the dough into two parts of about 600g each, forming as desired (round loaf or loaf). Pass the upper surface in the seeds of sesame, and store in the appropriate leavening baskets or in cloths for cooks. Let rise with slightly, floured top up.</li>
<li>FINAL RISE
Let rise for 2 or 3 hours depending on the ambient temperature.</li>
<li>BAKING
Bake at 500 degreesF (+260 degreesC) with steam for 15 minutes, then lower the temperature to 392 degreesF (+200 degreesC) and continue cooking for 20-25 minutes. So conclude with another 10 minutes of draft (door of the ajar oven) to obtain the right degree of humidity.</li>
</ol>
</div>
</div>
<div id="outline-container-orga5cf28d" class="outline-4">
<h4 id="orga5cf28d">Credits</h4>
<div class="outline-text-4" id="text-orga5cf28d">
<p>
<a href="https://www.lucazanardi.it/wp-content/uploads/2017/07/Pane_nero_Castelvetrano.pdf">https://www.lucazanardi.it/wp-content/uploads/2017/07/Pane_nero_Castelvetrano.pdf</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org97b2d87" class="outline-3">
<h3 id="org97b2d87">Pane Pugliese</h3>
<div class="outline-text-3" id="text-org97b2d87">
<p>
Makes 2 loaves
</p>
</div>
<div id="outline-container-orgc1421df" class="outline-4">
<h4 id="orgc1421df">Ingredients</h4>
<div class="outline-text-4" id="text-orgc1421df">
</div>
<ul class="org-ul">
<li><a id="orgc72dd89"></a>Biga<br />
<div class="outline-text-5" id="text-orgc72dd89">
<p>
0.5 cup (113g) cool water
1.25 cup (149g) King Arthur Unbleached All-Purpose Flour
1/8 teaspoon instant yeast
</p>
</div>
</li>
<li><a id="orgbd4f15d"></a>Dough<br />
<div class="outline-text-5" id="text-orgbd4f15d">
<p>
all of the biga (above)
1.5 cup (340g) lukewarm water
4 cups (482g) King Arthur Unbleached All-Purpose Flour
2 teaspoons salt
1 teaspoon instant yeast
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org3ea9310" class="outline-4">
<h4 id="org3ea9310">Instructions</h4>
<div class="outline-text-4" id="text-org3ea9310">
<ol class="org-ol">
<li>In a small mixing bowl, combine the water, flour, and yeast to form a soft dough. Don't knead it; just make sure all of the ingredients are well-incorporated. Set this mixture aside in a warm place, covered, for 12 to 16 hours; overnight is fine.</li>
<li>Knead all of the dough ingredients together, using a mixer or bread machine, until the dough is cohesive and elastic (though not necessarily smooth), about 10 minutes.</li>
<li>Cover the dough and let it rise in a warm place for 2 to 3 hours, gently stirring it down each hour. Letting it rise the full 3 hours will enhance the bread's flavor.</li>
<li>Lightly grease a half-sheet pan or other flat pan; or line with parchment. Scoop the very wet dough, in two separate pieces, onto the pan lengthwise, shaping each piece into a rough oval as best you can.</li>
<li>Cover the dough with heavily greased plastic wrap, and allow it to rise for about 90 minutes. It'll spread quite a bit; don't worry, it's supposed to. Towards the end of the rising time, preheat the oven to 450 degreesF.</li>
<li>Spray the loaves heavily with warm water, and bake them for 25 to 30 minutes, or until they're a deep golden brown.</li>
<li>Turn the oven off, prop the door open, transfer the loaves from the pan to the oven rack, and allow them to cool in the turned-off oven.</li>
</ol>
</div>
</div>
<div id="outline-container-org7e5c553" class="outline-4">
<h4 id="org7e5c553">Credits</h4>
<div class="outline-text-4" id="text-org7e5c553">
<p>
<a href="https://www.kingarthurflour.com/recipes/pane-pugliese-recipe">https://www.kingarthurflour.com/recipes/pane-pugliese-recipe</a>
<span class="timestamp-wrapper"><span class="timestamp">[2018-01-08 Mon] </span></span> Made two loaves while I worked from home. T &amp; I were both pleased with it overall: light and crusty. Somewhat reminiscent of <a href="https://www.kingarthurflour.com/recipes/no-knead-crusty-white-bread-recipe">No-knead crusty white bread</a>, but with a bit more character.
</p>
</div>
</div>
</div>
