recipes.org
*** Ingredients
- 2  teaspoons active dry yeast
- 1/2  teaspoon sugar
- 35  grams whole-wheat flour (1/4 cup), preferably freshly milled
- 310  grams unbleached all-purposed flour (2 1/2 cups)
- 1  teaspoon kosher salt
- 2  tablespoons olive oil
*** Method
1. Make sponge: Put 1 cup lukewarm water in a large mixing bowl. Add yeast and sugar. Stir to dissolve. Add the whole-wheat flour and 1/4 cup all-purpose flour and whisk together. Put bowl in a warm (not hot) place, uncovered, until mixture is frothy and bubbling, about 15 minutes.
2. Add salt, olive oil and nearly all remaining all-purpose flour (reserve 1/2 cup). With a wooden spoon or a pair of chopsticks, stir until mixture forms a shaggy mass. Dust with a little reserved flour, then knead in bowl for 1 minute, incorporating any stray bits of dry dough.
3. Turn dough onto work surface. Knead lightly for 2 minutes, until smooth. Cover and let rest 10 minutes, then knead again for 2 minutes. Try not to add too much reserved flour; the dough should be soft and a bit moist. (At this point, dough may refrigerated in a large zippered plastic bag for several hours or overnight. Bring dough back to room temperature, knead into a ball and proceed with recipe.)
4. Clean the mixing bowl and put dough back in it. Cover bowl tightly with plastic wrap, then cover with a towel. Put bowl in a warm (not hot) place. Leave until dough has doubled in size, about 1 hour.
5. Heat oven to 475 degrees. On bottom shelf of oven, place a heavy-duty baking sheet, large cast-iron pan or ceramic baking tile. Punch down dough and divide into 8 pieces of equal size. Form each piece into a little ball. Place dough balls on work surface, cover with a damp towel and leave for 10 minutes.
6. Remove 1 ball (keeping others covered) and press into a flat diskc with rolling pin. Roll to a 6-inch circle, then to an 8-inch diameter, about 1/8 inch thick, dusting with flour if necessary. (The dough will shrink a bit while baking.)
7. Carefully lift the dough circle and place quickly on hot baking sheet. After 2 minutes the dough should be nicely puffed. Turn over with tongs or spatula and bake 1 minute more. The pita should be pale, with only a few brown speckles. Transfer warm pita to a napkin-lined basket and cover so bread stays soft. Repeat with the rest of the dough balls.
*** Yield
- 8 six-inch diameter breads
*** Credits
https://cooking.nytimes.com/recipes/1016071-homemade-pita-bread
[2018-02-03 Sat] Made for TC and Freedman; good. TC said, like most pitas, they were bland.
** New York Variation Pizza Dough
*** Dough
**** Ingredients
- 1 cup warm water
- 1 pkg dry yeast
- 3 1/4 cups (390 grams) unbleached flour
- 1/2 tsp salt
**** Method
1. Soften yeast in water.
2. Add salt then start adding flour until a wet dough forms. Knead briefly, just to form a consistent dough. Place ball of dough in a large plastic Ziploc bag (or large bowl) that has been coated with olive oil. Place in refrigerator for 4-5 hours.
3. About the time you turn the oven on to pre-heat, pull dough out of refrigerator. Punch down and then let rest for 10 minutes. Divide ball in half and coat well with flour. Start patting each ball of dough out into a circle, the thinner the better, letting rest if it won't spread out.
4. Place an oven rack at the very lowest position; remove other racks and set aside. Place baking tiles or pizza stone on the rack and preheat the oven to 500 F for an hour or so. Make sure stone is in the oven from the beginning otherwise the high heat might crack it.
***  New York Style Tomato Sauce
**** Ingredients
- 1 can (28 ounces) Italian plum tomatoes - buy the best you can find
- 2 tbl. tomato paste
- 1 or 2 garlic cloves, minced or pressed
- 1 tsp. dried oregano
- Salt and freshly ground black pepper
**** Method
1. Crush the tomatoes with your hands or a fork and place in a heavy saucepan over medium heat. Stir in the tomato paste, garlic, oregano and salt and pepper to taste. Bring the mixture just to a boil, then reduce the heat to low and simmer the sauce, stirring occasionally, until thick and flavorful, 30 minutes to 1 hour. Remove from the heat. (This may be stored in the refrigerator for up to 1 week or frozen up to 4 months)
2. To bake: Turn the smoke alarm off. Cover pizza peel with coarse corn meal. Place one flattened piece of the dough onto the peel, spread with olive oil, cover with a thick layer of tomato sauce then add toppings. Sprinkle on a thick layer of parmesan cheese then drizzle with olive oil. Slide pizza onto the hot stone and bake 10 to 15 minutes until the top of the pie is beginning to brown. Remove pizza from oven and place on a cutting board. Let sit for a few minutes then slice and eat while hot.
*** Credits
- (date created: 1/16/2008 8:45:03 AM)
** Portuguese Rolls - Papo Secos
*** Ingredients
- 1.5 cups warm water
- 1/2 tablespoon sugar + 1/8 tablespoon
- 1/2 tablespoon salt + 1/8 tablespoon
- 1 package of active dry yeast
- 5 and 1/4 cups (630 grams) of all purpose flour (plus more for kneading)
*** Method
1. Mix water, sugar, salt and yeast in a bowl.  Add the flour a little at a time and mix with your hand or with a dough hook.
2. Knead for at least 10 minutes until the dough is smooth and forms a ball of dough. Pour the dough onto a floured surface and knead into a ball.
3. Place in a bowl, cover and store in a warm place until the dough doubles in size. Approximately one hour.
4. Shape the dough into balls, make a crease with your palm to form a crease and let rise for at least one hour or until doubled.
5. Cook at 375 degrees for 40 -45 minutes until golden brown.
6. The rolls will be crusty after cooking. Place in a plastic bag when cooled and they will become softer.
*** Yield
- 6 rolls
*** Credits
Meh. They were not crispy at all. Could definitely benefit from longer rise times. Would not make again.
http://portuguesediner.com/tiamaria/papo-seco-portuguese-rolls/
[2017-07-29 Sat]
** Pumpkin Bread
Recipe Courtesy of Cathy Lowe
Prep Time: 20 min
Cook Time: 60-70 min
Serves: 2 loaves
*** Ingredients
