recipes.html
<div id="outline-container-orgca291bb" class="outline-3">
<h3 id="orgca291bb">Pita Bread</h3>
<div class="outline-text-3" id="text-orgca291bb">
<p>
About 2 hours
</p>
</div>
<div id="outline-container-orge20a645" class="outline-4">
<h4 id="orge20a645">Ingredients</h4>
<div class="outline-text-4" id="text-orge20a645">
<ul class="org-ul">
<li>2  teaspoons active dry yeast</li>
<li>1/2  teaspoon sugar</li>
<li>35  grams whole-wheat flour (1/4 cup), preferably freshly milled</li>
<li>310  grams unbleached all-purposed flour (2 1/2 cups)</li>
<li>1  teaspoon kosher salt</li>
<li>2  tablespoons olive oil</li>
</ul>
</div>
</div>
<div id="outline-container-orga47b146" class="outline-4">
<h4 id="orga47b146">Method</h4>
<div class="outline-text-4" id="text-orga47b146">
<ol class="org-ol">
<li>Make sponge: Put 1 cup lukewarm water in a large mixing bowl. Add yeast and sugar. Stir to dissolve. Add the whole-wheat flour and 1/4 cup all-purpose flour and whisk together. Put bowl in a warm (not hot) place, uncovered, until mixture is frothy and bubbling, about 15 minutes.</li>
<li>Add salt, olive oil and nearly all remaining all-purpose flour (reserve 1/2 cup). With a wooden spoon or a pair of chopsticks, stir until mixture forms a shaggy mass. Dust with a little reserved flour, then knead in bowl for 1 minute, incorporating any stray bits of dry dough.</li>
<li>Turn dough onto work surface. Knead lightly for 2 minutes, until smooth. Cover and let rest 10 minutes, then knead again for 2 minutes. Try not to add too much reserved flour; the dough should be soft and a bit moist. (At this point, dough may refrigerated in a large zippered plastic bag for several hours or overnight. Bring dough back to room temperature, knead into a ball and proceed with recipe.)</li>
<li>Clean the mixing bowl and put dough back in it. Cover bowl tightly with plastic wrap, then cover with a towel. Put bowl in a warm (not hot) place. Leave until dough has doubled in size, about 1 hour.</li>
<li>Heat oven to 475 degrees. On bottom shelf of oven, place a heavy-duty baking sheet, large cast-iron pan or ceramic baking tile. Punch down dough and divide into 8 pieces of equal size. Form each piece into a little ball. Place dough balls on work surface, cover with a damp towel and leave for 10 minutes.</li>
<li>Remove 1 ball (keeping others covered) and press into a flat diskc with rolling pin. Roll to a 6-inch circle, then to an 8-inch diameter, about 1/8 inch thick, dusting with flour if necessary. (The dough will shrink a bit while baking.)</li>
<li>Carefully lift the dough circle and place quickly on hot baking sheet. After 2 minutes the dough should be nicely puffed. Turn over with tongs or spatula and bake 1 minute more. The pita should be pale, with only a few brown speckles. Transfer warm pita to a napkin-lined basket and cover so bread stays soft. Repeat with the rest of the dough balls.</li>
</ol>
</div>
</div>
<div id="outline-container-org6a0c8cf" class="outline-4">
<h4 id="org6a0c8cf">Yield</h4>
<div class="outline-text-4" id="text-org6a0c8cf">
<ul class="org-ul">
<li>8 six-inch diameter breads</li>
</ul>
</div>
</div>
<div id="outline-container-org733e30f" class="outline-4">
<h4 id="org733e30f">Credits</h4>
<div class="outline-text-4" id="text-org733e30f">
<p>
<a href="https://cooking.nytimes.com/recipes/1016071-homemade-pita-bread">https://cooking.nytimes.com/recipes/1016071-homemade-pita-bread</a>
<span class="timestamp-wrapper"><span class="timestamp">[2018-02-03 Sat] </span></span> Made for TC and Freedman; good. TC said, like most pitas, they were bland.
</p>
</div>
</div>
</div>
<div id="outline-container-org76ed1ed" class="outline-3">
<h3 id="org76ed1ed">New York Variation Pizza Dough</h3>
<div class="outline-text-3" id="text-org76ed1ed">
</div>
<div id="outline-container-orgdf8f741" class="outline-4">
<h4 id="orgdf8f741">Dough</h4>
<div class="outline-text-4" id="text-orgdf8f741">
</div>
<ul class="org-ul">
<li><a id="orgdee594c"></a>Ingredients<br />
<div class="outline-text-5" id="text-orgdee594c">
<ul class="org-ul">
<li>1 cup warm water</li>
<li>1 pkg dry yeast</li>
<li>3 1/4 cups (390 grams) unbleached flour</li>
<li>1/2 tsp salt</li>
</ul>
</div>
</li>
<li><a id="orgea9fd74"></a>Method<br />
<div class="outline-text-5" id="text-orgea9fd74">
<ol class="org-ol">
<li>Soften yeast in water.</li>
<li>Add salt then start adding flour until a wet dough forms. Knead briefly, just to form a consistent dough. Place ball of dough in a large plastic Ziploc bag (or large bowl) that has been coated with olive oil. Place in refrigerator for 4-5 hours.</li>
<li>About the time you turn the oven on to pre-heat, pull dough out of refrigerator. Punch down and then let rest for 10 minutes. Divide ball in half and coat well with flour. Start patting each ball of dough out into a circle, the thinner the better, letting rest if it won't spread out.</li>
<li>Place an oven rack at the very lowest position; remove other racks and set aside. Place baking tiles or pizza stone on the rack and preheat the oven to 500 F for an hour or so. Make sure stone is in the oven from the beginning otherwise the high heat might crack it.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orga24d54e" class="outline-4">
<h4 id="orga24d54e">New York Style Tomato Sauce</h4>
<div class="outline-text-4" id="text-orga24d54e">
</div>
<ul class="org-ul">
<li><a id="org9fb04f0"></a>Ingredients<br />
<div class="outline-text-5" id="text-org9fb04f0">
<ul class="org-ul">
<li>1 can (28 ounces) Italian plum tomatoes - buy the best you can find</li>
<li>2 tbl. tomato paste</li>
<li>1 or 2 garlic cloves, minced or pressed</li>
<li>1 tsp. dried oregano</li>
<li>Salt and freshly ground black pepper</li>
</ul>
</div>
</li>
<li><a id="org8c4cca1"></a>Method<br />
<div class="outline-text-5" id="text-org8c4cca1">
<ol class="org-ol">
<li>Crush the tomatoes with your hands or a fork and place in a heavy saucepan over medium heat. Stir in the tomato paste, garlic, oregano and salt and pepper to taste. Bring the mixture just to a boil, then reduce the heat to low and simmer the sauce, stirring occasionally, until thick and flavorful, 30 minutes to 1 hour. Remove from the heat. (This may be stored in the refrigerator for up to 1 week or frozen up to 4 months)</li>
<li>To bake: Turn the smoke alarm off. Cover pizza peel with coarse corn meal. Place one flattened piece of the dough onto the peel, spread with olive oil, cover with a thick layer of tomato sauce then add toppings. Sprinkle on a thick layer of parmesan cheese then drizzle with olive oil. Slide pizza onto the hot stone and bake 10 to 15 minutes until the top of the pie is beginning to brown. Remove pizza from oven and place on a cutting board. Let sit for a few minutes then slice and eat while hot.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org57ffe69" class="outline-4">
<h4 id="org57ffe69">Credits</h4>
<div class="outline-text-4" id="text-org57ffe69">
<ul class="org-ul">
<li>(date created: 1/16/2008 8:45:03 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbd00c19" class="outline-3">
<h3 id="orgbd00c19">Portuguese Rolls - Papo Secos</h3>
<div class="outline-text-3" id="text-orgbd00c19">
</div>
<div id="outline-container-org766a8fa" class="outline-4">
<h4 id="org766a8fa">Ingredients</h4>
<div class="outline-text-4" id="text-org766a8fa">
<ul class="org-ul">
<li>1.5 cups warm water</li>
<li>1/2 tablespoon sugar + 1/8 tablespoon</li>
<li>1/2 tablespoon salt + 1/8 tablespoon</li>
<li>1 package of active dry yeast</li>
<li>5 and 1/4 cups (630 grams) of all purpose flour (plus more for kneading)</li>
</ul>
</div>
</div>
<div id="outline-container-org92a4c49" class="outline-4">
<h4 id="org92a4c49">Method</h4>
<div class="outline-text-4" id="text-org92a4c49">
<ol class="org-ol">
<li>Mix water, sugar, salt and yeast in a bowl.  Add the flour a little at a time and mix with your hand or with a dough hook.</li>
<li>Knead for at least 10 minutes until the dough is smooth and forms a ball of dough. Pour the dough onto a floured surface and knead into a ball.</li>
<li>Place in a bowl, cover and store in a warm place until the dough doubles in size. Approximately one hour.</li>
<li>Shape the dough into balls, make a crease with your palm to form a crease and let rise for at least one hour or until doubled.</li>
<li>Cook at 375 degrees for 40 -45 minutes until golden brown.</li>
<li>The rolls will be crusty after cooking. Place in a plastic bag when cooled and they will become softer.</li>
</ol>
</div>
</div>
<div id="outline-container-org7f1abd9" class="outline-4">
<h4 id="org7f1abd9">Yield</h4>
<div class="outline-text-4" id="text-org7f1abd9">
<ul class="org-ul">
<li>6 rolls</li>
</ul>
</div>
</div>
<div id="outline-container-org30f7a06" class="outline-4">
<h4 id="org30f7a06">Credits</h4>
<div class="outline-text-4" id="text-org30f7a06">
<p>
Meh. They were not crispy at all. Could definitely benefit from longer rise times. Would not make again.
<a href="http://portuguesediner.com/tiamaria/papo-seco-portuguese-rolls/">http://portuguesediner.com/tiamaria/papo-seco-portuguese-rolls/</a>
<span class="timestamp-wrapper"><span class="timestamp">[2017-07-29 Sat]</span></span>
</p>
</div>
</div>
</div>
<div id="outline-container-org8cb38e8" class="outline-3">
<h3 id="org8cb38e8">Pumpkin Bread</h3>
<div class="outline-text-3" id="text-org8cb38e8">
<p>
Recipe Courtesy of Cathy Lowe
Prep Time: 20 min
Cook Time: 60-70 min
Serves: 2 loaves
</p>
</div>
