recipes.org
**** 2 Loaves
- 3 cups (594 grams) sugar 
- 1 cup vegetable oil
- 4 eggs, lightly bean
- 16 ounces canned unsweetened pumpkin
- 3 1/2 cups (420 grams) flour
- 2 teaspoons salt
- 2 teaspoons baking soda
- 1 teaspoon baking powder
- 1 teaspoon nutmeg
- 1 teaspoon allspice
- 1 teaspoon cinnamon
- 1/2 teaspoon cloves
- 2/3 cup water
**** 1 Loaf
- 1.5 cups (297 grams) sugar 
- 1/2 cup vegetable oil
- 2 eggs, lightly bean
- 8 ounces canned unsweetened pumpkin
- 1 3/4 cups (240 grams) flour
- 1 teaspoon salt
- 1 teaspoon baking soda
- 1/2 teaspoon baking powder
- 1/2 teaspoon nutmeg
- 1/2 teaspoon allspice
- 1/2 teaspoon cinnamon
- 1/4 teaspoon cloves
- 1/3 cup water
*** Method
1) Preheat oven to 350 degrees. Butter and flour two 9x5 loaf pans. Stir together sugar and oil. Stir in eggs and pumpkin.
2) Combine dry ingredients in separate bowl. Blend dry ingredients and water into wet mixture, alternating.
3) Divide batter between two loaf pans.
4) Bake for 60 to 70 minutes or until cake tester comes out clean. Let stand 10 minutes. Remove from pans and cool.
*** Credits
- [[http://www.foodnetwork.com/food/cda/recipe_print/0,1946,FOOD_9936_4067_RECIPE-PRINT-FULL-PAGE-FORMATTER,00.html][Recipe]]
- [2018-02-21 Wed] made for W@DJ: yum
- [2016-11-27 Sun] made for Sprint Reviews + TLC; good (although I used duck eggs and got some shell in them!)
- [2016-06-26 Sun] made for TC, Doris and Joanne; still a hit!
- [2009-12-13 Sun] Again on (for HLTA and DJ work colleagues). Another hit.
- [2006-12-11 Mon] A hit! Made for Kate, Jan, Ian, Dan, TLC
- (date created: 5/2/2009 2:45:11 PM)
** Quick Homemade Gluten
Makes 1-1/4 to 1-1/2 pounds or 2 to 2-1/2 cup
*** Gluten
**** Ingredients
- 2 cups gluten flour
- 1 teaspoon garlic powder
- 1 teaspoon ground ginger
- 1-1/4 cups water or vegetable stock
- 3 Tablespoons lite tamari, Braggs liquid amino acids, or soy sauce
- 1-3 teaspoons toasted sesame oil (optional)
**** Method
1. Add garlic powder and ginger to flour and stir. Mix liquids together and add to flour mixture all at once. Mix vigorously with a fork. When it forms a stiff dough knead it 10 to 15 times.
2. Let the dough rest 2 to 5 minutes, then knead it a few more times. Let it rest another 15 minutes before proceeding.
3. Cut gluten into 6 to 8 pieces and stretch into thin cutlets. Simmer in broth for 30 to 60 minutes.
*** Broth:
**** Ingredients
- 4 cups water
- 1/4 cup tamari or soy sauce
- 3-inch piece of kombu (a type of seaweed)
- 3-4 slices ginger (optional)
**** Method
1) Combine all ingredients in a large saucepan. Bring broth to a boil. Add cutlets one at a time. Reduce heat to barely simmer when saucepan is covered. Seitan may be used, refrigerated, or frozen at this point.
*** Credits
- Total Calories per 4 oz. Serving: 77
- Fat: 0 grams
- (date created: 9/26/2010 7:39:39 AM)
** Rustic Bread
Makes 2 large loaves
*** Ingredients
**** Grains:
- 1/2 cup wheat berries or cracked wheat (optional)
**** Preferment:
- >12.5 oz. water (1 1/2 cups)
- 1/8 teaspoon instant yeast
- 1 lb. bread flour (3 1/2 cups; 420 grams)
- 1/2 tablespoon (5 grams) salt
**** Final dough:
- 12.5 oz. water (1 1/2 cups)
- 1/2 teaspoon instant yeast
- 8 oz. bread flour (2  cups; 240 grams)
- 8 oz. whole wheat or rye flour or a mixture of them (around 2 cups; 240 grams)
- 1/4 cup or so flax meal (optional) 
- 1/2 tablespoon (5 grams) salt
- all of the preferment 
*** Method
1. If using grains, soak in water, enough to cover, over night.
2. Put the yeast in the water and stir. Mix the flour and salt together in a bowl and pour in the yeasted water. Mix until the flour is hydrated, adding more water if necessary. Cover the bowl with plastic wrap and leave the pre-ferment out at room temperature overnight (up to 16 hours... if you need more time before baking put it in the refrigerator).
3. To make the final dough, combine all of the ingredients except the pre-ferment in a mixing bowl. Chop the pre-ferment up into small pieces and mix or knead it into the final dough until they are thoroughly combined. This is quite difficult to do by hand: Hamelman assumes the baker has a mixer and can mix it for 5 minutes by machine. I mix and knead my dough by hand for about 10 minutes.
4. Place the dough back in a greased bowl and ferment for 2 1/2 hours, punching down or folding the dough twice during that time.
5. (Folding the dough consists of taking the dough out of the bowl, spreading it out a little on a clean surface, folding it in thirds like a letter, rotating it 90 degrees and folding it up again, and then returning the dough to the bowl and covering it again. Like punching down, folding degases the dough some, but it also encourages gluten development. More on this topic in a future post.)
6. At the end of the fermentation, divide the dough into two pieces and preshape each into a ball. Cover with a clean towel and let each rest for 5 to 10 minutes before shaping into the final shape. Once shaped, cover the loaves with a clean towel and set aside for a final rise, approximately 1 1/4 to 1 1/2 hours.
7. Halfway though the final rise, begin preheating the oven to 450 degrees. If you are using a baking stone, preheat it as well.
8. Right before placing it in the oven, score the loaves. Place them in the oven and use whatever technique you use to create stream in the oven (squirt bottle, skillet full of hot water, etc) to encourage proper crust development.
9. After 20 minutes of baking, rotate the loaves 180 degrees so that they'll bake evenly. Bake until an instant read thermometer reads around 200 degrees, which took approximately 35 minutes for my batard ("football") shaped loaves.
*** Credits
- (I've tried preheating to 500 degrees, then lowering to 450 degrees and baking for 20 minutes on speed bake. Crispy crust, moist and tender, but a bit gummy inside.)
- From http://www.thefreshloaf.com/recipes/rusticbread February 2011
- (date created: 3/4/2011 7:26:21 AM)
** Texas-Style Cornbread
By Diana Rattray, About.com
