recipes.html
<div id="outline-container-org5c5ac29" class="outline-4">
<h4 id="org5c5ac29">Ingredients</h4>
<div class="outline-text-4" id="text-org5c5ac29">
</div>
<ul class="org-ul">
<li><a id="orgb765410"></a>2 Loaves<br />
<div class="outline-text-5" id="text-orgb765410">
<ul class="org-ul">
<li>3 cups (594 grams) sugar</li>
<li>1 cup vegetable oil</li>
<li>4 eggs, lightly bean</li>
<li>16 ounces canned unsweetened pumpkin</li>
<li>3 1/2 cups (420 grams) flour</li>
<li>2 teaspoons salt</li>
<li>2 teaspoons baking soda</li>
<li>1 teaspoon baking powder</li>
<li>1 teaspoon nutmeg</li>
<li>1 teaspoon allspice</li>
<li>1 teaspoon cinnamon</li>
<li>1/2 teaspoon cloves</li>
<li>2/3 cup water</li>
</ul>
</div>
</li>
<li><a id="org844d101"></a>1 Loaf<br />
<div class="outline-text-5" id="text-org844d101">
<ul class="org-ul">
<li>1.5 cups (297 grams) sugar</li>
<li>1/2 cup vegetable oil</li>
<li>2 eggs, lightly bean</li>
<li>8 ounces canned unsweetened pumpkin</li>
<li>1 3/4 cups (240 grams) flour</li>
<li>1 teaspoon salt</li>
<li>1 teaspoon baking soda</li>
<li>1/2 teaspoon baking powder</li>
<li>1/2 teaspoon nutmeg</li>
<li>1/2 teaspoon allspice</li>
<li>1/2 teaspoon cinnamon</li>
<li>1/4 teaspoon cloves</li>
<li>1/3 cup water</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org9101105" class="outline-4">
<h4 id="org9101105">Method</h4>
<div class="outline-text-4" id="text-org9101105">
<ol class="org-ol">
<li>Preheat oven to 350 degrees. Butter and flour two 9x5 loaf pans. Stir together sugar and oil. Stir in eggs and pumpkin.</li>
<li>Combine dry ingredients in separate bowl. Blend dry ingredients and water into wet mixture, alternating.</li>
<li>Divide batter between two loaf pans.</li>
<li>Bake for 60 to 70 minutes or until cake tester comes out clean. Let stand 10 minutes. Remove from pans and cool.</li>
</ol>
</div>
</div>
<div id="outline-container-org888fdc3" class="outline-4">
<h4 id="org888fdc3">Credits</h4>
<div class="outline-text-4" id="text-org888fdc3">
<ul class="org-ul">
<li><a href="http://www.foodnetwork.com/food/cda/recipe_print/0,1946,FOOD_9936_4067_RECIPE-PRINT-FULL-PAGE-FORMATTER,00.html">Recipe</a></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2018-02-21 Wed] </span></span> made for W@DJ: yum</li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2016-11-27 Sun] </span></span> made for Sprint Reviews + TLC; good (although I used duck eggs and got some shell in them!)</li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2016-06-26 Sun] </span></span> made for TC, Doris and Joanne; still a hit!</li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2009-12-13 Sun] </span></span> Again on (for HLTA and DJ work colleagues). Another hit.</li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2006-12-11 Mon] </span></span> A hit! Made for Kate, Jan, Ian, Dan, TLC</li>
<li>(date created: 5/2/2009 2:45:11 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0388d6c" class="outline-3">
<h3 id="org0388d6c">Quick Homemade Gluten</h3>
<div class="outline-text-3" id="text-org0388d6c">
<p>
Makes 1-1/4 to 1-1/2 pounds or 2 to 2-1/2 cup
</p>
</div>
<div id="outline-container-org652b42d" class="outline-4">
<h4 id="org652b42d">Gluten</h4>
<div class="outline-text-4" id="text-org652b42d">
</div>
<ul class="org-ul">
<li><a id="org3e52466"></a>Ingredients<br />
<div class="outline-text-5" id="text-org3e52466">
<ul class="org-ul">
<li>2 cups gluten flour</li>
<li>1 teaspoon garlic powder</li>
<li>1 teaspoon ground ginger</li>
<li>1-1/4 cups water or vegetable stock</li>
<li>3 Tablespoons lite tamari, Braggs liquid amino acids, or soy sauce</li>
<li>1-3 teaspoons toasted sesame oil (optional)</li>
</ul>
</div>
</li>
<li><a id="org607ba3f"></a>Method<br />
<div class="outline-text-5" id="text-org607ba3f">
<ol class="org-ol">
<li>Add garlic powder and ginger to flour and stir. Mix liquids together and add to flour mixture all at once. Mix vigorously with a fork. When it forms a stiff dough knead it 10 to 15 times.</li>
<li>Let the dough rest 2 to 5 minutes, then knead it a few more times. Let it rest another 15 minutes before proceeding.</li>
<li>Cut gluten into 6 to 8 pieces and stretch into thin cutlets. Simmer in broth for 30 to 60 minutes.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orge818726" class="outline-4">
<h4 id="orge818726">Broth:</h4>
<div class="outline-text-4" id="text-orge818726">
</div>
<ul class="org-ul">
<li><a id="orgf18a087"></a>Ingredients<br />
<div class="outline-text-5" id="text-orgf18a087">
<ul class="org-ul">
<li>4 cups water</li>
<li>1/4 cup tamari or soy sauce</li>
<li>3-inch piece of kombu (a type of seaweed)</li>
<li>3-4 slices ginger (optional)</li>
</ul>
</div>
</li>
<li><a id="orgb84e3f8"></a>Method<br />
<div class="outline-text-5" id="text-orgb84e3f8">
<ol class="org-ol">
<li>Combine all ingredients in a large saucepan. Bring broth to a boil. Add cutlets one at a time. Reduce heat to barely simmer when saucepan is covered. Seitan may be used, refrigerated, or frozen at this point.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org294989f" class="outline-4">
<h4 id="org294989f">Credits</h4>
<div class="outline-text-4" id="text-org294989f">
<ul class="org-ul">
<li>Total Calories per 4 oz. Serving: 77</li>
<li>Fat: 0 grams</li>
<li>(date created: 9/26/2010 7:39:39 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org202f08f" class="outline-3">
<h3 id="org202f08f">Rustic Bread</h3>
<div class="outline-text-3" id="text-org202f08f">
<p>
Makes 2 large loaves
</p>
</div>
<div id="outline-container-orgb6e2283" class="outline-4">
<h4 id="orgb6e2283">Ingredients</h4>
<div class="outline-text-4" id="text-orgb6e2283">
</div>
<ul class="org-ul">
<li><a id="orga6c8620"></a>Grains:<br />
<div class="outline-text-5" id="text-orga6c8620">
<ul class="org-ul">
<li>1/2 cup wheat berries or cracked wheat (optional)</li>
</ul>
</div>
</li>
<li><a id="orgb954f51"></a>Preferment:<br />
<div class="outline-text-5" id="text-orgb954f51">
<ul class="org-ul">
<li>&gt;12.5 oz. water (1 1/2 cups)</li>
<li>1/8 teaspoon instant yeast</li>
<li>1 lb. bread flour (3 1/2 cups; 420 grams)</li>
<li>1/2 tablespoon (5 grams) salt</li>
</ul>
</div>
</li>
<li><a id="org6c682ed"></a>Final dough:<br />
<div class="outline-text-5" id="text-org6c682ed">
<ul class="org-ul">
<li>12.5 oz. water (1 1/2 cups)</li>
<li>1/2 teaspoon instant yeast</li>
<li>8 oz. bread flour (2  cups; 240 grams)</li>
<li>8 oz. whole wheat or rye flour or a mixture of them (around 2 cups; 240 grams)</li>
<li>1/4 cup or so flax meal (optional)</li>
<li>1/2 tablespoon (5 grams) salt</li>
<li>all of the preferment</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org6750e4a" class="outline-4">
<h4 id="org6750e4a">Method</h4>
<div class="outline-text-4" id="text-org6750e4a">
<ol class="org-ol">
<li>If using grains, soak in water, enough to cover, over night.</li>
<li>Put the yeast in the water and stir. Mix the flour and salt together in a bowl and pour in the yeasted water. Mix until the flour is hydrated, adding more water if necessary. Cover the bowl with plastic wrap and leave the pre-ferment out at room temperature overnight (up to 16 hours&#x2026; if you need more time before baking put it in the refrigerator).</li>
<li>To make the final dough, combine all of the ingredients except the pre-ferment in a mixing bowl. Chop the pre-ferment up into small pieces and mix or knead it into the final dough until they are thoroughly combined. This is quite difficult to do by hand: Hamelman assumes the baker has a mixer and can mix it for 5 minutes by machine. I mix and knead my dough by hand for about 10 minutes.</li>
<li>Place the dough back in a greased bowl and ferment for 2 1/2 hours, punching down or folding the dough twice during that time.</li>
<li>(Folding the dough consists of taking the dough out of the bowl, spreading it out a little on a clean surface, folding it in thirds like a letter, rotating it 90 degrees and folding it up again, and then returning the dough to the bowl and covering it again. Like punching down, folding degases the dough some, but it also encourages gluten development. More on this topic in a future post.)</li>
<li>At the end of the fermentation, divide the dough into two pieces and preshape each into a ball. Cover with a clean towel and let each rest for 5 to 10 minutes before shaping into the final shape. Once shaped, cover the loaves with a clean towel and set aside for a final rise, approximately 1 1/4 to 1 1/2 hours.</li>
<li>Halfway though the final rise, begin preheating the oven to 450 degrees. If you are using a baking stone, preheat it as well.</li>
<li>Right before placing it in the oven, score the loaves. Place them in the oven and use whatever technique you use to create stream in the oven (squirt bottle, skillet full of hot water, etc) to encourage proper crust development.</li>
<li>After 20 minutes of baking, rotate the loaves 180 degrees so that they'll bake evenly. Bake until an instant read thermometer reads around 200 degrees, which took approximately 35 minutes for my batard ("football") shaped loaves.</li>
</ol>
</div>
</div>
<div id="outline-container-org7302b2d" class="outline-4">
<h4 id="org7302b2d">Credits</h4>
<div class="outline-text-4" id="text-org7302b2d">
<ul class="org-ul">
<li>(I've tried preheating to 500 degrees, then lowering to 450 degrees and baking for 20 minutes on speed bake. Crispy crust, moist and tender, but a bit gummy inside.)</li>
<li>From <a href="http://www.thefreshloaf.com/recipes/rusticbread">http://www.thefreshloaf.com/recipes/rusticbread</a> February 2011</li>
<li>(date created: 3/4/2011 7:26:21 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2030d68" class="outline-3">
<h3 id="org2030d68">Texas-Style Cornbread</h3>
<div class="outline-text-3" id="text-org2030d68">
<p>
By Diana Rattray, About.com
</p>
</div>
