recipes.org
*** Ingredients
- This cornbread is made with cream style corn and chile peppers, along with shredded cheese.
- 1 1/2 cups yellow cornmeal
- 1 teaspoon salt
- 1 teaspoon baking soda
- 1 1/2 cups buttermilk
- 1 large egg, lightly beaten
- 2 tablespoons melted butter or bacon drippings
- 1/4 cup chopped chile peppers, mild or hot, or use chopped and drained canned or pickled
- jalapeno chile peppers to taste
- 1 cup cream-style corn
- 1 cup shredded sharp Cheddar cheese
*** Method
1) Preparation:
2) Preheat the oven to 425 degrees or 400 degrees for a glass baking dish. In mixing bowl, combine cornmeal, salt, and baking soda. Add buttermilk and egg; beat until batter is smooth. Place butter in 8-inch square pan or baking dish and heat in preheated oven. Pour half of the batter into the hot pan. Spoon cream-style corn evenly over batter, scatter chile peppers over corn layer, and sprinkle with the shredded cheese. Top with remaining batter. Bake cornbread until golden brown, about 20 to 25 minutes. Serve hot.
3) Serves 6 to 8.
*** Credits
- http://southernfood.about.com/od/cornbread/r/bl01002b.htm
- (date created: 5/2/2009 2:43:24 PM)
** Tortillas
*** Ingredients
- 1 cup flour
- 1/4 tsp salt
- 1/2 tsp baking powder
- 4 Tbl crisco
- 1/3 cup water
*** Method
1. Mix dry ingredients. Add crisco and water, mixing until combined. Knead until smooth and elastic. Divide into 4 pieces. Roll in to small smalls and roll out with hands.
2. Cook until done on both sides, about 3-4 minutes.
3. Eat 'em while they're hot!
4. Makes 4 tortillas.
*** Credits
- (Recipe from Cave's Branch Kitchen, March 2003)
- (date created: 6/27/2007 4:42:14 PM)
* Breakfast
** Banana Muffins
*** Ingredients
- 1/2 c shortening (I use butter)
- 1 c less 1 Tablespoon sugar
- 2 eggs
- 1 c mashed ripe bananas
- 2 c flour
- 2 tsp baking powder
- 1 tsp baking soda
- 1/2 tsp. salt
- 3 T milk
*** Method
1. Preheat oven to 400 ( I use 375). Grease muffin cups.  In mixing bowl, cream butter and sugar. Beat in eggs. Add bananas. Beat thoroughly.  Combine dry ingredients. Stir into banana mixture alternately with milk.  Spoon batter into muffin cups, filling them two-thirds full. Bake in preheated oven for 20 to 25 min.  Makes 12.
2. from America Cooks via Mary Jane Legere 2009-06-23
*** Credits
- (date created: 6/23/2009 6:45:57 PM)
** Baron Bagels
*** Ingredients
- 1 teaspoon active dry yeast
- 1 2/3 cups lukewarm water
- 5 cups (600 grams) bread flour
- 2 teaspoons salt, plus more for boiling
- 1 tablespoon diastatic malt powder
- ¼ cup poppy seeds, optional
- ¼ cup sesame seeds, optional
*** Method
1. Put the yeast in the bowl of a standing mixer. Add 1 2/3 cups lukewarm water and allow the yeast to activate, about 5 minutes. Add flour, salt and malt powder and mix at low speed for 5 minutes using the paddle attachment. Cover the dough and allow to rise at room temperature for about 2 hours.
2. Punch the dough down and shape into a rough rectangle about 1 to 1 1/2 inches thick, and about 2 times longer than it is wide. If you are having trouble forming the dough, stretch it, wait for the gluten to relax and reform.
3. Cut the dough into 10 pieces of about 3 ounces each. Roll each into an 8-inch-long snakelike shape, tapering the dough at each end. Circle the dough around your hand, pinching the ends together and rolling under your palm once or twice to seal. Put the bagels on a Silpat or other nonstick baking sheet on top of a jellyroll pan. Cover well with plastic wrap and refrigerate for about 10 hours, or up to 24 hours.
4. Heat the oven to 425 degrees. If you have a baking stone or brick you use for baking, put it on a rack near the bottom of the oven; it will retain heat and produce a crisper bagel. Bring a large pot of water to boil, throw a handful of salt into the boiling water and remove the bagels from the refrigerator.
5. Using your hands, carefully place just enough bagels into the pot to cover the surface of the water, making sure that there are no bagels resting on top of one another. Let them float on one side for about 30 seconds before flipping them to the other side for another 30 seconds or so. Remove the bagels and drain well on a cooling rack.
6. Pour poppy or sesame seeds into a bowl wider than the bagels. Working very quickly, remove the bagels one by one and dip them into the topping. Place them back on the Silpat-covered baking sheet, topping side down.
7. Bake on the second to highest shelf of the oven for about 7 minutes. Then flip the bagels and continue baking for about 8 minutes, or until they are golden brown.
*** Credits
http://cooking.nytimes.com/recipes/1014445-baron-bagels
**** [2016-07-03 Sun] Made for Tracey and Doris who liked the flavor. They were rather flat. I made a dozen; perhaps try for 10 next time?
**** [2016-08-27 Sat] 
1. Replaced about 40g of flour with high gluten flour.
2. I diced a small jalapeño into two of the bagels and sprinkled locatelli on them too. They tasted good
3. Baking: stone on the bottom shelf, cooked on the top. I baked for 7 minutes on one side and then about 10 on the other, the last 3 with speed bake (since they weren't browning). But they were underdone in the middle.
4. Next time should be 7 minutes on one side, 7 minutes on the other, then speed bake for 2 minutes then flip for 2 minutes.
5. These were not good bagels: tasted ok, but were quite gummy, even after toasting. I think I used /way/ too much gluten; perhaps a tablespoon or two next time?
** Belgian Waffles
*** Ingredients
*** Method
1. Combine in large bowl:
     - 2 c.	all purpose flour
     - 2 T.	sugar
     - 3/4	t salt
     - 1/2	t active dry yeast
2. Whisk into dry ingredients:
     - 1/2 c.	 unsalted butter, melted
     - 2 c.	 whole milk
3. Cover and let sit overnight, covered on counter. Next morning, add:
     - 3	eggs, separated
4. Whisk yolks, whip whites to soft peaks and gently fold into batter.
5. Cook for 3 minutes.
6. Makes 10-12 waffles
*** Credits
- (date created: 6/27/2007 4:42:14 PM)
