recipes.html
<div id="outline-container-org4013a20" class="outline-4">
<h4 id="org4013a20">Ingredients</h4>
<div class="outline-text-4" id="text-org4013a20">
<ul class="org-ul">
<li>This cornbread is made with cream style corn and chile peppers, along with shredded cheese.</li>
<li>1 1/2 cups yellow cornmeal</li>
<li>1 teaspoon salt</li>
<li>1 teaspoon baking soda</li>
<li>1 1/2 cups buttermilk</li>
<li>1 large egg, lightly beaten</li>
<li>2 tablespoons melted butter or bacon drippings</li>
<li>1/4 cup chopped chile peppers, mild or hot, or use chopped and drained canned or pickled</li>
<li>jalapeno chile peppers to taste</li>
<li>1 cup cream-style corn</li>
<li>1 cup shredded sharp Cheddar cheese</li>
</ul>
</div>
</div>
<div id="outline-container-org903c852" class="outline-4">
<h4 id="org903c852">Method</h4>
<div class="outline-text-4" id="text-org903c852">
<ol class="org-ol">
<li>Preparation:</li>
<li>Preheat the oven to 425 degrees or 400 degrees for a glass baking dish. In mixing bowl, combine cornmeal, salt, and baking soda. Add buttermilk and egg; beat until batter is smooth. Place butter in 8-inch square pan or baking dish and heat in preheated oven. Pour half of the batter into the hot pan. Spoon cream-style corn evenly over batter, scatter chile peppers over corn layer, and sprinkle with the shredded cheese. Top with remaining batter. Bake cornbread until golden brown, about 20 to 25 minutes. Serve hot.</li>
<li>Serves 6 to 8.</li>
</ol>
</div>
</div>
<div id="outline-container-orge37fe2e" class="outline-4">
<h4 id="orge37fe2e">Credits</h4>
<div class="outline-text-4" id="text-orge37fe2e">
<ul class="org-ul">
<li><a href="http://southernfood.about.com/od/cornbread/r/bl01002b.htm">http://southernfood.about.com/od/cornbread/r/bl01002b.htm</a></li>
<li>(date created: 5/2/2009 2:43:24 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org99a4129" class="outline-3">
<h3 id="org99a4129">Tortillas</h3>
<div class="outline-text-3" id="text-org99a4129">
</div>
<div id="outline-container-org1b5fd50" class="outline-4">
<h4 id="org1b5fd50">Ingredients</h4>
<div class="outline-text-4" id="text-org1b5fd50">
<ul class="org-ul">
<li>1 cup flour</li>
<li>1/4 tsp salt</li>
<li>1/2 tsp baking powder</li>
<li>4 Tbl crisco</li>
<li>1/3 cup water</li>
</ul>
</div>
</div>
<div id="outline-container-org9d73832" class="outline-4">
<h4 id="org9d73832">Method</h4>
<div class="outline-text-4" id="text-org9d73832">
<ol class="org-ol">
<li>Mix dry ingredients. Add crisco and water, mixing until combined. Knead until smooth and elastic. Divide into 4 pieces. Roll in to small smalls and roll out with hands.</li>
<li>Cook until done on both sides, about 3-4 minutes.</li>
<li>Eat 'em while they're hot!</li>
<li>Makes 4 tortillas.</li>
</ol>
</div>
</div>
<div id="outline-container-org738e14c" class="outline-4">
<h4 id="org738e14c">Credits</h4>
<div class="outline-text-4" id="text-org738e14c">
<ul class="org-ul">
<li>(Recipe from Cave's Branch Kitchen, March 2003)</li>
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org868115d" class="outline-2">
<h2 id="org868115d">Breakfast</h2>
<div class="outline-text-2" id="text-org868115d">
</div>
<div id="outline-container-orgd42bb01" class="outline-3">
<h3 id="orgd42bb01">Banana Muffins</h3>
<div class="outline-text-3" id="text-orgd42bb01">
</div>
<div id="outline-container-org6a08eaf" class="outline-4">
<h4 id="org6a08eaf">Ingredients</h4>
<div class="outline-text-4" id="text-org6a08eaf">
<ul class="org-ul">
<li>1/2 c shortening (I use butter)</li>
<li>1 c less 1 Tablespoon sugar</li>
<li>2 eggs</li>
<li>1 c mashed ripe bananas</li>
<li>2 c flour</li>
<li>2 tsp baking powder</li>
<li>1 tsp baking soda</li>
<li>1/2 tsp. salt</li>
<li>3 T milk</li>
</ul>
</div>
</div>
<div id="outline-container-orgb3498e3" class="outline-4">
<h4 id="orgb3498e3">Method</h4>
<div class="outline-text-4" id="text-orgb3498e3">
<ol class="org-ol">
<li>Preheat oven to 400 ( I use 375). Grease muffin cups.  In mixing bowl, cream butter and sugar. Beat in eggs. Add bananas. Beat thoroughly.  Combine dry ingredients. Stir into banana mixture alternately with milk.  Spoon batter into muffin cups, filling them two-thirds full. Bake in preheated oven for 20 to 25 min.  Makes 12.</li>
<li>from America Cooks via Mary Jane Legere 2009-06-23</li>
</ol>
</div>
</div>
<div id="outline-container-org6c6106f" class="outline-4">
<h4 id="org6c6106f">Credits</h4>
<div class="outline-text-4" id="text-org6c6106f">
<ul class="org-ul">
<li>(date created: 6/23/2009 6:45:57 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org860a584" class="outline-3">
<h3 id="org860a584">Baron Bagels</h3>
<div class="outline-text-3" id="text-org860a584">
</div>
<div id="outline-container-orgb153053" class="outline-4">
<h4 id="orgb153053">Ingredients</h4>
<div class="outline-text-4" id="text-orgb153053">
<ul class="org-ul">
<li>1 teaspoon active dry yeast</li>
<li>1 2/3 cups lukewarm water</li>
<li>5 cups (600 grams) bread flour</li>
<li>2 teaspoons salt, plus more for boiling</li>
<li>1 tablespoon diastatic malt powder</li>
<li>¼ cup poppy seeds, optional</li>
<li>¼ cup sesame seeds, optional</li>
</ul>
</div>
</div>
<div id="outline-container-org7da667c" class="outline-4">
<h4 id="org7da667c">Method</h4>
<div class="outline-text-4" id="text-org7da667c">
<ol class="org-ol">
<li>Put the yeast in the bowl of a standing mixer. Add 1 2/3 cups lukewarm water and allow the yeast to activate, about 5 minutes. Add flour, salt and malt powder and mix at low speed for 5 minutes using the paddle attachment. Cover the dough and allow to rise at room temperature for about 2 hours.</li>
<li>Punch the dough down and shape into a rough rectangle about 1 to 1 1/2 inches thick, and about 2 times longer than it is wide. If you are having trouble forming the dough, stretch it, wait for the gluten to relax and reform.</li>
<li>Cut the dough into 10 pieces of about 3 ounces each. Roll each into an 8-inch-long snakelike shape, tapering the dough at each end. Circle the dough around your hand, pinching the ends together and rolling under your palm once or twice to seal. Put the bagels on a Silpat or other nonstick baking sheet on top of a jellyroll pan. Cover well with plastic wrap and refrigerate for about 10 hours, or up to 24 hours.</li>
<li>Heat the oven to 425 degrees. If you have a baking stone or brick you use for baking, put it on a rack near the bottom of the oven; it will retain heat and produce a crisper bagel. Bring a large pot of water to boil, throw a handful of salt into the boiling water and remove the bagels from the refrigerator.</li>
<li>Using your hands, carefully place just enough bagels into the pot to cover the surface of the water, making sure that there are no bagels resting on top of one another. Let them float on one side for about 30 seconds before flipping them to the other side for another 30 seconds or so. Remove the bagels and drain well on a cooling rack.</li>
<li>Pour poppy or sesame seeds into a bowl wider than the bagels. Working very quickly, remove the bagels one by one and dip them into the topping. Place them back on the Silpat-covered baking sheet, topping side down.</li>
<li>Bake on the second to highest shelf of the oven for about 7 minutes. Then flip the bagels and continue baking for about 8 minutes, or until they are golden brown.</li>
</ol>
</div>
</div>
<div id="outline-container-org22068cf" class="outline-4">
<h4 id="org22068cf">Credits</h4>
<div class="outline-text-4" id="text-org22068cf">
<p>
<a href="http://cooking.nytimes.com/recipes/1014445-baron-bagels">http://cooking.nytimes.com/recipes/1014445-baron-bagels</a>
</p>
</div>
<ul class="org-ul">
<li><a id="org9ed8758"></a><span class="timestamp-wrapper"><span class="timestamp">[2016-07-03 Sun] </span></span> Made for Tracey and Doris who liked the flavor. They were rather flat. I made a dozen; perhaps try for 10 next time?<br /></li>
<li><a id="org83d0cd6"></a><span class="timestamp-wrapper"><span class="timestamp">[2016-08-27 Sat]</span></span><br />
<div class="outline-text-5" id="text-org83d0cd6">
<ol class="org-ol">
<li>Replaced about 40g of flour with high gluten flour.</li>
<li>I diced a small jalapeño into two of the bagels and sprinkled locatelli on them too. They tasted good</li>
<li>Baking: stone on the bottom shelf, cooked on the top. I baked for 7 minutes on one side and then about 10 on the other, the last 3 with speed bake (since they weren't browning). But they were underdone in the middle.</li>
<li>Next time should be 7 minutes on one side, 7 minutes on the other, then speed bake for 2 minutes then flip for 2 minutes.</li>
<li>These were not good bagels: tasted ok, but were quite gummy, even after toasting. I think I used <i>way</i> too much gluten; perhaps a tablespoon or two next time?</li>
</ol>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org92e477a" class="outline-3">
<h3 id="org92e477a">Belgian Waffles</h3>
<div class="outline-text-3" id="text-org92e477a">
</div>
<div id="outline-container-orgb016fae" class="outline-4">
<h4 id="orgb016fae">Ingredients</h4>
</div>
<div id="outline-container-orgb4fa00d" class="outline-4">
<h4 id="orgb4fa00d">Method</h4>
<div class="outline-text-4" id="text-orgb4fa00d">
<ol class="org-ol">
<li>Combine in large bowl:
<ul class="org-ul">
<li>2 c.	all purpose flour</li>
<li>2 T.	sugar</li>
<li>3/4	t salt</li>
<li>1/2	t active dry yeast</li>
</ul></li>
<li>Whisk into dry ingredients:
<ul class="org-ul">
<li>1/2 c.	 unsalted butter, melted</li>
<li>2 c.	 whole milk</li>
</ul></li>
<li>Cover and let sit overnight, covered on counter. Next morning, add:
<ul class="org-ul">
<li>3	eggs, separated</li>
</ul></li>
<li>Whisk yolks, whip whites to soft peaks and gently fold into batter.</li>
<li>Cook for 3 minutes.</li>
<li>Makes 10-12 waffles</li>
</ol>
</div>
</div>
