recipes.org
** Best Bran Muffins
*** Ingredients
- 1 cup whole wheat flour
- 1 tsp baking soda
- 1/2 tsp salt
- 1 1/2 c. wheat bran
- 3 Tbls	butter (or oil)
- 2 Tbls	brown sugar
- 2 Tbls	molasses
- 1	egg
- 1 1/2 c.	buttermilk
*** Method
1. Preheat oven to 375 degrees. Grease pan.
2. Sift flour, soda and salt together. Stir in the bran.
3. Beat butter or oil and sugar and molasses together. Add egg and buttermilk. Mix dry ingredients into liquids. Place in the pan, about 3/4 full. Bake muffins 15 to 20 minutes; or a loaf for about 30 minutes.
4. Alternative: use a 3" x 7" loaf. Makes a nice tea bread.
*** Credits
- from The Laurel's Kitchen Bread Book: A Guide to Whole-Grain Breadmaking, pg 333
- 28 March 2009
- (date created: 3/28/2009 1:32:58 PM)
** Best Buttermilk Waffles
*** Ingredients
- 2 1/2 c. flour
- 1/2 tsp. salt
- 2 c. buttermilk
- 8 tbsp. melted butter or shortening
- 1 tsp. baking soda
- 2 tsp. baking powder
- 4 eggs, separated
- 1 tsp. vanilla extract
*** Method
1. Mix dry ingredients.
2. Add egg yolks to milk and blend well.
3. Add dry ingredients, mix together.
4. Add melted butter and beat with a few quick strokes, fold in beaten egg whites.
5. Bake in waffle iron until golden.
6. Can add fruits such as blueberries, strawberries, chopped apple and
   nuts for variety. 
*** Yield Serves 4-6.
*** Credits
- http://www.cooks.com/rec/doc/0,165,155184-228202,00.html
- (date created: 5/2/2009 2:46:00 PM)
** Blueberry Buttermilk Muffins
*** Ingredients
- 1 cup buttermilk
- 1/2 cup butter or margarine -- melted
- 2 eggs -- beaten
- 2 1/2 cups all-purpose flour
- 1 cup sugar
- 2 1/2 teaspoons baking powder
- 1/4 teaspoon salt
- 1 1/2 cup Fresh Or Frozen Blueberries
*** Method
1. In small bowl, combine buttermilk, butter and eggs until blended. In large bowl, combine flour, sugar, baking powder and salt. Make well in center. Add buttermilk mixture, stirring until flour mixture is just moistened. Fold in blueberries. Spoon batter into greased muffin cups, filling 2/3 full. Bake in preheated 400 degree oven 20 minutes or until tops are golden and wooden pick inserted in center comes out clean. Remove from pan. Serve warm or cool on wire rack.
2. This recipe for Blueberry Buttermilk Muffins serves/makes 18
*** Credits
- (date created: 6/27/2007 4:42:11 PM)
** Buttermilk Scones with Raisins
By Donna Pilato, About.com
- It's difficult to picture a tea party that doesn't have at least one scone on the menu. Here is a simple recipe for buttermilk scones that turn out fluffy and buttery in absolutely no time. They're best served warm from the oven, but are still pretty tasty the following day.
- Prep Time: 15 minutes
- Cook Time: 15 minutes
*** Ingredients
- 1 3/4 cups all-purpose flour
- 1 teaspoon sugar
- 1 teaspoon salt
- 2 teaspoons baking powder
- 1/2 teaspoon baking soda
- 5 tablespoons unsalted butter, room temperature
- 1/2 cup raisins
- 3/4 cup buttermilk, or slightly more as needed
*** Method
1. Preparation:
2. Preheat the oven to 450 degrees.
3. Mix thoroughly the flour, sugar, salt, baking powder and baking soda in a large bowl with a whisk or spoon.
4. Cut in the butter until the mixture resembles coarse meal. Stir in the raisins. Using a large spoon, blend in buttermilk until a soft dough forms.
5. Place dough on a floured board and roll out to 1/2 inch thickness. Using a sharp knife, cut dough into six squares, then cut each square again on the diagonal. Place triangles on ungreased baking sheet. Bake for 10 to 12 minutes until golden brown.
*** Yield Makes 12 scones. 
*** Credits
7. http://entertaining.about.com/od/recipesandmenus/r/buttermilkscone.htm
8. (date created: 5/2/2009 2:44:09 PM)
** Buttermilk Syrup
*** Ingredients
- 1/2 cup unsalted butter
- 1 cup sugar
- 1 cup buttermilk
- 2 teaspoons vanilla
- 1 tablespoon Light karo syrup
- 1/2 teaspoon baking soda
*** Method
1. In a large pot or saucepan over medium heat add the butter, sugar, buttermilk, vanilla and karo syrup. Heat until everything is well combined and bring to a boil.  
2. Quickly remove the pot from the heat and add the baking soda, place back over the heat, stirring constantly. The syrup will grow large and threaten to boil over which is why a large pot is essential. If it gets too close to the edge remove from the burner and continue stirring to bring it down. 
3. Stir for 30 seconds over the heat (I often just take mine off so I don't risk boiling over) and serve immediately. 
*** Credit
http://www.ohsweetbasil.com/buttermilk-syrup.html
