recipes.html
<div id="outline-container-org1cd3f35" class="outline-4">
<h4 id="org1cd3f35">Credits</h4>
<div class="outline-text-4" id="text-org1cd3f35">
<ul class="org-ul">
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org09e62bf" class="outline-3">
<h3 id="org09e62bf">Best Bran Muffins</h3>
<div class="outline-text-3" id="text-org09e62bf">
</div>
<div id="outline-container-orge4d6e70" class="outline-4">
<h4 id="orge4d6e70">Ingredients</h4>
<div class="outline-text-4" id="text-orge4d6e70">
<ul class="org-ul">
<li>1 cup whole wheat flour</li>
<li>1 tsp baking soda</li>
<li>1/2 tsp salt</li>
<li>1 1/2 c. wheat bran</li>
<li>3 Tbls	butter (or oil)</li>
<li>2 Tbls	brown sugar</li>
<li>2 Tbls	molasses</li>
<li>1	egg</li>
<li>1 1/2 c.	buttermilk</li>
</ul>
</div>
</div>
<div id="outline-container-org3a04dfa" class="outline-4">
<h4 id="org3a04dfa">Method</h4>
<div class="outline-text-4" id="text-org3a04dfa">
<ol class="org-ol">
<li>Preheat oven to 375 degrees. Grease pan.</li>
<li>Sift flour, soda and salt together. Stir in the bran.</li>
<li>Beat butter or oil and sugar and molasses together. Add egg and buttermilk. Mix dry ingredients into liquids. Place in the pan, about 3/4 full. Bake muffins 15 to 20 minutes; or a loaf for about 30 minutes.</li>
<li>Alternative: use a 3" x 7" loaf. Makes a nice tea bread.</li>
</ol>
</div>
</div>
<div id="outline-container-org1c54a75" class="outline-4">
<h4 id="org1c54a75">Credits</h4>
<div class="outline-text-4" id="text-org1c54a75">
<ul class="org-ul">
<li>from The Laurel's Kitchen Bread Book: A Guide to Whole-Grain Breadmaking, pg 333</li>
<li>28 March 2009</li>
<li>(date created: 3/28/2009 1:32:58 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc559f71" class="outline-3">
<h3 id="orgc559f71">Best Buttermilk Waffles</h3>
<div class="outline-text-3" id="text-orgc559f71">
</div>
<div id="outline-container-org3c99881" class="outline-4">
<h4 id="org3c99881">Ingredients</h4>
<div class="outline-text-4" id="text-org3c99881">
<ul class="org-ul">
<li>2 1/2 c. flour</li>
<li>1/2 tsp. salt</li>
<li>2 c. buttermilk</li>
<li>8 tbsp. melted butter or shortening</li>
<li>1 tsp. baking soda</li>
<li>2 tsp. baking powder</li>
<li>4 eggs, separated</li>
<li>1 tsp. vanilla extract</li>
</ul>
</div>
</div>
<div id="outline-container-orgf9f5991" class="outline-4">
<h4 id="orgf9f5991">Method</h4>
<div class="outline-text-4" id="text-orgf9f5991">
<ol class="org-ol">
<li>Mix dry ingredients.</li>
<li>Add egg yolks to milk and blend well.</li>
<li>Add dry ingredients, mix together.</li>
<li>Add melted butter and beat with a few quick strokes, fold in beaten egg whites.</li>
<li>Bake in waffle iron until golden.</li>
<li>Can add fruits such as blueberries, strawberries, chopped apple and
nuts for variety.</li>
</ol>
</div>
</div>
<div id="outline-container-orgc4c32e7" class="outline-4">
<h4 id="orgc4c32e7">Yield Serves 4-6.</h4>
</div>
<div id="outline-container-org270b358" class="outline-4">
<h4 id="org270b358">Credits</h4>
<div class="outline-text-4" id="text-org270b358">
<ul class="org-ul">
<li><a href="http://www.cooks.com/rec/doc/0,165,155184-228202,00.html">http://www.cooks.com/rec/doc/0,165,155184-228202,00.html</a></li>
<li>(date created: 5/2/2009 2:46:00 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge92b989" class="outline-3">
<h3 id="orge92b989">Blueberry Buttermilk Muffins</h3>
<div class="outline-text-3" id="text-orge92b989">
</div>
<div id="outline-container-orgc0f54d0" class="outline-4">
<h4 id="orgc0f54d0">Ingredients</h4>
<div class="outline-text-4" id="text-orgc0f54d0">
<ul class="org-ul">
<li>1 cup buttermilk</li>
<li>1/2 cup butter or margarine &#x2013; melted</li>
<li>2 eggs &#x2013; beaten</li>
<li>2 1/2 cups all-purpose flour</li>
<li>1 cup sugar</li>
<li>2 1/2 teaspoons baking powder</li>
<li>1/4 teaspoon salt</li>
<li>1 1/2 cup Fresh Or Frozen Blueberries</li>
</ul>
</div>
</div>
<div id="outline-container-org86b01c9" class="outline-4">
<h4 id="org86b01c9">Method</h4>
<div class="outline-text-4" id="text-org86b01c9">
<ol class="org-ol">
<li>In small bowl, combine buttermilk, butter and eggs until blended. In large bowl, combine flour, sugar, baking powder and salt. Make well in center. Add buttermilk mixture, stirring until flour mixture is just moistened. Fold in blueberries. Spoon batter into greased muffin cups, filling 2/3 full. Bake in preheated 400 degree oven 20 minutes or until tops are golden and wooden pick inserted in center comes out clean. Remove from pan. Serve warm or cool on wire rack.</li>
<li>This recipe for Blueberry Buttermilk Muffins serves/makes 18</li>
</ol>
</div>
</div>
<div id="outline-container-org60c3602" class="outline-4">
<h4 id="org60c3602">Credits</h4>
<div class="outline-text-4" id="text-org60c3602">
<ul class="org-ul">
<li>(date created: 6/27/2007 4:42:11 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org53fbddd" class="outline-3">
<h3 id="org53fbddd">Buttermilk Scones with Raisins</h3>
<div class="outline-text-3" id="text-org53fbddd">
<p>
By Donna Pilato, About.com
</p>
<ul class="org-ul">
<li>It's difficult to picture a tea party that doesn't have at least one scone on the menu. Here is a simple recipe for buttermilk scones that turn out fluffy and buttery in absolutely no time. They're best served warm from the oven, but are still pretty tasty the following day.</li>
<li>Prep Time: 15 minutes</li>
<li>Cook Time: 15 minutes</li>
</ul>
</div>
<div id="outline-container-org4f60f50" class="outline-4">
<h4 id="org4f60f50">Ingredients</h4>
<div class="outline-text-4" id="text-org4f60f50">
<ul class="org-ul">
<li>1 3/4 cups all-purpose flour</li>
<li>1 teaspoon sugar</li>
<li>1 teaspoon salt</li>
<li>2 teaspoons baking powder</li>
<li>1/2 teaspoon baking soda</li>
<li>5 tablespoons unsalted butter, room temperature</li>
<li>1/2 cup raisins</li>
<li>3/4 cup buttermilk, or slightly more as needed</li>
</ul>
</div>
</div>
<div id="outline-container-org3d75084" class="outline-4">
<h4 id="org3d75084">Method</h4>
<div class="outline-text-4" id="text-org3d75084">
<ol class="org-ol">
<li>Preparation:</li>
<li>Preheat the oven to 450 degrees.</li>
<li>Mix thoroughly the flour, sugar, salt, baking powder and baking soda in a large bowl with a whisk or spoon.</li>
<li>Cut in the butter until the mixture resembles coarse meal. Stir in the raisins. Using a large spoon, blend in buttermilk until a soft dough forms.</li>
<li>Place dough on a floured board and roll out to 1/2 inch thickness. Using a sharp knife, cut dough into six squares, then cut each square again on the diagonal. Place triangles on ungreased baking sheet. Bake for 10 to 12 minutes until golden brown.</li>
</ol>
</div>
</div>
<div id="outline-container-orgca39301" class="outline-4">
<h4 id="orgca39301">Yield Makes 12 scones.</h4>
</div>
<div id="outline-container-org480407b" class="outline-4">
<h4 id="org480407b">Credits</h4>
<div class="outline-text-4" id="text-org480407b">
<ol class="org-ol">
<li><a href="http://entertaining.about.com/od/recipesandmenus/r/buttermilkscone.htm">http://entertaining.about.com/od/recipesandmenus/r/buttermilkscone.htm</a></li>
<li>(date created: 5/2/2009 2:44:09 PM)</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org2606369" class="outline-3">
<h3 id="org2606369">Buttermilk Syrup</h3>
<div class="outline-text-3" id="text-org2606369">
</div>
<div id="outline-container-orgfde620f" class="outline-4">
<h4 id="orgfde620f">Ingredients</h4>
<div class="outline-text-4" id="text-orgfde620f">
<ul class="org-ul">
<li>1/2 cup unsalted butter</li>
<li>1 cup sugar</li>
<li>1 cup buttermilk</li>
<li>2 teaspoons vanilla</li>
<li>1 tablespoon Light karo syrup</li>
<li>1/2 teaspoon baking soda</li>
</ul>
</div>
</div>
<div id="outline-container-orgc350c82" class="outline-4">
<h4 id="orgc350c82">Method</h4>
<div class="outline-text-4" id="text-orgc350c82">
<ol class="org-ol">
<li>In a large pot or saucepan over medium heat add the butter, sugar, buttermilk, vanilla and karo syrup. Heat until everything is well combined and bring to a boil.</li>
<li>Quickly remove the pot from the heat and add the baking soda, place back over the heat, stirring constantly. The syrup will grow large and threaten to boil over which is why a large pot is essential. If it gets too close to the edge remove from the burner and continue stirring to bring it down.</li>
<li>Stir for 30 seconds over the heat (I often just take mine off so I don't risk boiling over) and serve immediately.</li>
</ol>
</div>
</div>
<div id="outline-container-org6233404" class="outline-4">
<h4 id="org6233404">Credit</h4>
<div class="outline-text-4" id="text-org6233404">
<p>
<a href="http://www.ohsweetbasil.com/buttermilk-syrup.html">http://www.ohsweetbasil.com/buttermilk-syrup.html</a>
</p>
</div>
</div>
</div>
