recipes.org
*** Method
1. Brush the interior of a 5-quart mixing bowl with melted butter and set aside for rising the dough.
2. To assemble liquid mixture: If using milk, heat in a medium-sized saucepan over medium-low heat until just warm throughout. Pour the milk into a large mixing bowl and add shortening and 1/2 cup lukewarm water. (If the milk became too hot, let it cool until just warm.) If not using milk, pour the 2 cups lukewarm water into a mixing bowl and add the shortening (no need to melt). Dissolve the yeast in 1/4 cup lukewarm water with a pinch of the sugar. When yeast is creamy and starts to bubble, add to mixing bowl with 2 tablespoons of the sugar or the barley malt extract, salt and black pepper, if using.
3. To complete and knead the dough: Briskly stir in enough flour, a cup or so at a time, to make dough that is not easily stirred in the bowl. Turn out the dough onto a floured wooden board and knead in a brisk push, fold and turning motion, until smooth and elastic, about 5 minutes. Add only as much additional flour as necessary to keep dough from sticking to your hands and work surface. As always, use a pastry scraper while kneading to scrape dough off the board cleanly as you continue to knead in a sufficient amount of flour.
4. To rise the dough: Place the dough in the buttered bowl. Brush top of the dough with more melted butter, and then cover with buttered plastic wrap and a clean kitchen towel. Let rise in a warm, draft-free spot for 1 hour (or up to 2 1/2 hours for an extremely light and flavorful bagel). Uncover bowl and punch down dough with several swift swats with the back of your hand. Recover bowl and refrigerate dough for 4 hours or, preferably, overnight (and up to two days!!).
5. To set up for shaping bagels: Position the rack to the lower third of the oven.
     a. If using a large pizza stone, place it on the oven rack and sprinkle a baker's peel generously with cornmeal and, if desired, a combination of seeds (poppy, sesame and caraway).
     b. Otherwise, brush or spray a large dark steel shallow baking sheet with vegetable oil and sprinkle the interior as described above. Place an (empty) heat proof pan on the rack underneath the tiles or stone.
     c. Preheat oven to 500 degrees F at least 30 minutes before you plan to shape, boil and bake bagels. (If working with a double oven, preheat the second oven as well). Pour the prepared egg-white glaze through a small medium-mesh sieve into another bowl to remove excess coagulation. Set the glaze next to your work surface. While the oven preheats, bring one or two large pots of water to a rapid boil. Lay a clean kitchen towel on each of 2 shallow trays or baking sheets (for 10 bagels) and sprinkle the towels lightly with flour.
6. To shape bagels: Remove the dough from the refrigerator. Punch the chilled dough down, with several swift blows, until totally deflated. Turn dough out onto a lightly floured board. Using the blade of a pastry scraper, divide the dough in half. I recommend baking only 5 bagels at a time (per oven) so each has enough space around it to bake properly. If not working with a double oven, place half of dough back in bowl, cover and refrigerate. Divide each half of dough into 5 equal pieces (for 10 in all). You'll work with 1 piece at a time, keeping the remaining pieces covered with a towel. Shape one piece of dough into a very tight, round ball by drawing dough up and pinching it at the top. Keep pinching and pulling upward, always keeping ball on a lightly floured board to prevent sticking. The ball should be perfectly round with the exception of a little knot of pinched dough on top. Turn ball (knot side down) and flatten gently. Push your index finger through the center of dough (right where the knot was). Gently stretch the hole, while being careful not to tear the rim, until hole measures about 2 to 2 1/2 inches in diameter (the hole will shrink after rising and baking). As each bagel is shaped, place it on the prepared towel-lined trays spaced 2 inches apart. Cover bagels with another clean towel.
7. To boil the bagels: Add 1/4 cup sugar and the baking soda to the pot of boiling water. Bring 1 tray of risen bagels over to the stove and carefully lower 2 to 4 bagels into the water (one at a time). Bagels should be able to sit freely in the water without touching and will expand in the water. Once the bagels rise to the top of the pot, continue to boil for 1 1/2 to 2 minutes on each side, turning with a large round slotted skimmer or a large slotted spoon. After bagels have cooked on the second side, remove them with spatula (draining water) and drain on a kitchen towel (smoothest side up). Repeat with the remaining bagels
8. To glaze and top the bagels:  Place bagels (again, smoothest side up) on the prepared baker's peel or baking sheet. Using a pastry brush, paint boiled bagels with egg-white glaze. Don't worry if the glazed bagels seem wrinkled; this will smooth in the oven. When all of the bagels have been boiled and positioned on the peel or baking sheet, brush tops and sides of bagels once more with glaze. Sprinkle the desired toppings on each bagel or just glaze and leave plain. (Try not to let the glaze fall into puddles around bagels or into hole as this makes bagel dough stick to the peel. (Having the egg whites at room temperature and straining, helps remove their clumsy gelatinous quality.)
9. To bake the bagels: Just before baking, place the ice cubes and a few tablespoons water into a cup and pour this into the pan that sits below the baker's stone. If using tiles, place baker's peel all the way to the back of the hot oven and with a swift jerk; remove the peel, leaving the bagels on the hot tiles (or place baking sheet on hot oven rack). Reduce oven temperature to 450 degrees F and bake for ~25 minutes (If working with a convection oven, bake the bagels at 450 for 20 minutes. Keep the rest of the instructions the same.); turn oven off and allow bagels to sit there for 5 minutes. Open oven and allow bagels to sit in oven for 5 minutes more. Remove bagels to wire racks when uniformly golden and crisp. Cool thoroughly before storing.
10. To prepare the oven for the remaining batch of bagels (if not using a double oven): Before reheating the oven to 500 degrees F, sweep away any excess cornmeal and seeds from the tiles and onto a baking sheet to discard, using a cornmeal sweeper. (This is to prevent burning and smoking.) Preheat the oven, boil, and glaze, top and bake remaining bagels as described above.)
11. To store: Store cooled bagels to be served on the day of baking in a paper bag. Store the remaining bagels in a jumbo-sized, heavy-duty plastic bag, at room temperature. Bagels also freeze well in well-sealed freezer bags. To thaw, remove from the freezer the night before and allow bagels to thaw, overnight, in the sealed bag.
