recipes.org
*** Credits
http://www.laurengroveman.com/recipes/breads/homemade-bagels/
From Sarah's friend Kristen
[2019-01-27 Sun] Made for brunch at Jan and Dan's with Nancy and Pat. Overall, pleased with the results.
- I added about 1 Tbsp of gluten to the flour.
- I let the dough rise for about 2.5 hours and then put it in the refrigerator for the rest of the day.
- I formed the bagels just before going to bed.
- In the morning, I took the bagels from the refrigerator; they had puffed a bit and closed the hole somewhat. I used two chopsticks to open the hole and kept them covered and out for 2 hours.
- At bath time, I boiled water and added 4 Tbsps of non-diastatic malt. Big mistake! It boiled over all over the stove. I should take it down to a simmer.
- After the bath, instead of drying the bagels on towels, I used racks for the first few. Mistake: they are highly impressionable. Towels on top of racks is fine.
- I baked them on the pizza stone, using convection for 20 minutes with a pan of boiling water. Then 5 minutes with the oven off and the door closed, then 5 minutes with the door open before letting them cool on the rack.
    + They were good, but I'd like them to be a bit crispier.
    + Perhaps I ought to remove the pan half-way through?
[2016-09-23 Fri]: Modifications:
- I used 1 cup water + 1 cup milk
    - Should try 1.5 cup water + .5 cup milk
- I added 1.5 tablespoons gluten flour.
    - Should cut back to 1 tablespoon.
- I added (slightly more than) 1 tablespoon diastatic malt powder.
    - Should try molasses or, better yet, malt syrup.
- Some say each bagel ought to weigh between 2.5 - 3 oz (70 - 85 grams), but others liked them in the 120-140 gram range.
    - I used ~130g and this was the right size! I got 10 good-sized bagels out of this recipe.
- In the morning, let dough warm for about an hour(!). Then after forming the bagels, let them rise for another 1 hour.
    - This seems crucial!
- https://cookingupastory.com/authentic-east-coast-bagels
- I'm not sure how long I baked them (T did a Google Hangout from Chicago in the middle and I never set the timer). It was probably a bit shy of 20 minutes, but the exteriors were as brown as I'd want them. They were a bit doughy in the middle, but the exterior was great: crisp and just a tad chewy.
- I had pre-heated the oven to 500 degrees for an hour (made some granola in it, which worked fine) then turned down to 450 degrees before I baked.
    - I should probably have turned it down sooner.
- I attempted to use a SilPat: a mistake. I couldn't easily get the SilPat off the peel onto the stone. I wound up putting the bagels directly on the stone (sans corn meal) and they stuck and oozed.
    - Next time: use parchment!
** Golden Raisin Oat Bran Muffins
Gourmet | January 2011
by Ian Knauer
- active time: 20 min
- total time:	 40 min
- Equipment: a muffin pan with 12 (1/2-cup) muffin cups
*** Ingredients
- 2 cups all-purpose flour
- 3/4 cup oat bran
- 1/4 cup sugar
- 2 teaspoons baking powder
- 3/4 teaspoons baking soda
- 1 teaspoon salt
- 1/2 teaspoon cinnamon
- 1 cup well-shaken buttermilk
- 1/3 cup mild honey
- 1/2 stick unsalted butter, melted and cooled
- 2 large eggs
- 1 cup golden raisins
*** Method
1. Preheat oven to 375 degrees F with rack in middle. Butter muffin pan.
2. Whisk together flour, oat bran, sugar, baking powder, baking soda, salt, and cinnamon in a large bowl.
3. In a separate bowl, whisk together buttermilk, honey, butter, and eggs. Add to dry ingredients along with raisins and stir until just combined.
4. Divide batter among muffin cups. Bake until a wooden pick inserted into center of a muffin comes out clean, about 20 minutes. Turn out onto a rack to cool.
5. Cooks' note: Muffins keep in an airtight container at room temperature 3 days.
*** Credits
6. Epicurious.com \copy Conde Nast Digital, Inc. All rights reserved.
7. http://www.epicurious.com/recipes/food/printerfriendly/Golden-Raisin-Oat-Bran-Muffins-357450?
8. 27-Mar-14
*** Yield Makes 12 muffins
** Oatmeal Raisin Pancakes with Cinnamon Sour Cream
Recipe courtesy of Gourmet Magazine
Serves: 14 (4-inch) pancakes
*** Ingredients
- 1 cup old fashion oats
- 1 cup all-purpose flour
- 1/4 cup (packed) light brown sugar
- 2 teaspoons baking powder
- 1/2 teaspoon baking soda
- 1/2 teaspoon cinnamon
- 1 2/3 cups buttermilk
- 2 large eggs
- 4 tablespoons unsalted butter, melted
- 1/2 teaspoon pure vanilla extract
- 1 cup plump raisins
- Cinnamon Sour cream, recipe follows
- Maple syrup for topping
*** Method
1. In a medium bowl, whisk together the oats, flour, brown sugar, baking powder, baking soda, and cinnamon. 
2. In another bowl, whisk together buttermilk, eggs, melted butter and vanilla, blend thoroughly. 
3. Pour the liquid ingredients over the dry ingredients and mix with the whisk until just combined. Don't worry if the batter is a bit lumpy. 
4. With a rubber spatula gently fold in the raisins. The batter will thicken as it stands. 
5. If necessary, lightly butter, oil, or spray your griddle or skillet. Preheat over medium heat or if using an electric griddle set to 350 degrees F. If you want to hold the pancakes until serving time preheat your oven to 200 degrees F.
6. Spoon 1/4 cup of batter onto griddle for each pancake, allowing space for spreading, and use a spatula or the back of your spoon to lightly press the batter into rounds.
7. When the underside of the pancake are golden and the tops are speckled with bubbles that pop and stay open, flip over with a wide spatula and cook on the other side until light brown.
8. Serve immediately or place in oven while you make the rest of the batch.
*** Credits
- (date created: 4/19/2009 7:29:37 AM)
# -*- mode: org; coding: utf-8 -*-
** Pancakes, Buttermilk
*** Ingredients
- 1 egg
- 1 cup buttermilk
- 2 Tblsp shortening (melted) -or- vegetable oil
- 1 cup (120g) flour
- 1 Tblsp sugar
- 1 teasp baking powder
- 1/2 teasp baking soda
- 1/2 teasp salt
