recipes.html
<div id="outline-container-org968ad35" class="outline-4">
<h4 id="org968ad35">Credits</h4>
<div class="outline-text-4" id="text-org968ad35">
<p>
<a href="http://www.laurengroveman.com/recipes/breads/homemade-bagels/">http://www.laurengroveman.com/recipes/breads/homemade-bagels/</a>
From Sarah's friend Kristen
<span class="timestamp-wrapper"><span class="timestamp">[2019-01-27 Sun] </span></span> Made for brunch at Jan and Dan's with Nancy and Pat. Overall, pleased with the results.
</p>
<ul class="org-ul">
<li>I added about 1 Tbsp of gluten to the flour.</li>
<li>I let the dough rise for about 2.5 hours and then put it in the refrigerator for the rest of the day.</li>
<li>I formed the bagels just before going to bed.</li>
<li>In the morning, I took the bagels from the refrigerator; they had puffed a bit and closed the hole somewhat. I used two chopsticks to open the hole and kept them covered and out for 2 hours.</li>
<li>At bath time, I boiled water and added 4 Tbsps of non-diastatic malt. Big mistake! It boiled over all over the stove. I should take it down to a simmer.</li>
<li>After the bath, instead of drying the bagels on towels, I used racks for the first few. Mistake: they are highly impressionable. Towels on top of racks is fine.</li>
<li>I baked them on the pizza stone, using convection for 20 minutes with a pan of boiling water. Then 5 minutes with the oven off and the door closed, then 5 minutes with the door open before letting them cool on the rack.
<ul class="org-ul">
<li>They were good, but I'd like them to be a bit crispier.</li>
<li>Perhaps I ought to remove the pan half-way through?</li>
</ul></li>
</ul>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2016-09-23 Fri]</span></span>: Modifications:
</p>
<ul class="org-ul">
<li>I used 1 cup water + 1 cup milk
<ul class="org-ul">
<li>Should try 1.5 cup water + .5 cup milk</li>
</ul></li>
<li>I added 1.5 tablespoons gluten flour.
<ul class="org-ul">
<li>Should cut back to 1 tablespoon.</li>
</ul></li>
<li>I added (slightly more than) 1 tablespoon diastatic malt powder.
<ul class="org-ul">
<li>Should try molasses or, better yet, malt syrup.</li>
</ul></li>
<li>Some say each bagel ought to weigh between 2.5 - 3 oz (70 - 85 grams), but others liked them in the 120-140 gram range.
<ul class="org-ul">
<li>I used ~130g and this was the right size! I got 10 good-sized bagels out of this recipe.</li>
</ul></li>
<li>In the morning, let dough warm for about an hour(!). Then after forming the bagels, let them rise for another 1 hour.
<ul class="org-ul">
<li>This seems crucial!</li>
</ul></li>
<li><a href="https://cookingupastory.com/authentic-east-coast-bagels">https://cookingupastory.com/authentic-east-coast-bagels</a></li>
<li>I'm not sure how long I baked them (T did a Google Hangout from Chicago in the middle and I never set the timer). It was probably a bit shy of 20 minutes, but the exteriors were as brown as I'd want them. They were a bit doughy in the middle, but the exterior was great: crisp and just a tad chewy.</li>
<li>I had pre-heated the oven to 500 degrees for an hour (made some granola in it, which worked fine) then turned down to 450 degrees before I baked.
<ul class="org-ul">
<li>I should probably have turned it down sooner.</li>
</ul></li>
<li>I attempted to use a SilPat: a mistake. I couldn't easily get the SilPat off the peel onto the stone. I wound up putting the bagels directly on the stone (sans corn meal) and they stuck and oozed.
<ul class="org-ul">
<li>Next time: use parchment!</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org365ba03" class="outline-3">
<h3 id="org365ba03">Golden Raisin Oat Bran Muffins</h3>
<div class="outline-text-3" id="text-org365ba03">
<p>
Gourmet | January 2011
by Ian Knauer
</p>
<ul class="org-ul">
<li>active time: 20 min</li>
<li>total time:	 40 min</li>
<li>Equipment: a muffin pan with 12 (1/2-cup) muffin cups</li>
</ul>
</div>
<div id="outline-container-org1cf7576" class="outline-4">
<h4 id="org1cf7576">Ingredients</h4>
<div class="outline-text-4" id="text-org1cf7576">
<ul class="org-ul">
<li>2 cups all-purpose flour</li>
<li>3/4 cup oat bran</li>
<li>1/4 cup sugar</li>
<li>2 teaspoons baking powder</li>
<li>3/4 teaspoons baking soda</li>
<li>1 teaspoon salt</li>
<li>1/2 teaspoon cinnamon</li>
<li>1 cup well-shaken buttermilk</li>
<li>1/3 cup mild honey</li>
<li>1/2 stick unsalted butter, melted and cooled</li>
<li>2 large eggs</li>
<li>1 cup golden raisins</li>
</ul>
</div>
</div>
<div id="outline-container-org692a77d" class="outline-4">
<h4 id="org692a77d">Method</h4>
<div class="outline-text-4" id="text-org692a77d">
<ol class="org-ol">
<li>Preheat oven to 375 degrees F with rack in middle. Butter muffin pan.</li>
<li>Whisk together flour, oat bran, sugar, baking powder, baking soda, salt, and cinnamon in a large bowl.</li>
<li>In a separate bowl, whisk together buttermilk, honey, butter, and eggs. Add to dry ingredients along with raisins and stir until just combined.</li>
<li>Divide batter among muffin cups. Bake until a wooden pick inserted into center of a muffin comes out clean, about 20 minutes. Turn out onto a rack to cool.</li>
<li>Cooks' note: Muffins keep in an airtight container at room temperature 3 days.</li>
</ol>
</div>
</div>
<div id="outline-container-org81aa7f9" class="outline-4">
<h4 id="org81aa7f9">Credits</h4>
<div class="outline-text-4" id="text-org81aa7f9">
<ol class="org-ol">
<li>Epicurious.com &copy; Conde Nast Digital, Inc. All rights reserved.</li>
<li><a href="http://www.epicurious.com/recipes/food/printerfriendly/Golden-Raisin-Oat-Bran-Muffins-357450">http://www.epicurious.com/recipes/food/printerfriendly/Golden-Raisin-Oat-Bran-Muffins-357450</a>?</li>
<li>27-Mar-14</li>
</ol>
</div>
</div>
<div id="outline-container-orgcf101d5" class="outline-4">
<h4 id="orgcf101d5">Yield Makes 12 muffins</h4>
</div>
</div>
<div id="outline-container-org0e85226" class="outline-3">
<h3 id="org0e85226">Oatmeal Raisin Pancakes with Cinnamon Sour Cream</h3>
<div class="outline-text-3" id="text-org0e85226">
<p>
Recipe courtesy of Gourmet Magazine
Serves: 14 (4-inch) pancakes
</p>
</div>
<div id="outline-container-org8732b20" class="outline-4">
<h4 id="org8732b20">Ingredients</h4>
<div class="outline-text-4" id="text-org8732b20">
<ul class="org-ul">
<li>1 cup old fashion oats</li>
<li>1 cup all-purpose flour</li>
<li>1/4 cup (packed) light brown sugar</li>
<li>2 teaspoons baking powder</li>
<li>1/2 teaspoon baking soda</li>
<li>1/2 teaspoon cinnamon</li>
<li>1 2/3 cups buttermilk</li>
<li>2 large eggs</li>
<li>4 tablespoons unsalted butter, melted</li>
<li>1/2 teaspoon pure vanilla extract</li>
<li>1 cup plump raisins</li>
<li>Cinnamon Sour cream, recipe follows</li>
<li>Maple syrup for topping</li>
</ul>
</div>
</div>
<div id="outline-container-org28461b0" class="outline-4">
<h4 id="org28461b0">Method</h4>
<div class="outline-text-4" id="text-org28461b0">
<ol class="org-ol">
<li>In a medium bowl, whisk together the oats, flour, brown sugar, baking powder, baking soda, and cinnamon.</li>
<li>In another bowl, whisk together buttermilk, eggs, melted butter and vanilla, blend thoroughly.</li>
<li>Pour the liquid ingredients over the dry ingredients and mix with the whisk until just combined. Don't worry if the batter is a bit lumpy.</li>
<li>With a rubber spatula gently fold in the raisins. The batter will thicken as it stands.</li>
<li>If necessary, lightly butter, oil, or spray your griddle or skillet. Preheat over medium heat or if using an electric griddle set to 350 degrees F. If you want to hold the pancakes until serving time preheat your oven to 200 degrees F.</li>
<li>Spoon 1/4 cup of batter onto griddle for each pancake, allowing space for spreading, and use a spatula or the back of your spoon to lightly press the batter into rounds.</li>
<li>When the underside of the pancake are golden and the tops are speckled with bubbles that pop and stay open, flip over with a wide spatula and cook on the other side until light brown.</li>
<li>Serve immediately or place in oven while you make the rest of the batch.</li>
</ol>
</div>
</div>
<div id="outline-container-org49f838b" class="outline-4">
<h4 id="org49f838b">Credits</h4>
<div class="outline-text-4" id="text-org49f838b">
<ul class="org-ul">
<li>(date created: 4/19/2009 7:29:37 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org60fcae8" class="outline-3">
<h3 id="org60fcae8">Pancakes, Buttermilk</h3>
<div class="outline-text-3" id="text-org60fcae8">
</div>
<div id="outline-container-org79e279d" class="outline-4">
<h4 id="org79e279d">Ingredients</h4>
<div class="outline-text-4" id="text-org79e279d">
<ul class="org-ul">
<li>1 egg</li>
<li>1 cup buttermilk</li>
<li>2 Tblsp shortening (melted) -or- vegetable oil</li>
<li>1 cup (120g) flour</li>
<li>1 Tblsp sugar</li>
<li>1 teasp baking powder</li>
<li>1/2 teasp baking soda</li>
<li>1/2 teasp salt</li>
</ul>
</div>
</div>
