recipes.org
*** Method
1. Cut a wide pocket into each slice of bread without cutting all the way through the bread.
2. In the bowl of a stand mixer fitted with the paddle attachment, beat together the cream cheese, vanilla extract, lemon juice, lemon zest and 1/2 cup diced strawberries until well combined, about 2 minutes.
3. Slather a portion of the cream cheese mixture inside each bread pocket and press each bread pocket closed.
4. In a medium bowl, whisk together the eggs, heavy cream, cinnamon and sugar.
5. Place a large pan over medium heat and add 2 tablespoons of butter. Once the butter has melted, dip each stuffed slice of toast into the egg mixture on all sides and shake off any excess. Place the bread immediately into the pan and cook until golden, about 2 minutes. Flip once and continue cooking until golden, about 2 minutes. Repeat the coating the cooking process with the remaining slices of bread. (Do not overcrowd the pan.)
6. Serve the French toast immediately topped with maple syrup and the remaining diced strawberries.
*** Credits
http://www.justataste.com/strawberry-cheesecake-stuffed-french-toast-recipe/
**** Kelly's Note:
Any variety of bread will work in this recipe. A few of my favorites include a loaf of sourdough, a French baguette or (extra-thick) Texas toast. Use whatever type of bread you prefer, however stale bread works best for French Toast, as it absorbs the most liquid.
**** My Notes:
- [2016-07-17 Sun] Made for Colwills, Doris and TC. Good, but /way/ too lemony... even though I used about half the zest and none of the lemon juice.
*** Yield
PREP: 15 MINUTES
COOK: 5 MINUTES
Yield: 4 Servings
** The Baker's Banana Nut Muffins
*** Ingredients
- 2 cups whole wheat pastry flour
- 1/2 cup honey
- 1 Tbsp baking powder
- 1 cup milk or apple juice
- 1 egg (beaten) or 1/4 cup apple sauce
- 1/3 cup vegetable oil
- 3/4 cup mashed bananas
- 1/2 cup chopped walnuts
- dash cinnamon and/or nutmeg
*** Method
1. Preat oven to 400. Grease a 12-cup muffin pan. Sift flour, spices
   and baking powder into a medium bowl. Make a well in the center.
2. Mix wet ingredients in a small bowl. Pour mixture into well and mix
   batter until just moistened. Fold in walnuts. Do not overmix.
3. Spoon batter into prepared muffin cups. Bake until a toothpick
   inserted in center comes out clean or until muffins are golden
   brown, about 15 minutes.
*** Credits
- (date created: 6/27/2007 4:42:12 PM)
** Yum Buns
Make-Ahead Ooey-Gooey Sticky Buns
*** Ingredients
- 1 package	dry yeast (21/4 tsp?)
- 1 teaspoon	granulated sugar
- 1/4 cup		warm water (105 degrees-115 degrees)
- 4 cups		flour
- <1 teaspoon	ground nutmeg
- 3/4 teaspoon	salt
- 1 cup		evaporated skim milk, divided
- 1/4 cup		water
- 1 large		egg, lightly beaten
- Cooking spray
- 1 1/4 c. packed	dark brown sugar, divided
- 1/3 cup		dark corn syrup
- 2 tablespoons	stick butter
- 3/4 cup chopped pecans
- 1 Tbs		ground cinnamon
*** Method
1) Dissolve yeast and 1 teaspoon granulated sugar in 1/4 cup warm water in a small bowl; let stand 5 minutes. Lightly spoon flour into dry measuring cups; level with a knife. Place 3 3/4 cups flour, 1/4 cup granulated sugar, nutmeg, and salt in a food processor; pulse 2 times or until blended. Combine 2/3 cup milk, 1/4 cup water and egg. With processor on, slowly add milk mixture and yeast mixture through food chute; process until dough forms a ball. Process for an additional minute. Turn dough out onto a lightly floured surface; knead until smooth and elastic (about 8 minutes); add enough of remaining flour, 1 tablespoon at a time to prevent dough sticking to hands.
2) Place dough in a large bowl coated with cooking spray, turning to coat top. Cover and let rise in a warm place (85 degrees), free from drafts, 45 minutes or until doubled in size. Combine 1/3 cup milk, 1 cup brown sugar, corn syrup and butter in a small saucepan; bring to a boil, sitrring constantly. Remove from heat. Divide pecans evenly between 2 (9-inch) round cake pans coated with cooking spray. Top each with half of brown sugar mixture.
3) Punch down dough; let rest 5 minutes. Roll into a 24 x 10-inch rectangle on a lightly floured surface; coat entire surface of dough with cooking spray. Combine 1/4 cup brown sugar and cinnamon in a small bowl; sprinkle evenly over dough. Beginning with a long side, roll up jelly-roll fashion; pich seam to seal (do not seal ends of rolls). Cut roll into 24 (1-inch) slices, using string or dental floss. Arrange 12 slices, cut sides up in each pan. Cover with plastic wrap coated with cooking spray, and let rise in refrigerator 8 to 24 hours or until doubled in size.
4) Preheat oven to 375 degrees.
5) Bake rolls at 375 degrees for 23 minutes. Run a  knife around outiside
   edges of pans. Place a plate upside down on top of pan; invert onto
   plate. Yield: 2 dozen (serving size: 1 bun).
- Calories: 188 (19% from fat). Fat 4g. (sat 0.5g; mono 2.1 g, poly 1g) Protein: 3.7g; Carb 35.1 g; Fiber 1g; Chol 10mg; Iron 1.5mg; Sodium 110 mg; Calc 51 mg
- Mixer Variation: Combine yeast mixture, 3 cups flour, granulated sugar, nutmeg and salt in a bowl. Add 2/3 cup milk, 1/4 cup water and egg. Beat at medium speed of a mixer until blended. Turn dough out onto a lightly floured surface; knead until smooth and elastic (about 8 minutes); add enough remaining flour, 1 tablespoon at a time, to prevent dough from sticking to hands. Proceed to step 2.
*** Credits
- Cooking Light, December 1998
- (date created: 6/27/2007 4:42:14 PM)
* Desserts
** Almond Horns
This macaroon type dough is rolled in sliced almonds for a double tasty treat!
- Time:
- 25 minutes to assemble 
- 20 minutes to chill
- 12-14 minutes to bake
*** Ingredients
- 1 box (7 oz) Odense Almond Paste, grated 
- 3/4 cup confectionary sugar 
- 1 large egg (room temperature), separated 
- 1 Tbsp & 2 tsp all purpose flour 
- 1 cup thinly sliced almonds, slightly crushed 
- 4 oz bittersweet chocolate 
- 1 Line cookie sheet with parchment or foil. 
