recipes.html
<div id="outline-container-org1c0f83c" class="outline-4">
<h4 id="org1c0f83c">Method</h4>
<div class="outline-text-4" id="text-org1c0f83c">
<ol class="org-ol">
<li>Cut a wide pocket into each slice of bread without cutting all the way through the bread.</li>
<li>In the bowl of a stand mixer fitted with the paddle attachment, beat together the cream cheese, vanilla extract, lemon juice, lemon zest and 1/2 cup diced strawberries until well combined, about 2 minutes.</li>
<li>Slather a portion of the cream cheese mixture inside each bread pocket and press each bread pocket closed.</li>
<li>In a medium bowl, whisk together the eggs, heavy cream, cinnamon and sugar.</li>
<li>Place a large pan over medium heat and add 2 tablespoons of butter. Once the butter has melted, dip each stuffed slice of toast into the egg mixture on all sides and shake off any excess. Place the bread immediately into the pan and cook until golden, about 2 minutes. Flip once and continue cooking until golden, about 2 minutes. Repeat the coating the cooking process with the remaining slices of bread. (Do not overcrowd the pan.)</li>
<li>Serve the French toast immediately topped with maple syrup and the remaining diced strawberries.</li>
</ol>
</div>
</div>
<div id="outline-container-org6d75b35" class="outline-4">
<h4 id="org6d75b35">Credits</h4>
<div class="outline-text-4" id="text-org6d75b35">
<p>
<a href="http://www.justataste.com/strawberry-cheesecake-stuffed-french-toast-recipe/">http://www.justataste.com/strawberry-cheesecake-stuffed-french-toast-recipe/</a>
</p>
</div>
<ul class="org-ul">
<li><a id="org83369e3"></a>Kelly's Note:<br />
<div class="outline-text-5" id="text-org83369e3">
<p>
Any variety of bread will work in this recipe. A few of my favorites include a loaf of sourdough, a French baguette or (extra-thick) Texas toast. Use whatever type of bread you prefer, however stale bread works best for French Toast, as it absorbs the most liquid.
</p>
</div>
</li>
<li><a id="org207fdae"></a>My Notes:<br />
<div class="outline-text-5" id="text-org207fdae">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2016-07-17 Sun] </span></span> Made for Colwills, Doris and TC. Good, but <i>way</i> too lemony&#x2026; even though I used about half the zest and none of the lemon juice.</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org260cba9" class="outline-4">
<h4 id="org260cba9">Yield</h4>
<div class="outline-text-4" id="text-org260cba9">
<p>
PREP: 15 MINUTES
COOK: 5 MINUTES
Yield: 4 Servings
</p>
</div>
</div>
</div>
<div id="outline-container-org43a2dba" class="outline-3">
<h3 id="org43a2dba">The Baker's Banana Nut Muffins</h3>
<div class="outline-text-3" id="text-org43a2dba">
</div>
<div id="outline-container-org5b38746" class="outline-4">
<h4 id="org5b38746">Ingredients</h4>
<div class="outline-text-4" id="text-org5b38746">
<ul class="org-ul">
<li>2 cups whole wheat pastry flour</li>
<li>1/2 cup honey</li>
<li>1 Tbsp baking powder</li>
<li>1 cup milk or apple juice</li>
<li>1 egg (beaten) or 1/4 cup apple sauce</li>
<li>1/3 cup vegetable oil</li>
<li>3/4 cup mashed bananas</li>
<li>1/2 cup chopped walnuts</li>
<li>dash cinnamon and/or nutmeg</li>
</ul>
</div>
</div>
<div id="outline-container-org1b5d62b" class="outline-4">
<h4 id="org1b5d62b">Method</h4>
<div class="outline-text-4" id="text-org1b5d62b">
<ol class="org-ol">
<li>Preat oven to 400. Grease a 12-cup muffin pan. Sift flour, spices
and baking powder into a medium bowl. Make a well in the center.</li>
<li>Mix wet ingredients in a small bowl. Pour mixture into well and mix
batter until just moistened. Fold in walnuts. Do not overmix.</li>
<li>Spoon batter into prepared muffin cups. Bake until a toothpick
inserted in center comes out clean or until muffins are golden
brown, about 15 minutes.</li>
</ol>
</div>
</div>
<div id="outline-container-org7c700b0" class="outline-4">
<h4 id="org7c700b0">Credits</h4>
<div class="outline-text-4" id="text-org7c700b0">
<ul class="org-ul">
<li>(date created: 6/27/2007 4:42:12 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge038e78" class="outline-3">
<h3 id="orge038e78">Yum Buns</h3>
<div class="outline-text-3" id="text-orge038e78">
<p>
Make-Ahead Ooey-Gooey Sticky Buns
</p>
</div>
<div id="outline-container-org3ab3c8e" class="outline-4">
<h4 id="org3ab3c8e">Ingredients</h4>
<div class="outline-text-4" id="text-org3ab3c8e">
<ul class="org-ul">
<li>1 package	dry yeast (21/4 tsp?)</li>
<li>1 teaspoon	granulated sugar</li>
<li>1/4 cup		warm water (105 degrees-115 degrees)</li>
<li>4 cups		flour</li>
<li>&lt;1 teaspoon	ground nutmeg</li>
<li>3/4 teaspoon	salt</li>
<li>1 cup		evaporated skim milk, divided</li>
<li>1/4 cup		water</li>
<li>1 large		egg, lightly beaten</li>
<li>Cooking spray</li>
<li>1 1/4 c. packed	dark brown sugar, divided</li>
<li>1/3 cup		dark corn syrup</li>
<li>2 tablespoons	stick butter</li>
<li>3/4 cup chopped pecans</li>
<li>1 Tbs		ground cinnamon</li>
</ul>
</div>
</div>
<div id="outline-container-orgcb9c4b9" class="outline-4">
<h4 id="orgcb9c4b9">Method</h4>
<div class="outline-text-4" id="text-orgcb9c4b9">
<ol class="org-ol">
<li>Dissolve yeast and 1 teaspoon granulated sugar in 1/4 cup warm water in a small bowl; let stand 5 minutes. Lightly spoon flour into dry measuring cups; level with a knife. Place 3 3/4 cups flour, 1/4 cup granulated sugar, nutmeg, and salt in a food processor; pulse 2 times or until blended. Combine 2/3 cup milk, 1/4 cup water and egg. With processor on, slowly add milk mixture and yeast mixture through food chute; process until dough forms a ball. Process for an additional minute. Turn dough out onto a lightly floured surface; knead until smooth and elastic (about 8 minutes); add enough of remaining flour, 1 tablespoon at a time to prevent dough sticking to hands.</li>
<li>Place dough in a large bowl coated with cooking spray, turning to coat top. Cover and let rise in a warm place (85 degrees), free from drafts, 45 minutes or until doubled in size. Combine 1/3 cup milk, 1 cup brown sugar, corn syrup and butter in a small saucepan; bring to a boil, sitrring constantly. Remove from heat. Divide pecans evenly between 2 (9-inch) round cake pans coated with cooking spray. Top each with half of brown sugar mixture.</li>
<li>Punch down dough; let rest 5 minutes. Roll into a 24 x 10-inch rectangle on a lightly floured surface; coat entire surface of dough with cooking spray. Combine 1/4 cup brown sugar and cinnamon in a small bowl; sprinkle evenly over dough. Beginning with a long side, roll up jelly-roll fashion; pich seam to seal (do not seal ends of rolls). Cut roll into 24 (1-inch) slices, using string or dental floss. Arrange 12 slices, cut sides up in each pan. Cover with plastic wrap coated with cooking spray, and let rise in refrigerator 8 to 24 hours or until doubled in size.</li>
<li>Preheat oven to 375 degrees.</li>
<li>Bake rolls at 375 degrees for 23 minutes. Run a  knife around outiside
edges of pans. Place a plate upside down on top of pan; invert onto
plate. Yield: 2 dozen (serving size: 1 bun).</li>
<li>Calories: 188 (19% from fat). Fat 4g. (sat 0.5g; mono 2.1 g, poly 1g) Protein: 3.7g; Carb 35.1 g; Fiber 1g; Chol 10mg; Iron 1.5mg; Sodium 110 mg; Calc 51 mg</li>
<li>Mixer Variation: Combine yeast mixture, 3 cups flour, granulated sugar, nutmeg and salt in a bowl. Add 2/3 cup milk, 1/4 cup water and egg. Beat at medium speed of a mixer until blended. Turn dough out onto a lightly floured surface; knead until smooth and elastic (about 8 minutes); add enough remaining flour, 1 tablespoon at a time, to prevent dough from sticking to hands. Proceed to step 2.</li>
</ol>
</div>
</div>
<div id="outline-container-org7343f4b" class="outline-4">
<h4 id="org7343f4b">Credits</h4>
<div class="outline-text-4" id="text-org7343f4b">
<ul class="org-ul">
<li>Cooking Light, December 1998</li>
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdf230de" class="outline-2">
<h2 id="orgdf230de">Desserts</h2>
<div class="outline-text-2" id="text-orgdf230de">
</div>
<div id="outline-container-orgc1644e3" class="outline-3">
<h3 id="orgc1644e3">Almond Horns</h3>
<div class="outline-text-3" id="text-orgc1644e3">
<p>
This macaroon type dough is rolled in sliced almonds for a double tasty treat!
</p>
<ul class="org-ul">
<li>Time:</li>
<li>25 minutes to assemble</li>
<li>20 minutes to chill</li>
<li>12-14 minutes to bake</li>
</ul>
</div>
<div id="outline-container-orgc41a650" class="outline-4">
<h4 id="orgc41a650">Ingredients</h4>
<div class="outline-text-4" id="text-orgc41a650">
<ul class="org-ul">
<li>1 box (7 oz) Odense Almond Paste, grated</li>
<li>3/4 cup confectionary sugar</li>
<li>1 large egg (room temperature), separated</li>
<li>1 Tbsp &amp; 2 tsp all purpose flour</li>
<li>1 cup thinly sliced almonds, slightly crushed</li>
<li>4 oz bittersweet chocolate</li>
<li>1 Line cookie sheet with parchment or foil.</li>
</ul>
</div>
</div>
