recipes.org
*** Method
1) In a food processor or with a mixer combine Almond Paste and sugar. Mix until the texture of fine crumbs. Add egg white and flour, reserving yolk. Mix until dough becomes a smooth paste, it will be slightly sticky.
2) Turn dough out onto a lightly floured surface. With floured hands roll dough into a 12 inch log. Divide into 12 equal pieces and roll into balls. Roll balls between palms into 3 inch logs, slightly tapered at ends.
3) Spread almonds on a plate. Beat reserved egg yolk with 2 tablespoons of water. Dampen log with beaten yolk. Roll each log in almonds until coated, bending into crescents. Place crescents 2 inches apart on cookie sheet and refrigerate for 20 minutes. Preheat oven to 350 F.
4) Bake 12 to 14 minutes or until light golden in color. Cool sheet on wire rack for 5 minutes, and loosen crescents with a spatula. Slide parchment off of sheet and back onto wire rack to finish cooling cookies.
5) Melt chocolate in a double boiler or microwave. Dip cookie ends into melted chocolate. Place back on parchment until chocolate is dry. Layer "Almond Horns" between sheets of wax paper in an airtight container.
*** Yield
- 12 cookies
*** Credits
- From Cathy Petrakis, 31Dec08
- (date created: 1/1/2009 12:36:08 PM)
** Apple Fritters 
*** Ingredients
- Points: 4
- Servings: 4
- Preparation Time :12 minutes
- Cooking Time: 6 minutes
- Level of Difficulty: Easy
*** Method
1. 1/2 cup all-purpose flour 
2. 2 Tbsp sugar 
3. 1/8 tsp table salt 
4. 1/2 cup fat-free egg substitute 
5. 1/4 cup fat-free skim milk 
6. 1/2 tsp vanilla extract
7. 2 pinches Apple Pie spice
8. 2 large apple(s), peeled, cored and coarsely grated (McIntosh or Granny Smith recommended) 
9. 1 Tbsp reduced-calorie margarine 
10. 1 Tbsp powdered sugar 
11. Instructions: 
12.  In a large bowl, combine flour, granulated sugar and salt; mix well. Whisk in egg substitute, milk and extract; stir in apples. 
13.  Melt margarine in a large nonstick skillet over medium-high heat. Drop apple mixture into pan, making 8 even fritters. Cook until golden brown, about 2 to 3 minutes per side. 
14.  Sift powdered sugar over top of fritters just before serving. 
*** Yields 2 fritters per serving 
*** Credits
- (date created: 2/10/2008 8:49:30 AM)
** Apple Twist Bread
*** Ingredients
**** DOUGH
- 390g King Arthur Unbleached All-Purpose Flour
- 43g potato flour OR dry instant mashed potatoes, unflavored*
- 35g granulated sugar
- 1 1/2 teaspoons instant yeast
- 1 1/4 teaspoons salt
- 43g soft butter
- 1 teaspoon vanilla extract
- 1 large egg
- 255g room-temperature or lukewarm milk
- *For an alternative, see tips, below.
**** FILLING
- 170g to 227g peeled, grated apple (283g to 340g whole apples)
- 14g lemon juice
- 99g granulated sugar
- 21g cornstarch or Instant ClearJel
- 1/8 teaspoon salt
- 1 teaspoon cinnamon
- 113g chopped walnuts or pecans, optional
**** GLAZE
- 113g confectioners' sugar
- 1 teaspoon vanilla extract
- 1/8 teaspoon salt
- 14g to 28g water OR 28g to 57g heavy cream
