recipes.html
<div id="outline-container-org050480e" class="outline-4">
<h4 id="org050480e">Method</h4>
<div class="outline-text-4" id="text-org050480e">
<ol class="org-ol">
<li>In a food processor or with a mixer combine Almond Paste and sugar. Mix until the texture of fine crumbs. Add egg white and flour, reserving yolk. Mix until dough becomes a smooth paste, it will be slightly sticky.</li>
<li>Turn dough out onto a lightly floured surface. With floured hands roll dough into a 12 inch log. Divide into 12 equal pieces and roll into balls. Roll balls between palms into 3 inch logs, slightly tapered at ends.</li>
<li>Spread almonds on a plate. Beat reserved egg yolk with 2 tablespoons of water. Dampen log with beaten yolk. Roll each log in almonds until coated, bending into crescents. Place crescents 2 inches apart on cookie sheet and refrigerate for 20 minutes. Preheat oven to 350 F.</li>
<li>Bake 12 to 14 minutes or until light golden in color. Cool sheet on wire rack for 5 minutes, and loosen crescents with a spatula. Slide parchment off of sheet and back onto wire rack to finish cooling cookies.</li>
<li>Melt chocolate in a double boiler or microwave. Dip cookie ends into melted chocolate. Place back on parchment until chocolate is dry. Layer "Almond Horns" between sheets of wax paper in an airtight container.</li>
</ol>
</div>
</div>
<div id="outline-container-orgbe553e0" class="outline-4">
<h4 id="orgbe553e0">Yield</h4>
<div class="outline-text-4" id="text-orgbe553e0">
<ul class="org-ul">
<li>12 cookies</li>
</ul>
</div>
</div>
<div id="outline-container-org907051c" class="outline-4">
<h4 id="org907051c">Credits</h4>
<div class="outline-text-4" id="text-org907051c">
<ul class="org-ul">
<li>From Cathy Petrakis, 31Dec08</li>
<li>(date created: 1/1/2009 12:36:08 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgeb68606" class="outline-3">
<h3 id="orgeb68606">Apple Fritters</h3>
<div class="outline-text-3" id="text-orgeb68606">
</div>
<div id="outline-container-org99e5caa" class="outline-4">
<h4 id="org99e5caa">Ingredients</h4>
<div class="outline-text-4" id="text-org99e5caa">
<ul class="org-ul">
<li>Points: 4</li>
<li>Servings: 4</li>
<li>Preparation Time :12 minutes</li>
<li>Cooking Time: 6 minutes</li>
<li>Level of Difficulty: Easy</li>
</ul>
</div>
</div>
<div id="outline-container-orgcf543c6" class="outline-4">
<h4 id="orgcf543c6">Method</h4>
<div class="outline-text-4" id="text-orgcf543c6">
<ol class="org-ol">
<li>1/2 cup all-purpose flour</li>
<li>2 Tbsp sugar</li>
<li>1/8 tsp table salt</li>
<li>1/2 cup fat-free egg substitute</li>
<li>1/4 cup fat-free skim milk</li>
<li>1/2 tsp vanilla extract</li>
<li>2 pinches Apple Pie spice</li>
<li>2 large apple(s), peeled, cored and coarsely grated (McIntosh or Granny Smith recommended)</li>
<li>1 Tbsp reduced-calorie margarine</li>
<li>1 Tbsp powdered sugar</li>
<li>Instructions:</li>
<li>In a large bowl, combine flour, granulated sugar and salt; mix well. Whisk in egg substitute, milk and extract; stir in apples.</li>
<li>Melt margarine in a large nonstick skillet over medium-high heat. Drop apple mixture into pan, making 8 even fritters. Cook until golden brown, about 2 to 3 minutes per side.</li>
<li>Sift powdered sugar over top of fritters just before serving.</li>
</ol>
</div>
</div>
<div id="outline-container-orgd3f865d" class="outline-4">
<h4 id="orgd3f865d">Yields 2 fritters per serving</h4>
</div>
<div id="outline-container-org884cb83" class="outline-4">
<h4 id="org884cb83">Credits</h4>
<div class="outline-text-4" id="text-org884cb83">
<ul class="org-ul">
<li>(date created: 2/10/2008 8:49:30 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8725311" class="outline-3">
<h3 id="org8725311">Apple Twist Bread</h3>
<div class="outline-text-3" id="text-org8725311">
</div>
<div id="outline-container-org8427c8f" class="outline-4">
<h4 id="org8427c8f">Ingredients</h4>
<div class="outline-text-4" id="text-org8427c8f">
</div>
<ul class="org-ul">
<li><a id="org32a508f"></a>DOUGH<br />
<div class="outline-text-5" id="text-org32a508f">
<ul class="org-ul">
<li>390g King Arthur Unbleached All-Purpose Flour</li>
<li>43g potato flour OR dry instant mashed potatoes, unflavored*</li>
<li>35g granulated sugar</li>
<li>1 1/2 teaspoons instant yeast</li>
<li>1 1/4 teaspoons salt</li>
<li>43g soft butter</li>
<li>1 teaspoon vanilla extract</li>
<li>1 large egg</li>
<li>255g room-temperature or lukewarm milk</li>
<li>*For an alternative, see tips, below.</li>
</ul>
</div>
</li>
<li><a id="orgc5f1336"></a>FILLING<br />
<div class="outline-text-5" id="text-orgc5f1336">
<ul class="org-ul">
<li>170g to 227g peeled, grated apple (283g to 340g whole apples)</li>
<li>14g lemon juice</li>
<li>99g granulated sugar</li>
<li>21g cornstarch or Instant ClearJel</li>
<li>1/8 teaspoon salt</li>
<li>1 teaspoon cinnamon</li>
<li>113g chopped walnuts or pecans, optional</li>
</ul>
</div>
</li>
<li><a id="org26f3510"></a>GLAZE<br />
<div class="outline-text-5" id="text-org26f3510">
<ul class="org-ul">
<li>113g confectioners' sugar</li>
<li>1 teaspoon vanilla extract</li>
<li>1/8 teaspoon salt</li>
<li>14g to 28g water OR 28g to 57g heavy cream</li>
</ul>
</div>
</li>
</ul>
</div>
