recipes.org
*** Method
1. To make the dough: Whisk together all of the dry ingredients, then add the butter, vanilla, egg, and milk, mixing until a shaggy dough forms. If your schedule permits, let the dough rest for 30 minutes; this resting period allows the flour to absorb the liquid fully, making it easier to knead.
2. Knead the dough - by hand, using a mixer, or in a bread machine set on the dough cycle - until it's smooth and soft, though still slightly sticky. Place the dough in a greased bowl, turning to coat. Cover the bowl, and let the dough rise until it's almost doubled in bulk, about 1 1/2 to 2 hours. The amount of time this takes will depend on the temperature of your kitchen; yeast works the fastest at about 85 degreesF, but we prefer the flavor the bread gets from a longer, cooler (about 70 degreesF) rise. If you're using a bread machine set on the dough cycle, simply allow it to complete its cycle.
3. While the dough is rising, make the filling.
4. To make the filling using cornstarch: Toss the grated apple with the lemon juice in a saucepan. Whisk together the sugar, cornstarch, salt, and cinnamon, and add to the pan, stirring to combine. Cook over low heat, stirring frequently, until the apple starts to release its juice. Increase the heat to medium, and bring to a simmer. Simmer, stirring, until the mixture thickens, 1 to 2 minutes; drawing a spatula across the bottom of the pan should leave a track that doesn't readily fill in. Remove from the heat, and set aside to cool to room temperature; if you want to hasten the process, place in the refrigerator.
5. To make the filling using Instant ClearJel: Whisk together the sugar, ClearJel, salt, and cinnamon. Toss the grated apple with the lemon juice, then add that to the sugar mixture. Mix well, and set aside.
6. To assemble the loaf: Gently deflate the risen dough and turn it out onto a lightly floured or greased work surface. Divide the dough in half. Roll the first half into a 10" x 12" rectangle. Spread half the filling over the rolled-out dough, leaving a 1/2" margin clear of filling along all sides. If adding chopped nuts, sprinkle them evenly over the filling.
7. Starting with a long side, roll the dough into a log, sealing the edge. Use a bench knife, pizza cutter, or sharp knife to cut the log in half lengthwise. Place the half-logs, filled side up, side by side on a well-greased or parchment-lined baking sheet. Keeping the filling side up, twist or "braid" the two logs together, working from the center to each end. Pinch the ends together. Repeat with the second piece of dough. Cover the twists lightly, and set them aside to rise for 1 to 2 hours; they should be puffy but not doubled in bulk. Want to make the bread ahead, then refrigerate overnight and bake the next morning? See "tips," below.
8. To bake the bread: Bake the loaves in a preheated 350 degreesF oven for 30 to 40 minutes, until they're lightly browned. Check the loaves after 20 minutes and tent with aluminum foil if they're browning too quickly. When the loaves are fully baked, a digital thermometer inserted into a loaf (be sure to position the thermometer in the bread, not the filling) should register about 190 degreesF. Remove the bread from the oven and allow it to cool for about 1 hour before glazing and serving.
9. To make the glaze: Mix together all of the glaze ingredients. Drizzle over the loaves once they're cool.
10. Store leftover bread, loosely covered, at room temperature for several days; freeze for longer storage. If you know ahead of time you're going to freeze one or both of the loaves, don't glaze; wrap completely cooled, unglazed bread tightly in plastic, and freeze for up to a month. When ready to serve, remove from the freezer, unwrap, cover loosely with plastic, and let thaw at room temperature. Glaze and serve.
*** Credits
https://www.kingarthurflour.com/recipes/cinnamon-apple-twist-bread-recipe
** Aunt Anna's Apple Cake
*** Ingredients
- 4 cups cut up apples (sprinkle with sugar, let stand)
- 1 cup sugar
- 2 cups flour
- 2 eggs, slightly beaten
- 3/4 cup oil
- 1 1/2 teaspoon baking soda
- 2 teaspoon vanilla
- 1 teaspoon salt
- 1 teaspoon cinnamon
- nuts and/or raisins
*** Method
1. Mix by hand. Grease pan.
2. Bake 350 degrees for 50 minutes.
*** Credits
- Recipe card from Kim Kane, September 2003
- (date created: 6/27/2007 4:42:13 PM)
** Banana Bread
*** Ingredients
- 1 cup all-purpose flour
- 1 cup whole wheat flour
- 1 Tbsp baking powder
- 1 tsp baking soda
- 1 tsp salt
- 1/2 cup (1 stick) butter
- 2 eggs
- 1/3 cup honey
- 1 1/4 cups mashed ripe bananas (3-4)
*** Method
1.  Preheat oven to 350 degrees F. Grease and flour a 9 x 5 x 2 1/4-inch loaf pan.
2.  In a medium bowl or on a piece of waxed paper, stir together both flours, the baking powder, baking soda and salt with a whisk.
3.  In a large bowl, cream the butter and the sugar until light and fluffy. Beat in the eggs until thoroughly combined. Beat in the honey.
4.  Beat in the banana alternately with the flour mixture. Spoon into prepared pan. Bake 50 minutes or until a wooden pick inserted in the center comes out clean. Remove from the oven an turn onto a wire rack to cool.
5. Optional: Add 1 cup chopped nuts to the batter.
*** Credits
- (date created: 6/27/2007 4:42:13 PM)
** Biscotti
*** Ingredients
- 3 cup all purpose flour
- 2 cup white granulated sugar
- 1 1/2 tsp baking powder
- salt
*** Method
1) Preheat oven to 350 degrees.
2) Combine ingredients with hands. 
3) Add 1 cup toasted whole almonds. Add 3-4 eggs (8 ounces).
4) Roll dough in sugar, bake 45-60 minutes. Take out, slice, back in oven 5-10 minutes.
**** Variations:
- Dried figs + candied lemon peel (and ground cardamom)
- Cocoa + coffee extract + choc chips
*** Credits
- 1/10/04 from Jill XXX; WHYY's A Chef's Table
- jilldisbiscotti.com(?)
- (date created: 6/27/2007 4:42:13 PM)
** Blueberry Cobbler
*** Ingredients
- 2/3 cup all-purpose flour
- 1/2 cup sugar
- 1 1/2 teasp baking powder
- 1/4 teasp salt, if desired
- 2/3 cup skim milk
- 2 Tbls butter or marg, melted
- 2 cups blueberries (clean & wash)
