recipes.html
<div id="outline-container-org0dd5159" class="outline-4">
<h4 id="org0dd5159">Method</h4>
<div class="outline-text-4" id="text-org0dd5159">
<ol class="org-ol">
<li>To make the dough: Whisk together all of the dry ingredients, then add the butter, vanilla, egg, and milk, mixing until a shaggy dough forms. If your schedule permits, let the dough rest for 30 minutes; this resting period allows the flour to absorb the liquid fully, making it easier to knead.</li>
<li>Knead the dough - by hand, using a mixer, or in a bread machine set on the dough cycle - until it's smooth and soft, though still slightly sticky. Place the dough in a greased bowl, turning to coat. Cover the bowl, and let the dough rise until it's almost doubled in bulk, about 1 1/2 to 2 hours. The amount of time this takes will depend on the temperature of your kitchen; yeast works the fastest at about 85 degreesF, but we prefer the flavor the bread gets from a longer, cooler (about 70 degreesF) rise. If you're using a bread machine set on the dough cycle, simply allow it to complete its cycle.</li>
<li>While the dough is rising, make the filling.</li>
<li>To make the filling using cornstarch: Toss the grated apple with the lemon juice in a saucepan. Whisk together the sugar, cornstarch, salt, and cinnamon, and add to the pan, stirring to combine. Cook over low heat, stirring frequently, until the apple starts to release its juice. Increase the heat to medium, and bring to a simmer. Simmer, stirring, until the mixture thickens, 1 to 2 minutes; drawing a spatula across the bottom of the pan should leave a track that doesn't readily fill in. Remove from the heat, and set aside to cool to room temperature; if you want to hasten the process, place in the refrigerator.</li>
<li>To make the filling using Instant ClearJel: Whisk together the sugar, ClearJel, salt, and cinnamon. Toss the grated apple with the lemon juice, then add that to the sugar mixture. Mix well, and set aside.</li>
<li>To assemble the loaf: Gently deflate the risen dough and turn it out onto a lightly floured or greased work surface. Divide the dough in half. Roll the first half into a 10" x 12" rectangle. Spread half the filling over the rolled-out dough, leaving a 1/2" margin clear of filling along all sides. If adding chopped nuts, sprinkle them evenly over the filling.</li>
<li>Starting with a long side, roll the dough into a log, sealing the edge. Use a bench knife, pizza cutter, or sharp knife to cut the log in half lengthwise. Place the half-logs, filled side up, side by side on a well-greased or parchment-lined baking sheet. Keeping the filling side up, twist or "braid" the two logs together, working from the center to each end. Pinch the ends together. Repeat with the second piece of dough. Cover the twists lightly, and set them aside to rise for 1 to 2 hours; they should be puffy but not doubled in bulk. Want to make the bread ahead, then refrigerate overnight and bake the next morning? See "tips," below.</li>
<li>To bake the bread: Bake the loaves in a preheated 350 degreesF oven for 30 to 40 minutes, until they're lightly browned. Check the loaves after 20 minutes and tent with aluminum foil if they're browning too quickly. When the loaves are fully baked, a digital thermometer inserted into a loaf (be sure to position the thermometer in the bread, not the filling) should register about 190 degreesF. Remove the bread from the oven and allow it to cool for about 1 hour before glazing and serving.</li>
<li>To make the glaze: Mix together all of the glaze ingredients. Drizzle over the loaves once they're cool.</li>
<li>Store leftover bread, loosely covered, at room temperature for several days; freeze for longer storage. If you know ahead of time you're going to freeze one or both of the loaves, don't glaze; wrap completely cooled, unglazed bread tightly in plastic, and freeze for up to a month. When ready to serve, remove from the freezer, unwrap, cover loosely with plastic, and let thaw at room temperature. Glaze and serve.</li>
</ol>
</div>
</div>
<div id="outline-container-org89392c3" class="outline-4">
<h4 id="org89392c3">Credits</h4>
<div class="outline-text-4" id="text-org89392c3">
<p>
<a href="https://www.kingarthurflour.com/recipes/cinnamon-apple-twist-bread-recipe">https://www.kingarthurflour.com/recipes/cinnamon-apple-twist-bread-recipe</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org4a24049" class="outline-3">
<h3 id="org4a24049">Aunt Anna's Apple Cake</h3>
<div class="outline-text-3" id="text-org4a24049">
</div>
<div id="outline-container-orgfc46410" class="outline-4">
<h4 id="orgfc46410">Ingredients</h4>
<div class="outline-text-4" id="text-orgfc46410">
<ul class="org-ul">
<li>4 cups cut up apples (sprinkle with sugar, let stand)</li>
<li>1 cup sugar</li>
<li>2 cups flour</li>
<li>2 eggs, slightly beaten</li>
<li>3/4 cup oil</li>
<li>1 1/2 teaspoon baking soda</li>
<li>2 teaspoon vanilla</li>
<li>1 teaspoon salt</li>
<li>1 teaspoon cinnamon</li>
<li>nuts and/or raisins</li>
</ul>
</div>
</div>
<div id="outline-container-org8038440" class="outline-4">
<h4 id="org8038440">Method</h4>
<div class="outline-text-4" id="text-org8038440">
<ol class="org-ol">
<li>Mix by hand. Grease pan.</li>
<li>Bake 350 degrees for 50 minutes.</li>
</ol>
</div>
</div>
<div id="outline-container-orga3146a6" class="outline-4">
<h4 id="orga3146a6">Credits</h4>
<div class="outline-text-4" id="text-orga3146a6">
<ul class="org-ul">
<li>Recipe card from Kim Kane, September 2003</li>
<li>(date created: 6/27/2007 4:42:13 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org24ac3dc" class="outline-3">
<h3 id="org24ac3dc">Banana Bread</h3>
<div class="outline-text-3" id="text-org24ac3dc">
</div>
<div id="outline-container-org8b4d7d6" class="outline-4">
<h4 id="org8b4d7d6">Ingredients</h4>
<div class="outline-text-4" id="text-org8b4d7d6">
<ul class="org-ul">
<li>1 cup all-purpose flour</li>
<li>1 cup whole wheat flour</li>
<li>1 Tbsp baking powder</li>
<li>1 tsp baking soda</li>
<li>1 tsp salt</li>
<li>1/2 cup (1 stick) butter</li>
<li>2 eggs</li>
<li>1/3 cup honey</li>
<li>1 1/4 cups mashed ripe bananas (3-4)</li>
</ul>
</div>
</div>
<div id="outline-container-org9bec754" class="outline-4">
<h4 id="org9bec754">Method</h4>
<div class="outline-text-4" id="text-org9bec754">
<ol class="org-ol">
<li>Preheat oven to 350 degrees F. Grease and flour a 9 x 5 x 2 1/4-inch loaf pan.</li>
<li>In a medium bowl or on a piece of waxed paper, stir together both flours, the baking powder, baking soda and salt with a whisk.</li>
<li>In a large bowl, cream the butter and the sugar until light and fluffy. Beat in the eggs until thoroughly combined. Beat in the honey.</li>
<li>Beat in the banana alternately with the flour mixture. Spoon into prepared pan. Bake 50 minutes or until a wooden pick inserted in the center comes out clean. Remove from the oven an turn onto a wire rack to cool.</li>
<li>Optional: Add 1 cup chopped nuts to the batter.</li>
</ol>
</div>
</div>
<div id="outline-container-org6ec9eca" class="outline-4">
<h4 id="org6ec9eca">Credits</h4>
<div class="outline-text-4" id="text-org6ec9eca">
<ul class="org-ul">
<li>(date created: 6/27/2007 4:42:13 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4110872" class="outline-3">
<h3 id="org4110872">Biscotti</h3>
<div class="outline-text-3" id="text-org4110872">
</div>
<div id="outline-container-orgabb7e87" class="outline-4">
<h4 id="orgabb7e87">Ingredients</h4>
<div class="outline-text-4" id="text-orgabb7e87">
<ul class="org-ul">
<li>3 cup all purpose flour</li>
<li>2 cup white granulated sugar</li>
<li>1 1/2 tsp baking powder</li>
<li>salt</li>
</ul>
</div>
</div>
<div id="outline-container-org281e118" class="outline-4">
<h4 id="org281e118">Method</h4>
<div class="outline-text-4" id="text-org281e118">
<ol class="org-ol">
<li>Preheat oven to 350 degrees.</li>
<li>Combine ingredients with hands.</li>
<li>Add 1 cup toasted whole almonds. Add 3-4 eggs (8 ounces).</li>
<li>Roll dough in sugar, bake 45-60 minutes. Take out, slice, back in oven 5-10 minutes.</li>
</ol>
</div>
<ul class="org-ul">
<li><a id="org8e1c1cc"></a>Variations:<br />
<div class="outline-text-5" id="text-org8e1c1cc">
<ul class="org-ul">
<li>Dried figs + candied lemon peel (and ground cardamom)</li>
<li>Cocoa + coffee extract + choc chips</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgeb3cd2f" class="outline-4">
<h4 id="orgeb3cd2f">Credits</h4>
<div class="outline-text-4" id="text-orgeb3cd2f">
<ul class="org-ul">
<li>1/10/04 from Jill XXX; WHYY's A Chef's Table</li>
<li>jilldisbiscotti.com(?)</li>
<li>(date created: 6/27/2007 4:42:13 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1331946" class="outline-3">
<h3 id="org1331946">Blueberry Cobbler</h3>
<div class="outline-text-3" id="text-org1331946">
</div>
<div id="outline-container-org1872f74" class="outline-4">
<h4 id="org1872f74">Ingredients</h4>
<div class="outline-text-4" id="text-org1872f74">
<ul class="org-ul">
<li>2/3 cup all-purpose flour</li>
<li>1/2 cup sugar</li>
<li>1 1/2 teasp baking powder</li>
<li>1/4 teasp salt, if desired</li>
<li>2/3 cup skim milk</li>
<li>2 Tbls butter or marg, melted</li>
<li>2 cups blueberries (clean &amp; wash)</li>
</ul>
</div>
</div>
