recipes.html
<div id="outline-container-org30ee778" class="outline-4">
<h4 id="org30ee778">Method</h4>
<div class="outline-text-4" id="text-org30ee778">
<ol class="org-ol">
<li>In a medium bowl, combine the flour, sugar, baking powder and salt. Stir in the milk and mix the batter until it is smooth.</li>
<li>Pour the melted butter or margarine into a 1- or 1 1/2-quart casserole-type baking dish. Pour in the batter, sprinkle the blueberries on top.</li>
<li>Bake the cobbler in a preheated 350 degrees oven for 40 to 45 minutes or until it is lightly browned. Spoon out the cobbler onto individual dishes to serve.</li>
<li>8 servings.</li>
</ol>
</div>
</div>
<div id="outline-container-org1b1f0a8" class="outline-4">
<h4 id="org1b1f0a8">Credits</h4>
<div class="outline-text-4" id="text-org1b1f0a8">
<ul class="org-ul">
<li>Jane Brody's Good Food Book: Living the High Carbohydrate Way</li>
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0f8e676" class="outline-3">
<h3 id="org0f8e676">Blueberry Hand Pies</h3>
<div class="outline-text-3" id="text-org0f8e676">
</div>
<div id="outline-container-org77e9468" class="outline-4">
<h4 id="org77e9468">Ingredients</h4>
<div class="outline-text-4" id="text-org77e9468">
<ul class="org-ul">
<li>2 cups (240g; 8 1/2 ounces) King Arthur Unbleached All-Purpose Flour</li>
<li>3/4 teaspoon salt</li>
<li>1/2 teaspoon baking powder</li>
<li>1 cup (16 tablespoons) cold unsalted butter</li>
<li>1/2 cup cold sour cream</li>
<li>2 cups blueberries, fresh or frozen</li>
<li>2 tablespoons cornstarch or 1 tablespoon Instant ClearJel (<i>For frozen berries, use 2 1/2 tablespoons cornstarch or 1 1/2 tablespoons ClearJel</i>)</li>
<li>1/3 cup sugar</li>
<li>1/8 teaspoon salt (a large pinch)</li>
<li>1 tablespoon lemon juice</li>
</ul>
</div>
</div>
<div id="outline-container-org090725d" class="outline-4">
<h4 id="org090725d">Method</h4>
<div class="outline-text-4" id="text-org090725d">
</div>
<ul class="org-ul">
<li><a id="orgf96a772"></a>The Dough<br />
<div class="outline-text-5" id="text-orgf96a772">
<ol class="org-ol">
<li>First, make the pastry. Gather the first group of ingredients.</li>
<li>Cut the cold butter into small cubes or thin pats. A baker's bench knife is ideal for this task.</li>
<li>Whisk together the flour, salt, and baking powder. Add the butter.</li>
<li>Work the butter in, but leave most of it in large, pea-sized pieces. You'll have a coarse, crumbly mixture.</li>
<li>Add the sour cream, and stir until the mixture starts to come together in chunks.</li>
<li>Turn it out onto a floured work surface and bring it together with a few quick kneads.</li>
<li>Pat the dough into a rough log. Roll it into an 8" x 10" rectangle. Dust both sides of the dough with flour, and starting with a shorter end, fold it in three like a business letter.</li>
<li>Give the dough a 90 degrees turn on your work surface, and roll it again into an 8" x 10" rectangle. Fold it in three again.</li>
<li>Wrap the dough in plastic wrap or waxed paper. Chill for at least 30 minutes before using.</li>
</ol>
</div>
</li>
<li><a id="orgccecb7b"></a>The Filling<br />
<div class="outline-text-5" id="text-orgccecb7b">
<ol class="org-ol">
<li>If you're using fresh berries, rinse and drain well. Place fresh or frozen berries in a saucepan. Whisk the cornstarch or ClearJel with the sugar, and pour over the berries. Add the salt and lemon juice, stirring to combine.</li>
<li>Place the saucepan on a burner set to medium-high heat and cook, stirring, until the small amount of liquid in the bottom of the pan comes to a simmer. Reduce the heat to medium and continue to cook, stirring frequently, until the mixture starts to thicken, about 5 minutes.</li>
<li>Transfer the cooked berries to a bowl and let cool to room temperature. It's fine to make the filling ahead of time, and refrigerate until you're ready to use it.</li>
</ol>
</div>
</li>
<li><a id="org98ecf9c"></a>Putting Everything Together<br />
<div class="outline-text-5" id="text-org98ecf9c">
<ol class="org-ol">
<li>Preheat the oven to 425 degreesF; place a rack on the middle shelf. Line a baking sheet with parchment paper.</li>
<li>Roll the dough into a 14" x 14" square. With a straight edge and pastry wheel, or a 3 1/2" square cutter, cut out sixteen 3 1/2" squares.</li>
<li>Divide the filling among eight of the squares, using about a heaping tablespoon for each; a slightly heaped tablespoon cookie scoop works well here.</li>
<li>Whisk 1 large egg until frothy. Brush some of the beaten egg along the edges of each filled square.</li>
<li>Use a knife to cut a vent into each of the remaining eight squares; or use a decorative cutter of your choice.</li>
<li>Top each filled square with a vented square, and press along the edges with the tines of a fork to seal.</li>
<li>Note: If at any time during assembly the pies become sticky and hard to work with, simply refrigerate them for about 20 minutes, until firm.   <i>Strongly recommended!</i></li>
<li>Brush the top of each pie with the remaining beaten egg and sprinkle with sparkling sugar. The sugar's a nice touch: it adds both flavor and crunch.</li>
<li>Bake the pies for 18 to 20 minutes, until they're a light golden brown. Remove them from the oven.</li>
<li>Let the pies cool for 20 minutes before serving.</li>
<li>Store pies, lightly wrapped, at room temperature for a couple of days; freeze for longer storage (if they last that long!).</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgb8d3152" class="outline-4">
<h4 id="orgb8d3152">Credits</h4>
<div class="outline-text-4" id="text-orgb8d3152">
<ul class="org-ul">
<li>courtesy of Nancy Burnett <span class="timestamp-wrapper"><span class="timestamp">[2017-07-15 Sat]</span></span></li>
<li>From Blueberry Hand Pies Bakealong: challenge #12</li>
<li><a href="http://blog.kingarthurflour.com/2017/07/03/blueberry-hand-pies-bakealong/">http://blog.kingarthurflour.com/2017/07/03/blueberry-hand-pies-bakealong/</a></li>
<li>Also see <a href="https://docs.google.com/document/d/1k7ZZ-iRT1OjR1yYY2pCiqD6T9xaX6Nr9UzoDJFvCysE/edit#heading=h.gjdgxs">email</a>.</li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2017-08-05 Sat]</span></span>
<ul class="org-ul">
<li>Made them for T's breakfast.</li>
<li>The pastry was light and flaky if a wee bit greasy.</li>
<li>I used a heart-shaped cookie cutter for the vent and simply offset the cut-out onto the pastry.</li>
<li>Half of the pies looked really good.</li>
<li>The others: not so much.</li>
<li>The problem was in the final (14x14) rolling: the middle was a bit thick (not much of a problem) but the extremities were very thin and not quite square. This made pulling up those square difficult.</li>
<li>After rolling I did pop them in the refrigerator for ~20 minutes which helped a heck of a lot.</li>
</ul></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2017-11-11 Sat]</span></span>
<ul class="org-ul">
<li><b>DO NOT USE WAX PAPER UNDER THE PIES!</b> (They stick!)</li>
<li>I used 4 cups of strawberries, which made me go wild with filling. I think I filled some way too much. Not a help!</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7af5839" class="outline-3">
<h3 id="org7af5839">Bread Pudding</h3>
<div class="outline-text-3" id="text-org7af5839">
</div>
<div id="outline-container-org8281f2d" class="outline-4">
<h4 id="org8281f2d">Ingredients</h4>
<div class="outline-text-4" id="text-org8281f2d">
<ul class="org-ul">
<li>2 eggs</li>
<li>2 cups hot milk</li>
<li>1/2 cup brown sugar</li>
<li>1/4 teasp salt</li>
<li>1/2 teasp cinnamon</li>
<li>1/2 teasp vanilla</li>
<li>1/2 cup raisins</li>
<li>1 Tblspn butter</li>
<li>3 slices bread, cubed</li>
</ul>
</div>
</div>
<div id="outline-container-org8bc1fcd" class="outline-4">
<h4 id="org8bc1fcd">Method</h4>
<div class="outline-text-4" id="text-org8bc1fcd">
<ol class="org-ol">
<li>Heat oven to 375 degrees.</li>
<li>In a large bowl, beat eggs. Mix in milk,sugar,salt, cinnamon, vanilla and raisins.</li>
<li>Melt butter and spread around casserole. Add cubed bread. Pour liquid mixture over bread. Bake until brown, at least 40 minutes.</li>
</ol>
</div>
</div>
<div id="outline-container-org37af14c" class="outline-4">
<h4 id="org37af14c">Credits</h4>
<div class="outline-text-4" id="text-org37af14c">
<ul class="org-ul">
<li>Recipe from Edith Heimburg</li>
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org867ef45" class="outline-3">
<h3 id="org867ef45">Chocolate Chip Cookies</h3>
<div class="outline-text-3" id="text-org867ef45">
</div>
<div id="outline-container-org46db2c1" class="outline-4">
<h4 id="org46db2c1">Ingredients</h4>
<div class="outline-text-4" id="text-org46db2c1">
<ul class="org-ul">
<li>1 cup unbleached flour (I use King Arthur - organic if I can find it)</li>
<li>1 cup King Arthur white or regular whole wheat flour</li>
<li>1/2 cup quick cooking oatmeal (uncooked) I use what I have on hand, not necessarily quick cooking.</li>
<li>1 tsp. baking soda</li>
<li>1 tsp. coarse salt</li>
<li>1 cup unsalted butter, softened</li>
<li>3/4 cup white sugar</li>
<li>3/4 cup brown sugar</li>
<li>2 tsp. vanilla extract</li>
<li>1 egg</li>
<li>1 lb premium quality bittersweet chocolate (see note below) cut into medium-sized chunks.</li>
<li>2 cups walnuts, coarsely chopped (the Supreme Cookie Dude aka Pat, likes big chunks of nuts and lots of!)</li>
</ul>
</div>
</div>
