recipes.org
*** Method
1. About the chocolate: I do not use chocolate chips because IMHO the better the chocolate, the better the cookie.
2. If I can't afford the really good stuff I don't make these. I like to use Valhrona bittersweet chocolate that comes
3. in thin bars (not sure of the weight but the bars are around 6" by 3" and maybe  1/2" deep -- I use several) so that
4. the chocolate is sort of in layers in the cookie. Scharffen Berger, Green and Black's dark baking, and Callebaut
5. all work well. The best buy is from Trader Joe's though (sorry, Jen!!!) and it's their 1 lb. Plus bars which are
6. actually made by Callebaut. I use either the 72% (especially if making these cookies for adults) or the Dark
7. Chocolate (which is closer to semi-sweet and better for kids). But they also have the best price around on
8. Valhrona too.
9. In a medium bowl, whisk together flour, oats, baking soda, and salt. In a large mixing bowl, cream together
10. butter and sugars. Blend in vanilla and egg. Slowly add in the flour mixture until nearly combined. Add in
11. chocolate chips and nuts and stir by in by hand (this is normally Pat's job). It may seem like the dough won't
12. handle all the chocolate and nuts but it does. Drop by rounded tablespoonfuls onto baking sheets (I use one of
13. those cool cookie scoops that has the releasing mechanism) - you can put them very close together. Refrigerate
14. for 24 hours or longer (or freeze) then I take out only what I need for one pan at a time and bake on sheets.
15. These are great to have in the freezer to bake at a moment's notice - do not thaw or allow to come to room temp
16. before baking.
17. Line baking sheets with parchment paper or use silpat sheets and preheat over to 350o. Bake one sheet at a
18. time for 7 minutes, then turn sheets around 180o and bake for another 6 minutes until lightly browned. (Your
19. oven may run hotter or colder than mine but this it what works in mine). Remove pan from the oven but leave
20. cookies on the paper and slip the paper onto a wire rack to cool. Since there's so much chocolate in these and
21. it's in big pieces, if you take the cookies off the paper the chocolate will drip while it's still hot.
*** Yield Makes 48 cookies.
*** Credits
- The Obsessive Compulsive Version
- (that I should be embarrassed about except for the fact that they are so darned good!)
- Nancy Burnett, November 2010
- Shared 26-April-2012. NOT FOR REDISTRIBUTION!
- (date created: 4/26/2012 10:23:42 AM)
** Chocolate Cream Pie
*** Ingredients
**** Crust
- 181g King Arthur Unbleached All-Purpose Flour
- 1/2 teaspoon salt
- 46g vegetable shortening
- 57g (1/2 stick) cold unsalted butter
- 28 to 57g ice water
**** Filling
- 28g unsalted butter
- 227g semisweet chocolate, chopped
- 1 teaspoon vanilla extract
- 131g granulated sugar
- 3 tablespoons cornstarch
- 11g unsweetened cocoa powder
- 1 teaspoon espresso powder, optional; for richer chocolate flavor
- 1/8 teaspoon salt
- 3 large egg yolks
- 227g heavy cream, divided
- 454g milk
**** Topping
- 227g heavy cream
- 28g confectioners' sugar
- 1/2 teaspoon vanilla extract
*** Method
**** Crust
1. In a medium bowl, whisk together the flour, and salt.
2. Cut in the shortening until it's in lumps the size of small peas.
3. Dice the butter into 1/2" pieces, and cut into the mixture until you have flakes of butter the size of your fingernail.
4. Add the water, two tablespoons at a time, mixing with a fork as you sprinkle the water into the dough.
5. When the dough is moist enough to hold together when you squeeze it, transfer it to a piece of wax or parchment paper. It's ok if there are dry spots in the pile. Use a spray bottle of water to lightly spritz these places; that way you'll add just enough water to bring the dough together without adding too much or creating a wet spot.
6. Fold it over on itself three or four times to bring it together, then pat it into a disk 3/4" thick
7. Roll the disk on its edge, like a wheel, to smooth out the edges. This step will ensure your dough will roll out evenly, without a lot of cracks and splits at the edges later. Wrap in plastic and refrigerate for 30 minutes before rolling.
8. To blind bake the crust: Preheat the oven to 400 degreesF. Lightly grease a 9" pie pan that's at least 2" deep. This will make serving the pie easier after it's finished.
9. Roll out the pastry for the pie to a 13" circle. Transfer it to the prepared pan, and trim the edges so they overlap the edge by an inch all the way around. Tuck the edges up and under, and flute them. Put the lined pie pan in the refrigerator to chill for 10 minutes.
10. Line the crust with foil or parchment paper, and fill it with pie weights or dried beans. Bake the crust for 20 minutes. Remove it from the oven, and gently remove foil or parchment with the weights or beans. Return the crust to the oven for 10 to 20 more minutes, until it's golden brown all over. If the edges of the crust start becoming too brown, cover them with a pie shield, or strips of aluminum foil. Remove the crust from the oven and cool completely.
**** Filling
1. Place the chopped chocolate, butter, and vanilla extract in a 2-quart mixing bowl; set aside.
2. In a medium saucepan away from heat, whisk together the sugar, cornstarch, cocoa, espresso powder, and salt. Whisk in 1/4 cup of cold heavy cream until the mixture is smooth, with no lumps. Repeat with another 1/4 cup of the cream. Whisk in the egg yolks.
3. Place the saucepan over medium heat, and gradually whisk in the remaining cream and milk.
4. Bring to a boil, whisking constantly as the mixture thickens; boil for 1 minute.
5. Remove the pan from the heat and pour the mixture over the reserved chocolate and butter.
6. Whisk until the chocolate is melted and the mixture is smooth.
7. (optionally) Pass the filling through a strainer into a bowl to remove any lumps.
8. Place plastic wrap or buttered parchment paper on the surface to prevent a skin from forming, and chill thoroughly.
**** Topping
1. Place the heavy cream in a chilled mixing bowl.
2. Whip until the whisk begins to leave tracks in the bowl.
3. Add the sugar and vanilla and whip until the cream holds a medium peak.
4. Assembly
5. Transfer the cooled filling to the cooled, baked pie crust. Level the top with the back of a spoon or an offset spatula.
6. Spoon or pipe the whipped cream on top.
7. Chill the pie until ready to serve. Note: If you're not planning on serving the entire pie at once, top individual slices with a dollop of whipped cream just before serving.
***** Variation: Meringue topping
****** Ingredients
- 3 large egg whites (reserved from filling)
- pinch of salt
- 1/2 cup (3 1/2 ounces) sugar
- 3 tablespoons (1 1/2 ounces) water
