recipes.html
<div id="outline-container-org14756fe" class="outline-4">
<h4 id="org14756fe">Method</h4>
<div class="outline-text-4" id="text-org14756fe">
<ol class="org-ol">
<li>About the chocolate: I do not use chocolate chips because IMHO the better the chocolate, the better the cookie.</li>
<li>If I can't afford the really good stuff I don't make these. I like to use Valhrona bittersweet chocolate that comes</li>
<li>in thin bars (not sure of the weight but the bars are around 6" by 3" and maybe  1/2" deep &#x2013; I use several) so that</li>
<li>the chocolate is sort of in layers in the cookie. Scharffen Berger, Green and Black's dark baking, and Callebaut</li>
<li>all work well. The best buy is from Trader Joe's though (sorry, Jen!!!) and it's their 1 lb. Plus bars which are</li>
<li>actually made by Callebaut. I use either the 72% (especially if making these cookies for adults) or the Dark</li>
<li>Chocolate (which is closer to semi-sweet and better for kids). But they also have the best price around on</li>
<li>Valhrona too.</li>
<li>In a medium bowl, whisk together flour, oats, baking soda, and salt. In a large mixing bowl, cream together</li>
<li>butter and sugars. Blend in vanilla and egg. Slowly add in the flour mixture until nearly combined. Add in</li>
<li>chocolate chips and nuts and stir by in by hand (this is normally Pat's job). It may seem like the dough won't</li>
<li>handle all the chocolate and nuts but it does. Drop by rounded tablespoonfuls onto baking sheets (I use one of</li>
<li>those cool cookie scoops that has the releasing mechanism) - you can put them very close together. Refrigerate</li>
<li>for 24 hours or longer (or freeze) then I take out only what I need for one pan at a time and bake on sheets.</li>
<li>These are great to have in the freezer to bake at a moment's notice - do not thaw or allow to come to room temp</li>
<li>before baking.</li>
<li>Line baking sheets with parchment paper or use silpat sheets and preheat over to 350o. Bake one sheet at a</li>
<li>time for 7 minutes, then turn sheets around 180o and bake for another 6 minutes until lightly browned. (Your</li>
<li>oven may run hotter or colder than mine but this it what works in mine). Remove pan from the oven but leave</li>
<li>cookies on the paper and slip the paper onto a wire rack to cool. Since there's so much chocolate in these and</li>
<li>it's in big pieces, if you take the cookies off the paper the chocolate will drip while it's still hot.</li>
</ol>
</div>
</div>
<div id="outline-container-org41356a0" class="outline-4">
<h4 id="org41356a0">Yield Makes 48 cookies.</h4>
</div>
<div id="outline-container-org0e67801" class="outline-4">
<h4 id="org0e67801">Credits</h4>
<div class="outline-text-4" id="text-org0e67801">
<ul class="org-ul">
<li>The Obsessive Compulsive Version</li>
<li>(that I should be embarrassed about except for the fact that they are so darned good!)</li>
<li>Nancy Burnett, November 2010</li>
<li>Shared 26-April-2012. NOT FOR REDISTRIBUTION!</li>
<li>(date created: 4/26/2012 10:23:42 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbadd18f" class="outline-3">
<h3 id="orgbadd18f">Chocolate Cream Pie</h3>
<div class="outline-text-3" id="text-orgbadd18f">
</div>
<div id="outline-container-org3f72945" class="outline-4">
<h4 id="org3f72945">Ingredients</h4>
<div class="outline-text-4" id="text-org3f72945">
</div>
<ul class="org-ul">
<li><a id="orgc407fc2"></a>Crust<br />
<div class="outline-text-5" id="text-orgc407fc2">
<ul class="org-ul">
<li>181g King Arthur Unbleached All-Purpose Flour</li>
<li>1/2 teaspoon salt</li>
<li>46g vegetable shortening</li>
<li>57g (1/2 stick) cold unsalted butter</li>
<li>28 to 57g ice water</li>
</ul>
</div>
</li>
<li><a id="orge7570a8"></a>Filling<br />
<div class="outline-text-5" id="text-orge7570a8">
<ul class="org-ul">
<li>28g unsalted butter</li>
<li>227g semisweet chocolate, chopped</li>
<li>1 teaspoon vanilla extract</li>
<li>131g granulated sugar</li>
<li>3 tablespoons cornstarch</li>
<li>11g unsweetened cocoa powder</li>
<li>1 teaspoon espresso powder, optional; for richer chocolate flavor</li>
<li>1/8 teaspoon salt</li>
<li>3 large egg yolks</li>
<li>227g heavy cream, divided</li>
<li>454g milk</li>
</ul>
</div>
</li>
<li><a id="orgce56773"></a>Topping<br />
<div class="outline-text-5" id="text-orgce56773">
<ul class="org-ul">
<li>227g heavy cream</li>
<li>28g confectioners' sugar</li>
<li>1/2 teaspoon vanilla extract</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orga820e47" class="outline-4">
<h4 id="orga820e47">Method</h4>
<div class="outline-text-4" id="text-orga820e47">
</div>
<ul class="org-ul">
<li><a id="orgada70ce"></a>Crust<br />
<div class="outline-text-5" id="text-orgada70ce">
<ol class="org-ol">
<li>In a medium bowl, whisk together the flour, and salt.</li>
<li>Cut in the shortening until it's in lumps the size of small peas.</li>
<li>Dice the butter into 1/2" pieces, and cut into the mixture until you have flakes of butter the size of your fingernail.</li>
<li>Add the water, two tablespoons at a time, mixing with a fork as you sprinkle the water into the dough.</li>
<li>When the dough is moist enough to hold together when you squeeze it, transfer it to a piece of wax or parchment paper. It's ok if there are dry spots in the pile. Use a spray bottle of water to lightly spritz these places; that way you'll add just enough water to bring the dough together without adding too much or creating a wet spot.</li>
<li>Fold it over on itself three or four times to bring it together, then pat it into a disk 3/4" thick</li>
<li>Roll the disk on its edge, like a wheel, to smooth out the edges. This step will ensure your dough will roll out evenly, without a lot of cracks and splits at the edges later. Wrap in plastic and refrigerate for 30 minutes before rolling.</li>
<li>To blind bake the crust: Preheat the oven to 400 degreesF. Lightly grease a 9" pie pan that's at least 2" deep. This will make serving the pie easier after it's finished.</li>
<li>Roll out the pastry for the pie to a 13" circle. Transfer it to the prepared pan, and trim the edges so they overlap the edge by an inch all the way around. Tuck the edges up and under, and flute them. Put the lined pie pan in the refrigerator to chill for 10 minutes.</li>
<li>Line the crust with foil or parchment paper, and fill it with pie weights or dried beans. Bake the crust for 20 minutes. Remove it from the oven, and gently remove foil or parchment with the weights or beans. Return the crust to the oven for 10 to 20 more minutes, until it's golden brown all over. If the edges of the crust start becoming too brown, cover them with a pie shield, or strips of aluminum foil. Remove the crust from the oven and cool completely.</li>
</ol>
</div>
</li>
<li><a id="org3840155"></a>Filling<br />
<div class="outline-text-5" id="text-org3840155">
<ol class="org-ol">
<li>Place the chopped chocolate, butter, and vanilla extract in a 2-quart mixing bowl; set aside.</li>
<li>In a medium saucepan away from heat, whisk together the sugar, cornstarch, cocoa, espresso powder, and salt. Whisk in 1/4 cup of cold heavy cream until the mixture is smooth, with no lumps. Repeat with another 1/4 cup of the cream. Whisk in the egg yolks.</li>
<li>Place the saucepan over medium heat, and gradually whisk in the remaining cream and milk.</li>
<li>Bring to a boil, whisking constantly as the mixture thickens; boil for 1 minute.</li>
<li>Remove the pan from the heat and pour the mixture over the reserved chocolate and butter.</li>
<li>Whisk until the chocolate is melted and the mixture is smooth.</li>
<li>(optionally) Pass the filling through a strainer into a bowl to remove any lumps.</li>
<li>Place plastic wrap or buttered parchment paper on the surface to prevent a skin from forming, and chill thoroughly.</li>
</ol>
</div>
</li>
<li><a id="org5ee3065"></a>Topping<br />
<div class="outline-text-5" id="text-org5ee3065">
<ol class="org-ol">
<li>Place the heavy cream in a chilled mixing bowl.</li>
<li>Whip until the whisk begins to leave tracks in the bowl.</li>
<li>Add the sugar and vanilla and whip until the cream holds a medium peak.</li>
<li>Assembly</li>
<li>Transfer the cooled filling to the cooled, baked pie crust. Level the top with the back of a spoon or an offset spatula.</li>
<li>Spoon or pipe the whipped cream on top.</li>
<li>Chill the pie until ready to serve. Note: If you're not planning on serving the entire pie at once, top individual slices with a dollop of whipped cream just before serving.</li>
</ol>
</div>
<ul class="org-ul">
<li><a id="orge202c6d"></a>Variation: Meringue topping<br />
<ul class="org-ul">
<li><a id="orgd4a5c78"></a>Ingredients<br />
<div class="outline-text-7" id="text-orgd4a5c78">
<ul class="org-ul">
<li>3 large egg whites (reserved from filling)</li>
<li>pinch of salt</li>
<li>1/2 cup (3 1/2 ounces) sugar</li>
<li>3 tablespoons (1 1/2 ounces) water</li>
</ul>
</div>
</li>
