recipes.org
****** Method
1. Place the egg whites in a clean bowl with clean beaters. Add the pinch of salt.
2. In a small saucepan, bring the sugar and water to a boil, stirring occasionally, until the sugar dissolves. Boil for 2 minutes, then remove from the heat.
3. Whip the egg whites until they turn white and the whisk begins to leave tracks in the bowl. Slowly add the hot sugar syrup, and continue beating until the whites make stiff peaks.
4. Preheat the oven to 400 degreesF.
5. Pipe or spoon the meringue over the top of the filled, chilled pie, making sure you cover the filling completely.
6. Place the pie in the oven for 5 to 7 minutes, until the top of the meringue is golden brown. Remove from the oven and refrigerate until ready to serve
*** Credits
http://www.kingarthurflour.com/recipes/chocolate-cream-pie-recipe
*** Notes
**** <2016-02-28 Sun> 
Made at T's request. Good pie, but the crust was a bit hard/tough. Overworked and over cooked? 
Pudding was good. I used well-ground coffee beans and didn't strain it.
** Chocolate Truffle Cookies
*** Ingredients
- 4 squares (1 oz. each) unsweetened chocolate
- 2 cups (12 oz.) semi-sweet chocolate chips, divided
- 1/3 cup butter
- 1 cup sugar
- 3 eggs
- 1 1/2 teaspoons vanilla extract
- 1/2 cup all-purpose flour
- 2 tablespoons baking cocoa
- 1/4 teaspoon baking powder
- 1/4teaspoon salt
- Confectioners Sugar
*** Method
1. In a microwave or double boiler, melt unsweetened chocolate, 1 cup of chocolate chips and butter. Cool for 10 minutes.
2. In a mixing bowl, beat sugar and eggs for 2 minutes until well blended. Beat in vanilla and the chocolate mixture. Mix in flour, cocoa and baking powder. Stir in remaining chocolate chips.
3. Cover and chll for at least 3 hours.
4. Prehat oven to 350 degrees. With lightly floured hands, roll into 1-inch balls. Place on ungreased cookie sheets. Bake at 350 degrees for 10-12 minutes or until lightly puffed and set. Cool on pan 3-4 minutes before removing to wire rack to cool completely. Dust with confectioners sugar.
*** Yield About 4 dozen.
*** Credits
- (date created: 6/27/2007 4:42:14 PM)
** Chocolate Zucchini Cake
*** Ingredients
- (date created: 8/18/2007 6:15:27 PM)
*** Credits
** Classic Pie Crust (King Arthur)
*** Ingredients
**** 2 Crusts
- 297g (2 1/2 cups) King Arthur Unbleached All-Purpose Flour or 283g King Arthur Perfect Pastry Blend
- 1 1/4 teaspoons salt*
- 46g (1/4 cup) vegetable shortening
- 142g (10 tablespoons) very cold unsalted butter
- 85g to 142g (6 to 10 tablespoons) ice water**
**** 1 Crust
- 148.5g (1 1/4 cups) King Arthur Unbleached All-Purpose Flour or 141.5g King Arthur Perfect Pastry Blend
- 3/8 teaspoons salt*
- 23g (1/8 cup) vegetable shortening
- 71g (5 tablespoons) very cold unsalted butter
- 42.5g to 71g (3 to 5 tablespoons) ice water**
**** Notes
**Reduce the salt to 1 teaspoon (1/2 teaspoon for single crust) if you use salted butter.
***Use the lesser amount of water if you use Perfect Pastry Blend.
*** Method
1. Whisk together the flour and salt.
2. Add the shortening, working it in until the mixture is evenly crumbly.
3. Cut the butter into small (about ½") cubes.
4. Add the butter to the flour mixture, and work it in roughly with your fingers, a pastry cutter, or a mixer. Don't be too thorough; the mixture should be very uneven, with big chunks of butter in among the smaller ones.
5. Add 4 (or 2 for single crust) tablespoons of water, and toss to combine.
6. Toss with enough additional water to make a chunky, fairly cohesive mixture. It should hold together when you gather it up and squeeze it in your hand.
7. Divide the dough in half, and gather each half into a rough disk. Smooth the disks; it's OK if they have a few cracks in the surface. Smooth the disks' edges by running them along a floured surface like a wheel.
8. Wrap in plastic, and chill for 30 minutes, or up to overnight. Or wrap in aluminum foil over the plastic, and freeze for up to 2 months.
9. When you're ready to make pie, remove the crust from the refrigerator or freezer, leaving it wrapped. Allow it to thaw (if it's frozen) or warm a bit (if it's been chilled longer than 30 minutes), until it's softened enough to roll, but still feels cold to the touch.
10. Next, measure the bottom diameter, and up the sides of your pie pan. If your pan is 7" across the bottom, and 1 ½" up each side, that's a total of 10". This means you should roll your bottom crust to a diameter between 11" and 12", which gives you enough extra for crimping the edges.
11. Place the crust on a floured work surface; our silicone rolling mat is a fine choice. Roll it to the desired width. See the big chunks of butter? That's a good thing.
12. Place the crust in the pan by folding in quarters and placing in the pan. Or you can simply pick it up with a piecrust lifter, and move it that way.
13. For a single-crust pie, fold the edges of the crust under, and gently squeeze them together. Crimp as desired. It's nice to make a tall crimp, as the filling for a single-crust pie is usually fairly liquid (think pumpkin or custard), and it's good to have that tall "dam."
14. For a double-crust pie, leave the edges of the bottom crust as is (no folding or crimping). Once you've added the pie filling, roll out the top crust to the outside diameter of your pan, and place it atop the filling.
15. Trim excess crust with a pair of scissors, then press the two edges together.
16. Crimp as desired. A simple fork crimp is fast and easy. At this point, it helps to return the pie to the refrigerator for 20 to 30 minutes; this chills the fat, which ultimately increases the crust's flakiness.
17. Cut a hole in the center of the crust for steam to escape. Or slash the pie's top surface several times.
18. Brush with milk and sprinkle with coarse sparkling sugar, if desired.
19. Bake... enjoy!
*** Yield
2 pie crusts
*** Credits
http://www.kingarthurflour.com/recipes/classic-double-pie-crust-recipe
** Classic Single Pie Dough
