recipes.html
<li><a id="org81c55be"></a>Method<br />
<div class="outline-text-7" id="text-org81c55be">
<ol class="org-ol">
<li>Place the egg whites in a clean bowl with clean beaters. Add the pinch of salt.</li>
<li>In a small saucepan, bring the sugar and water to a boil, stirring occasionally, until the sugar dissolves. Boil for 2 minutes, then remove from the heat.</li>
<li>Whip the egg whites until they turn white and the whisk begins to leave tracks in the bowl. Slowly add the hot sugar syrup, and continue beating until the whites make stiff peaks.</li>
<li>Preheat the oven to 400 degreesF.</li>
<li>Pipe or spoon the meringue over the top of the filled, chilled pie, making sure you cover the filling completely.</li>
<li>Place the pie in the oven for 5 to 7 minutes, until the top of the meringue is golden brown. Remove from the oven and refrigerate until ready to serve</li>
</ol>
</div>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org44adc3d" class="outline-4">
<h4 id="org44adc3d">Credits</h4>
<div class="outline-text-4" id="text-org44adc3d">
<p>
<a href="http://www.kingarthurflour.com/recipes/chocolate-cream-pie-recipe">http://www.kingarthurflour.com/recipes/chocolate-cream-pie-recipe</a>
</p>
</div>
</div>
<div id="outline-container-org68c13be" class="outline-4">
<h4 id="org68c13be">Notes</h4>
<div class="outline-text-4" id="text-org68c13be">
</div>
<ul class="org-ul">
<li><a id="org5f7e51c"></a><span class="timestamp-wrapper"><span class="timestamp">2016-02-28 Sun</span></span><br />
<div class="outline-text-5" id="text-org5f7e51c">
<p>
Made at T's request. Good pie, but the crust was a bit hard/tough. Overworked and over cooked? 
Pudding was good. I used well-ground coffee beans and didn't strain it.
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb72a5a6" class="outline-3">
<h3 id="orgb72a5a6">Chocolate Truffle Cookies</h3>
<div class="outline-text-3" id="text-orgb72a5a6">
</div>
<div id="outline-container-org3463f42" class="outline-4">
<h4 id="org3463f42">Ingredients</h4>
<div class="outline-text-4" id="text-org3463f42">
<ul class="org-ul">
<li>4 squares (1 oz. each) unsweetened chocolate</li>
<li>2 cups (12 oz.) semi-sweet chocolate chips, divided</li>
<li>1/3 cup butter</li>
<li>1 cup sugar</li>
<li>3 eggs</li>
<li>1 1/2 teaspoons vanilla extract</li>
<li>1/2 cup all-purpose flour</li>
<li>2 tablespoons baking cocoa</li>
<li>1/4 teaspoon baking powder</li>
<li>1/4teaspoon salt</li>
<li>Confectioners Sugar</li>
</ul>
</div>
</div>
<div id="outline-container-org047cd02" class="outline-4">
<h4 id="org047cd02">Method</h4>
<div class="outline-text-4" id="text-org047cd02">
<ol class="org-ol">
<li>In a microwave or double boiler, melt unsweetened chocolate, 1 cup of chocolate chips and butter. Cool for 10 minutes.</li>
<li>In a mixing bowl, beat sugar and eggs for 2 minutes until well blended. Beat in vanilla and the chocolate mixture. Mix in flour, cocoa and baking powder. Stir in remaining chocolate chips.</li>
<li>Cover and chll for at least 3 hours.</li>
<li>Prehat oven to 350 degrees. With lightly floured hands, roll into 1-inch balls. Place on ungreased cookie sheets. Bake at 350 degrees for 10-12 minutes or until lightly puffed and set. Cool on pan 3-4 minutes before removing to wire rack to cool completely. Dust with confectioners sugar.</li>
</ol>
</div>
</div>
<div id="outline-container-org275f973" class="outline-4">
<h4 id="org275f973">Yield About 4 dozen.</h4>
</div>
<div id="outline-container-orgd2f4c9d" class="outline-4">
<h4 id="orgd2f4c9d">Credits</h4>
<div class="outline-text-4" id="text-orgd2f4c9d">
<ul class="org-ul">
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org012b720" class="outline-3">
<h3 id="org012b720">Chocolate Zucchini Cake</h3>
<div class="outline-text-3" id="text-org012b720">
</div>
<div id="outline-container-org117dd43" class="outline-4">
<h4 id="org117dd43">Ingredients</h4>
<div class="outline-text-4" id="text-org117dd43">
<ul class="org-ul">
<li>(date created: 8/18/2007 6:15:27 PM)</li>
</ul>
</div>
</div>
<div id="outline-container-org81e0577" class="outline-4">
<h4 id="org81e0577">Credits</h4>
</div>
</div>
<div id="outline-container-org006209c" class="outline-3">
<h3 id="org006209c">Classic Pie Crust (King Arthur)</h3>
<div class="outline-text-3" id="text-org006209c">
</div>
<div id="outline-container-org9113e57" class="outline-4">
<h4 id="org9113e57">Ingredients</h4>
<div class="outline-text-4" id="text-org9113e57">
</div>
<ul class="org-ul">
<li><a id="org109884d"></a>2 Crusts<br />
<div class="outline-text-5" id="text-org109884d">
<ul class="org-ul">
<li>297g (2 1/2 cups) King Arthur Unbleached All-Purpose Flour or 283g King Arthur Perfect Pastry Blend</li>
<li>1 1/4 teaspoons salt*</li>
<li>46g (1/4 cup) vegetable shortening</li>
<li>142g (10 tablespoons) very cold unsalted butter</li>
<li>85g to 142g (6 to 10 tablespoons) ice water**</li>
</ul>
</div>
</li>
<li><a id="org1e45628"></a>1 Crust<br />
<div class="outline-text-5" id="text-org1e45628">
<ul class="org-ul">
<li>148.5g (1 1/4 cups) King Arthur Unbleached All-Purpose Flour or 141.5g King Arthur Perfect Pastry Blend</li>
<li>3/8 teaspoons salt*</li>
<li>23g (1/8 cup) vegetable shortening</li>
<li>71g (5 tablespoons) very cold unsalted butter</li>
<li>42.5g to 71g (3 to 5 tablespoons) ice water**</li>
</ul>
</div>
</li>
<li><a id="org1fe8e57"></a>Notes<br />
<div class="outline-text-5" id="text-org1fe8e57">
<p>
**Reduce the salt to 1 teaspoon (1/2 teaspoon for single crust) if you use salted butter.
***Use the lesser amount of water if you use Perfect Pastry Blend.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgfaba5e4" class="outline-4">
<h4 id="orgfaba5e4">Method</h4>
<div class="outline-text-4" id="text-orgfaba5e4">
<ol class="org-ol">
<li>Whisk together the flour and salt.</li>
<li>Add the shortening, working it in until the mixture is evenly crumbly.</li>
<li>Cut the butter into small (about ½") cubes.</li>
<li>Add the butter to the flour mixture, and work it in roughly with your fingers, a pastry cutter, or a mixer. Don't be too thorough; the mixture should be very uneven, with big chunks of butter in among the smaller ones.</li>
<li>Add 4 (or 2 for single crust) tablespoons of water, and toss to combine.</li>
<li>Toss with enough additional water to make a chunky, fairly cohesive mixture. It should hold together when you gather it up and squeeze it in your hand.</li>
<li>Divide the dough in half, and gather each half into a rough disk. Smooth the disks; it's OK if they have a few cracks in the surface. Smooth the disks' edges by running them along a floured surface like a wheel.</li>
<li>Wrap in plastic, and chill for 30 minutes, or up to overnight. Or wrap in aluminum foil over the plastic, and freeze for up to 2 months.</li>
<li>When you're ready to make pie, remove the crust from the refrigerator or freezer, leaving it wrapped. Allow it to thaw (if it's frozen) or warm a bit (if it's been chilled longer than 30 minutes), until it's softened enough to roll, but still feels cold to the touch.</li>
<li>Next, measure the bottom diameter, and up the sides of your pie pan. If your pan is 7" across the bottom, and 1 ½" up each side, that's a total of 10". This means you should roll your bottom crust to a diameter between 11" and 12", which gives you enough extra for crimping the edges.</li>
<li>Place the crust on a floured work surface; our silicone rolling mat is a fine choice. Roll it to the desired width. See the big chunks of butter? That's a good thing.</li>
<li>Place the crust in the pan by folding in quarters and placing in the pan. Or you can simply pick it up with a piecrust lifter, and move it that way.</li>
<li>For a single-crust pie, fold the edges of the crust under, and gently squeeze them together. Crimp as desired. It's nice to make a tall crimp, as the filling for a single-crust pie is usually fairly liquid (think pumpkin or custard), and it's good to have that tall "dam."</li>
<li>For a double-crust pie, leave the edges of the bottom crust as is (no folding or crimping). Once you've added the pie filling, roll out the top crust to the outside diameter of your pan, and place it atop the filling.</li>
<li>Trim excess crust with a pair of scissors, then press the two edges together.</li>
<li>Crimp as desired. A simple fork crimp is fast and easy. At this point, it helps to return the pie to the refrigerator for 20 to 30 minutes; this chills the fat, which ultimately increases the crust's flakiness.</li>
<li>Cut a hole in the center of the crust for steam to escape. Or slash the pie's top surface several times.</li>
<li>Brush with milk and sprinkle with coarse sparkling sugar, if desired.</li>
<li>Bake&#x2026; enjoy!</li>
</ol>
</div>
</div>
<div id="outline-container-org67ab874" class="outline-4">
<h4 id="org67ab874">Yield</h4>
<div class="outline-text-4" id="text-org67ab874">
<p>
2 pie crusts
</p>
</div>
</div>
<div id="outline-container-org2a7fc0d" class="outline-4">
<h4 id="org2a7fc0d">Credits</h4>
<div class="outline-text-4" id="text-org2a7fc0d">
<p>
<a href="http://www.kingarthurflour.com/recipes/classic-double-pie-crust-recipe">http://www.kingarthurflour.com/recipes/classic-double-pie-crust-recipe</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgddfc1f5" class="outline-3">
<h3 id="orgddfc1f5">Classic Single Pie Dough</h3>
<div class="outline-text-3" id="text-orgddfc1f5">
</div>
