recipes.org
*** Ingredients
- 1 1/4 cups (150g | 6.25 ounces) all-purpose flour
- 1 Tbsp. sugar
- 1/2 tsp. salt
- 4 Tbsp. (23g) vegetable shortening, cut into 1/2-inch pieces and chilled
- 6 Tbsp. unsalted butter, cut into 1/4-inch pieces and chilled
- About 3-4 tablespoons ice water, plus more as needed
*** Method
1. Process flour, sugar and salt in food processor until combined, about 5 seconds. Scatter shortening over top and process until mixture resembles coarse cornmeal, about 10 seconds. Scatter butter over top and pulse until mixture resembles coarse crumbs, about 10 pulses.
2. Transfer mixture to a large bowl. Sprinkle 3 tablespoons of ice water over mixture. Stir and press dough together, using stiff rubber spatula, until dough sticks together. If dough does not come together, stir in remaining ice water, 1/2 tablespoon at a time, until it does.
3. Divide dough into 2 even pieces. Turn each piece of dough onto a sheet of plastic wrap and flatten each into 4-inch disk. Wrap each piece tightly in plastic and refrigerate for 1 hour. Before rolling out dough, let it sit on counter to soften slightly, about 10 minutes. (Dough can be wrapped tightly in plastic and refrigerated for up to 2 days or frozen for up to 1 month. If frozen, let dough thaw completely on counter before rolling it out.)
*** Yield
1 pie crust
*** Credits
From Cook's Illustrated Baking Book (page 372)
** Coconut Layer Cake
A Fantastic, Moist and Fluffy Coconut Cake Recipe
Fluffy layers of coconut cake, sweet, sticky 7-minute frosting and flakes of unsweetened coconut are piled high to create a dramatic, delicious Coconut Layer Cake that looks beautiful and tastes spectacular. 
Prep time: 10 min.
Total time: 1 hr., plus cooling time
*** Cake
**** Ingredients
- 1 cup (2 sticks) unsalted butter, softened, plus more for coating pans 
- 3 cups cake flour, plus more for coating pans 
- 1 tsp. baking powder 
- ½ tsp. baking soda 
- ½ tsp. salt 
- 1¾ cups sugar 
- 1 cup Coco GOYA® Cream of Coconut 
- 4 large eggs, separated 
- 1 tsp. GOYA® Vanilla Extract 
- 1 cup GOYA® Coconut Milk 
**** Method
1. Adjust oven racks to upper and lower thirds; heat oven to 350 degreesF. Butter three 9-inch-diameter cake pans. Line bottom of pans with parchment paper rounds; butter parchment paper. Dust bottom and sides of pans with flour, knocking out excess. Set pans in refrigerator.
2. In medium bowl, using whisk, whisk together flour, baking powder, baking soda and salt; set aside.
3. In large mixing bowl, using electric mixer, beat together sugar, butter and cream of coconut on medium-high speed until fluffy, about 2 minutes.
4. Beat in egg yolks, one at a time, and vanilla extract until well combined.
5. On low speed, beat in reserved flour mixture, scraping sides of bowl with spatula, until incorporated.
6. Beat in 1 cup coconut milk until just blended; set aside.
7. In separate medium mixing bowl, using clean dry beaters, beat egg whites until stiff but not dry. Using spatula, stir 1/3 beaten egg whites into cake batter until well blended. Gently fold in remaining beaten egg whites until well combined.
8. Divide cake batter evenly among prepared pans. Bake cakes, rotating after about 15 minutes, until tops are golden brown and cake tester inserted into center comes out clean, 30-32 minutes.
9. Cool cakes in pans on cooling racks about 15 minutes. Loosen cakes from sides of pans with thin knife, invert cakes onto racks. Cool cakes to room temperature; remove and discard parchment rounds.
*** Frosting: 
**** Ingredients
- 4 egg whites 
- 1 cup sugar 
- 1/8 tsp. salt 
- 1 tsp. GOYA® Vanilla Extract 
- 3 cups unsweetened flaked coconut 
**** Method
1. Meanwhile, in heatproof bowl, whisk together egg whites, sugar and salt. Set bowl over saucepan containing about 1" simmering water (making sure bottom of bowl does not touch water). Whisk constantly until mixture is opaque and warm to the touch (about 120 degreesF on quick-read thermometer), about 3 minutes. Remove bowl from heat.
2. Using electric mixer, beat egg whites on high speed until glossy white and sticky and mixture cools to about 80 degreesF on quick-read thermometer, about 4 minutes. Reduce speed to medium and beat in vanilla; set aside.
*** Assemble the Cake:
**** Method
1. Place one cooled cake round (top side-up) on cake plate.
2. Using off-set metal spatula, evenly spread with ½ cup frosting; sprinkle with ¾ cup flaked coconut.
3. Stack second cake layer (top side-up) on frosted cake.
4. Evenly spread cake with another ½ cup frosting; sprinkle with ¾ cup flaked coconut.
5. Stack last cake layer (top side-up) on frosted cake.
6. Evenly spread remaining frosting on top and sides of cake.
7. Sprinkle top of cake with about ¾ cup flaked coconut.
8. Using hands, press remaining coconut on sides of cake.
*** Credits
Serves 8
http://www.goya.com/english/recipes/print_recipe.html?recipeID=579&langID=0
[2016-09-01 Thu] Collected this recipe, but I haven't made it yet.
** Double Lemon-Poppy Seed Bundt Cake
Serves: 16
*** Ingredients
- 1/4 cup poppy seeds
- 1 1/2 cups whole-wheat pastry flour
- 1 cup all-purpose flour
- 1 1/2 teaspoons baking powder
- 1/2 teaspoon baking soda
- 1/4 teaspoon salt
- 1 cup buttermilk or equivalent buttermilk powder
- 1/4 cup canola oil
- 1 teaspoon vanilla extract
- 2 tablespoons freshly grated lemon zest
- 2 tablespoons lemon juice
- 2 large eggs, at room temperature
- 2 large egg whites, at room temperature
- 1 1/4 cups sugar
- 3/4 cup confectioners' sugar, plus more for dusting
- 3 tablespoons lemon juice
- 1 tablespoon water
