recipes.html
<div id="outline-container-orgd4c61dc" class="outline-4">
<h4 id="orgd4c61dc">Ingredients</h4>
<div class="outline-text-4" id="text-orgd4c61dc">
<ul class="org-ul">
<li>1 1/4 cups (150g | 6.25 ounces) all-purpose flour</li>
<li>1 Tbsp. sugar</li>
<li>1/2 tsp. salt</li>
<li>4 Tbsp. (23g) vegetable shortening, cut into 1/2-inch pieces and chilled</li>
<li>6 Tbsp. unsalted butter, cut into 1/4-inch pieces and chilled</li>
<li>About 3-4 tablespoons ice water, plus more as needed</li>
</ul>
</div>
</div>
<div id="outline-container-org245eb17" class="outline-4">
<h4 id="org245eb17">Method</h4>
<div class="outline-text-4" id="text-org245eb17">
<ol class="org-ol">
<li>Process flour, sugar and salt in food processor until combined, about 5 seconds. Scatter shortening over top and process until mixture resembles coarse cornmeal, about 10 seconds. Scatter butter over top and pulse until mixture resembles coarse crumbs, about 10 pulses.</li>
<li>Transfer mixture to a large bowl. Sprinkle 3 tablespoons of ice water over mixture. Stir and press dough together, using stiff rubber spatula, until dough sticks together. If dough does not come together, stir in remaining ice water, 1/2 tablespoon at a time, until it does.</li>
<li>Divide dough into 2 even pieces. Turn each piece of dough onto a sheet of plastic wrap and flatten each into 4-inch disk. Wrap each piece tightly in plastic and refrigerate for 1 hour. Before rolling out dough, let it sit on counter to soften slightly, about 10 minutes. (Dough can be wrapped tightly in plastic and refrigerated for up to 2 days or frozen for up to 1 month. If frozen, let dough thaw completely on counter before rolling it out.)</li>
</ol>
</div>
</div>
<div id="outline-container-orgfac10b4" class="outline-4">
<h4 id="orgfac10b4">Yield</h4>
<div class="outline-text-4" id="text-orgfac10b4">
<p>
1 pie crust
</p>
</div>
</div>
<div id="outline-container-orgbb73f68" class="outline-4">
<h4 id="orgbb73f68">Credits</h4>
<div class="outline-text-4" id="text-orgbb73f68">
<p>
From Cook's Illustrated Baking Book (page 372)
</p>
</div>
</div>
</div>
<div id="outline-container-org2cd5a8e" class="outline-3">
<h3 id="org2cd5a8e">Coconut Layer Cake</h3>
<div class="outline-text-3" id="text-org2cd5a8e">
<p>
A Fantastic, Moist and Fluffy Coconut Cake Recipe
Fluffy layers of coconut cake, sweet, sticky 7-minute frosting and flakes of unsweetened coconut are piled high to create a dramatic, delicious Coconut Layer Cake that looks beautiful and tastes spectacular. 
Prep time: 10 min.
Total time: 1 hr., plus cooling time
</p>
</div>
<div id="outline-container-orga0ebe29" class="outline-4">
<h4 id="orga0ebe29">Cake</h4>
<div class="outline-text-4" id="text-orga0ebe29">
</div>
<ul class="org-ul">
<li><a id="orga5820c4"></a>Ingredients<br />
<div class="outline-text-5" id="text-orga5820c4">
<ul class="org-ul">
<li>1 cup (2 sticks) unsalted butter, softened, plus more for coating pans</li>
<li>3 cups cake flour, plus more for coating pans</li>
<li>1 tsp. baking powder</li>
<li>½ tsp. baking soda</li>
<li>½ tsp. salt</li>
<li>1¾ cups sugar</li>
<li>1 cup Coco GOYA® Cream of Coconut</li>
<li>4 large eggs, separated</li>
<li>1 tsp. GOYA® Vanilla Extract</li>
<li>1 cup GOYA® Coconut Milk</li>
</ul>
</div>
</li>
<li><a id="org0801164"></a>Method<br />
<div class="outline-text-5" id="text-org0801164">
<ol class="org-ol">
<li>Adjust oven racks to upper and lower thirds; heat oven to 350 degreesF. Butter three 9-inch-diameter cake pans. Line bottom of pans with parchment paper rounds; butter parchment paper. Dust bottom and sides of pans with flour, knocking out excess. Set pans in refrigerator.</li>
<li>In medium bowl, using whisk, whisk together flour, baking powder, baking soda and salt; set aside.</li>
<li>In large mixing bowl, using electric mixer, beat together sugar, butter and cream of coconut on medium-high speed until fluffy, about 2 minutes.</li>
<li>Beat in egg yolks, one at a time, and vanilla extract until well combined.</li>
<li>On low speed, beat in reserved flour mixture, scraping sides of bowl with spatula, until incorporated.</li>
<li>Beat in 1 cup coconut milk until just blended; set aside.</li>
<li>In separate medium mixing bowl, using clean dry beaters, beat egg whites until stiff but not dry. Using spatula, stir 1/3 beaten egg whites into cake batter until well blended. Gently fold in remaining beaten egg whites until well combined.</li>
<li>Divide cake batter evenly among prepared pans. Bake cakes, rotating after about 15 minutes, until tops are golden brown and cake tester inserted into center comes out clean, 30-32 minutes.</li>
<li>Cool cakes in pans on cooling racks about 15 minutes. Loosen cakes from sides of pans with thin knife, invert cakes onto racks. Cool cakes to room temperature; remove and discard parchment rounds.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org7bbba63" class="outline-4">
<h4 id="org7bbba63">Frosting:</h4>
<div class="outline-text-4" id="text-org7bbba63">
</div>
<ul class="org-ul">
<li><a id="org607e5e9"></a>Ingredients<br />
<div class="outline-text-5" id="text-org607e5e9">
<ul class="org-ul">
<li>4 egg whites</li>
<li>1 cup sugar</li>
<li>1/8 tsp. salt</li>
<li>1 tsp. GOYA® Vanilla Extract</li>
<li>3 cups unsweetened flaked coconut</li>
</ul>
</div>
</li>
<li><a id="orgf5e8bb5"></a>Method<br />
<div class="outline-text-5" id="text-orgf5e8bb5">
<ol class="org-ol">
<li>Meanwhile, in heatproof bowl, whisk together egg whites, sugar and salt. Set bowl over saucepan containing about 1" simmering water (making sure bottom of bowl does not touch water). Whisk constantly until mixture is opaque and warm to the touch (about 120 degreesF on quick-read thermometer), about 3 minutes. Remove bowl from heat.</li>
<li>Using electric mixer, beat egg whites on high speed until glossy white and sticky and mixture cools to about 80 degreesF on quick-read thermometer, about 4 minutes. Reduce speed to medium and beat in vanilla; set aside.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org6875394" class="outline-4">
<h4 id="org6875394">Assemble the Cake:</h4>
<div class="outline-text-4" id="text-org6875394">
</div>
<ul class="org-ul">
<li><a id="org8b27d1c"></a>Method<br />
<div class="outline-text-5" id="text-org8b27d1c">
<ol class="org-ol">
<li>Place one cooled cake round (top side-up) on cake plate.</li>
<li>Using off-set metal spatula, evenly spread with ½ cup frosting; sprinkle with ¾ cup flaked coconut.</li>
<li>Stack second cake layer (top side-up) on frosted cake.</li>
<li>Evenly spread cake with another ½ cup frosting; sprinkle with ¾ cup flaked coconut.</li>
<li>Stack last cake layer (top side-up) on frosted cake.</li>
<li>Evenly spread remaining frosting on top and sides of cake.</li>
<li>Sprinkle top of cake with about ¾ cup flaked coconut.</li>
<li>Using hands, press remaining coconut on sides of cake.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orge800cc3" class="outline-4">
<h4 id="orge800cc3">Credits</h4>
<div class="outline-text-4" id="text-orge800cc3">
<p>
Serves 8
<a href="http://www.goya.com/english/recipes/print_recipe.html?recipeID=579&amp;langID=0">http://www.goya.com/english/recipes/print_recipe.html?recipeID=579&amp;langID=0</a>
<span class="timestamp-wrapper"><span class="timestamp">[2016-09-01 Thu] </span></span> Collected this recipe, but I haven't made it yet.
</p>
</div>
</div>
</div>
<div id="outline-container-org5518ab3" class="outline-3">
<h3 id="org5518ab3">Double Lemon-Poppy Seed Bundt Cake</h3>
<div class="outline-text-3" id="text-org5518ab3">
<p>
Serves: 16
</p>
</div>
<div id="outline-container-org740dc9e" class="outline-4">
<h4 id="org740dc9e">Ingredients</h4>
<div class="outline-text-4" id="text-org740dc9e">
<ul class="org-ul">
<li>1/4 cup poppy seeds</li>
<li>1 1/2 cups whole-wheat pastry flour</li>
<li>1 cup all-purpose flour</li>
<li>1 1/2 teaspoons baking powder</li>
<li>1/2 teaspoon baking soda</li>
<li>1/4 teaspoon salt</li>
<li>1 cup buttermilk or equivalent buttermilk powder</li>
<li>1/4 cup canola oil</li>
<li>1 teaspoon vanilla extract</li>
<li>2 tablespoons freshly grated lemon zest</li>
<li>2 tablespoons lemon juice</li>
<li>2 large eggs, at room temperature</li>
<li>2 large egg whites, at room temperature</li>
<li>1 1/4 cups sugar</li>
<li>3/4 cup confectioners' sugar, plus more for dusting</li>
<li>3 tablespoons lemon juice</li>
<li>1 tablespoon water</li>
</ul>
</div>
</div>
