recipes.org
*** Method
1. Preheat oven to 350 degrees F. Coat a 10-inch (12-cup) Bundt pan, preferably nonstick, with cooking spray and dust with flour (or use cooking spray with flour).
2. Toast poppy seeds in a small dry skillet over medium heat, stirring constantly, until fragrant, 3 to 4 minutes. Transfer to a plate to cool.
3. Whisk whole-wheat flour, all-purpose flour, baking powder, baking soda, salt and the poppy seeds in a medium bowl. Combine buttermilk, oil, vanilla, lemon zest and lemon juice in a glass measuring cup.
4. Beat eggs, egg whites and sugar in a large bowl with an electric mixer on high speed until thickened and pale, about 5 minutes.
5. Fold the dry ingredients into the egg mixture with a rubber spatula, a third at a time, alternating with 2 additions of the buttermilk mixture. Scrape the batter into the prepared pan, spreading evenly.
6. Bake the cake until the top springs back when touched lightly and a toothpick inserted in the center comes out clean, 35 to 40 minutes. Let cool in the pan on a wire rack for 5 minutes. Loosen the edges and turn the cake out onto the rack.
7. Meanwhile, prepare glaze: Sift 3/4 cup confectioners' sugar into a small bowl; mix with lemon juice and water to create a thin glaze. Poke 1-inch-deep holes all over the cake with a skewer. Coat the warm cake with the glaze using a pastry brush. Let cool completely. To serve, set the cake on a serving plate and dust with confectioners' sugar.
*** Yield 16 servings
*** Credits
- Per Serving
    - Calories: 201 kcal
    - Carbohydrates: 35 g
    - Dietary Fiber: 1 g
    - Fat: 5 g
    - Protein: 4 g
    - Sugars: 22 g
- http://food.yahoo.com/recipes/eatingwell/285/double-lemon-poppy-seed-bundt-cake/print
- 23 May 2009
- (date created: 5/26/2009 11:05:14 AM)
** East 62nd Street Lemon Cake
By Craig Claiborne
- TIME About 2 hours
- This is Maida Heatter's recipe
*** Ingredients
**** For The Cake:
- Fine dry bread crumbs or flour
- for dusting the pan
- 3 cups flour
- 2 teaspoons baking powder
- ½ teaspoon salt
- 1 cup unsalted butter (2 sticks), at room temperature
- 2 cups sugar
- 4 eggs
- 1 cup milk
- 2 tablespoons lemon zest
**** For The Glaze:
- ⅓ cup lemon juice
- ¾ cup sugar
*** Method
1. Heat oven to 325 degrees. Butter a 9‑inch tube pan. Coat it with the bread crumbs.
2. Sift together the flour, baking powder and salt and set aside.
3. Cream the butter and sugar together. Beat in the eggs one at a time.
4. Fold in the dry ingredients alternately with the milk. Stir in the lemon zest. Pour the batter into the pan and smooth the top of the batter. Bake 1¼ hours, or until the cake tests done.
5. While the cake bakes, make the glaze. Warm the juice and sugar in a small saucepan over medium-low heat until all of the sugar is dissolved. Cover and remove from heat.
6. When the cake is done, immediately unmold the cake onto a cake rack and apply the glaze with a pastry brush to the top and sides of the cake until it is all absorbed.
*** Yield 10 to 12 servings
*** Credits
- Recommended (heartily!) by Nancy Burnett [2018-04-08 Sun]
- https://cooking.nytimes.com/recipes/1019169-east-62nd-street-lemon-cake
** Flaky Pie Crust
From the book How to Cook Everything by Mark Bittman
*** Ingredients
- For any single-crust pie, 8 to 10 inches in diameter. Double the recipe for a two-crust pie.
- 1(?) cups (about 5 ounces) all-purpose flour, plus some for dusting work surface
- 1/2 tsp. salt
- 1 tsp. sugar
- 8 Tbsp. (1 stick) cold unsalted butter, cut into about 8 pieces
- About 3 tablespoons ice water, plus more as needed
*** Method
1. Combine the flour, salt, and sugar in the container of a food processor; pulse once or twice. Add the butter and turn on the machine; process until the butter and flour are blended and the mixture looks like cornmeal, about 10 seconds.
2. Place the mixture in a bowl and sprinkle 3 tablespoons of water over it. Use a wooden spoon or a rubber spatula to gradually gather the mixture into a ball; if the mixture seems dry, add another 1/2 tablespoon ice water. When you can make the mixture into a ball with your hands, do so. Wrap in plastic wrap, flatten into a small disk, and freeze the dough for 10 minutes (or refrigerate for 30 minutes); this will ease rolling. (You can also refrigerate the dough for a day or two, or freeze it almost indefinitely.)
3. You can roll the dough between two sheets of plastic wrap, usually quite successfully; sprinkle both sides of it with a little more flour, then proceed. Or sprinkle a countertop or large board with flour. Unwrap the dough and place it on the work surface; sprinkle its top with flour. If the dough is hard, let it rest for a few minutes; it should give a little when you press your fingers into it.
4. Roll with light pressure, from the center out. (If the dough seems very sticky at first, add flour liberally; but if it becomes sticky only after you roll it for a few minutes, return it to the refrigerator for 10 minutes before proceeding.) Continue to roll, adding small amounts of flour as necessary, rotating the dough occasionally, and turning it over once or twice during the process. (Use ragged edges of dough to repair any tears, adding a drop of water while you press the patch into place.) When the dough is about 10 inches in diameter (it will be less than 1/4-inch thick), place your pie plate upside down over it to check the size.
5. Move the dough into the pie plate by draping it over the rolling pin or by folding it into quarters, then moving it into the plate and unfolding it. When the dough is in the plate, press it firmly into the bottom, sides, and junction of bottom and sides. Trim the excess dough to about 1/2 inch all around, then tuck it under itself around the edge of the plate. Decorate the edges with a fork or your fingers. Freeze the dough for 10 minutes (or refrigerate it for 30 minutes).
6. When you're ready to bake, prick it all over with a fork.
*** Yield 	1 pie crust
*** Credits
- This content is from the book How to Cook Everything by Mark Bittman. 
- (date created: 6/14/2009 8:17:20 AM)
** Ginger Snaps
*** Notes:
- 4-July-06:
- Needs much more ginger! used 1 tsp + 2 tsp fresh... not enough!
- A bit too sweet.
