recipes.html
<div id="outline-container-org15c9d63" class="outline-4">
<h4 id="org15c9d63">Method</h4>
<div class="outline-text-4" id="text-org15c9d63">
<ol class="org-ol">
<li>Preheat oven to 350 degrees F. Coat a 10-inch (12-cup) Bundt pan, preferably nonstick, with cooking spray and dust with flour (or use cooking spray with flour).</li>
<li>Toast poppy seeds in a small dry skillet over medium heat, stirring constantly, until fragrant, 3 to 4 minutes. Transfer to a plate to cool.</li>
<li>Whisk whole-wheat flour, all-purpose flour, baking powder, baking soda, salt and the poppy seeds in a medium bowl. Combine buttermilk, oil, vanilla, lemon zest and lemon juice in a glass measuring cup.</li>
<li>Beat eggs, egg whites and sugar in a large bowl with an electric mixer on high speed until thickened and pale, about 5 minutes.</li>
<li>Fold the dry ingredients into the egg mixture with a rubber spatula, a third at a time, alternating with 2 additions of the buttermilk mixture. Scrape the batter into the prepared pan, spreading evenly.</li>
<li>Bake the cake until the top springs back when touched lightly and a toothpick inserted in the center comes out clean, 35 to 40 minutes. Let cool in the pan on a wire rack for 5 minutes. Loosen the edges and turn the cake out onto the rack.</li>
<li>Meanwhile, prepare glaze: Sift 3/4 cup confectioners' sugar into a small bowl; mix with lemon juice and water to create a thin glaze. Poke 1-inch-deep holes all over the cake with a skewer. Coat the warm cake with the glaze using a pastry brush. Let cool completely. To serve, set the cake on a serving plate and dust with confectioners' sugar.</li>
</ol>
</div>
</div>
<div id="outline-container-orgd9c78f1" class="outline-4">
<h4 id="orgd9c78f1">Yield 16 servings</h4>
</div>
<div id="outline-container-org30ef07b" class="outline-4">
<h4 id="org30ef07b">Credits</h4>
<div class="outline-text-4" id="text-org30ef07b">
<ul class="org-ul">
<li>Per Serving
<ul class="org-ul">
<li>Calories: 201 kcal</li>
<li>Carbohydrates: 35 g</li>
<li>Dietary Fiber: 1 g</li>
<li>Fat: 5 g</li>
<li>Protein: 4 g</li>
<li>Sugars: 22 g</li>
</ul></li>
<li><a href="http://food.yahoo.com/recipes/eatingwell/285/double-lemon-poppy-seed-bundt-cake/print">http://food.yahoo.com/recipes/eatingwell/285/double-lemon-poppy-seed-bundt-cake/print</a></li>
<li>23 May 2009</li>
<li>(date created: 5/26/2009 11:05:14 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org73b3f12" class="outline-3">
<h3 id="org73b3f12">East 62nd Street Lemon Cake</h3>
<div class="outline-text-3" id="text-org73b3f12">
<p>
By Craig Claiborne
</p>
<ul class="org-ul">
<li>TIME About 2 hours</li>
<li>This is Maida Heatter's recipe</li>
</ul>
</div>
<div id="outline-container-org2b790b7" class="outline-4">
<h4 id="org2b790b7">Ingredients</h4>
<div class="outline-text-4" id="text-org2b790b7">
</div>
<ul class="org-ul">
<li><a id="org83eab8d"></a>For The Cake:<br />
<div class="outline-text-5" id="text-org83eab8d">
<ul class="org-ul">
<li>Fine dry bread crumbs or flour</li>
<li>for dusting the pan</li>
<li>3 cups flour</li>
<li>2 teaspoons baking powder</li>
<li>½ teaspoon salt</li>
<li>1 cup unsalted butter (2 sticks), at room temperature</li>
<li>2 cups sugar</li>
<li>4 eggs</li>
<li>1 cup milk</li>
<li>2 tablespoons lemon zest</li>
</ul>
</div>
</li>
<li><a id="orgfbe7804"></a>For The Glaze:<br />
<div class="outline-text-5" id="text-orgfbe7804">
<ul class="org-ul">
<li>⅓ cup lemon juice</li>
<li>¾ cup sugar</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org891dcad" class="outline-4">
<h4 id="org891dcad">Method</h4>
<div class="outline-text-4" id="text-org891dcad">
<ol class="org-ol">
<li>Heat oven to 325 degrees. Butter a 9‑inch tube pan. Coat it with the bread crumbs.</li>
<li>Sift together the flour, baking powder and salt and set aside.</li>
<li>Cream the butter and sugar together. Beat in the eggs one at a time.</li>
<li>Fold in the dry ingredients alternately with the milk. Stir in the lemon zest. Pour the batter into the pan and smooth the top of the batter. Bake 1¼ hours, or until the cake tests done.</li>
<li>While the cake bakes, make the glaze. Warm the juice and sugar in a small saucepan over medium-low heat until all of the sugar is dissolved. Cover and remove from heat.</li>
<li>When the cake is done, immediately unmold the cake onto a cake rack and apply the glaze with a pastry brush to the top and sides of the cake until it is all absorbed.</li>
</ol>
</div>
</div>
<div id="outline-container-org9df8a03" class="outline-4">
<h4 id="org9df8a03">Yield 10 to 12 servings</h4>
</div>
<div id="outline-container-org76a5a3b" class="outline-4">
<h4 id="org76a5a3b">Credits</h4>
<div class="outline-text-4" id="text-org76a5a3b">
<ul class="org-ul">
<li>Recommended (heartily!) by Nancy Burnett <span class="timestamp-wrapper"><span class="timestamp">[2018-04-08 Sun]</span></span></li>
<li><a href="https://cooking.nytimes.com/recipes/1019169-east-62nd-street-lemon-cake">https://cooking.nytimes.com/recipes/1019169-east-62nd-street-lemon-cake</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7fb7094" class="outline-3">
<h3 id="org7fb7094">Flaky Pie Crust</h3>
<div class="outline-text-3" id="text-org7fb7094">
<p>
From the book How to Cook Everything by Mark Bittman
</p>
</div>
<div id="outline-container-orgec36b6b" class="outline-4">
<h4 id="orgec36b6b">Ingredients</h4>
<div class="outline-text-4" id="text-orgec36b6b">
<ul class="org-ul">
<li>For any single-crust pie, 8 to 10 inches in diameter. Double the recipe for a two-crust pie.</li>
<li>1(?) cups (about 5 ounces) all-purpose flour, plus some for dusting work surface</li>
<li>1/2 tsp. salt</li>
<li>1 tsp. sugar</li>
<li>8 Tbsp. (1 stick) cold unsalted butter, cut into about 8 pieces</li>
<li>About 3 tablespoons ice water, plus more as needed</li>
</ul>
</div>
</div>
<div id="outline-container-org17418eb" class="outline-4">
<h4 id="org17418eb">Method</h4>
<div class="outline-text-4" id="text-org17418eb">
<ol class="org-ol">
<li>Combine the flour, salt, and sugar in the container of a food processor; pulse once or twice. Add the butter and turn on the machine; process until the butter and flour are blended and the mixture looks like cornmeal, about 10 seconds.</li>
<li>Place the mixture in a bowl and sprinkle 3 tablespoons of water over it. Use a wooden spoon or a rubber spatula to gradually gather the mixture into a ball; if the mixture seems dry, add another 1/2 tablespoon ice water. When you can make the mixture into a ball with your hands, do so. Wrap in plastic wrap, flatten into a small disk, and freeze the dough for 10 minutes (or refrigerate for 30 minutes); this will ease rolling. (You can also refrigerate the dough for a day or two, or freeze it almost indefinitely.)</li>
<li>You can roll the dough between two sheets of plastic wrap, usually quite successfully; sprinkle both sides of it with a little more flour, then proceed. Or sprinkle a countertop or large board with flour. Unwrap the dough and place it on the work surface; sprinkle its top with flour. If the dough is hard, let it rest for a few minutes; it should give a little when you press your fingers into it.</li>
<li>Roll with light pressure, from the center out. (If the dough seems very sticky at first, add flour liberally; but if it becomes sticky only after you roll it for a few minutes, return it to the refrigerator for 10 minutes before proceeding.) Continue to roll, adding small amounts of flour as necessary, rotating the dough occasionally, and turning it over once or twice during the process. (Use ragged edges of dough to repair any tears, adding a drop of water while you press the patch into place.) When the dough is about 10 inches in diameter (it will be less than 1/4-inch thick), place your pie plate upside down over it to check the size.</li>
<li>Move the dough into the pie plate by draping it over the rolling pin or by folding it into quarters, then moving it into the plate and unfolding it. When the dough is in the plate, press it firmly into the bottom, sides, and junction of bottom and sides. Trim the excess dough to about 1/2 inch all around, then tuck it under itself around the edge of the plate. Decorate the edges with a fork or your fingers. Freeze the dough for 10 minutes (or refrigerate it for 30 minutes).</li>
<li>When you're ready to bake, prick it all over with a fork.</li>
</ol>
</div>
</div>
<div id="outline-container-org4f3f733" class="outline-4">
<h4 id="org4f3f733">Yield 	1 pie crust</h4>
</div>
<div id="outline-container-org6bfe325" class="outline-4">
<h4 id="org6bfe325">Credits</h4>
<div class="outline-text-4" id="text-org6bfe325">
<ul class="org-ul">
<li>This content is from the book How to Cook Everything by Mark Bittman.</li>
<li>(date created: 6/14/2009 8:17:20 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7af5c6f" class="outline-3">
<h3 id="org7af5c6f">Ginger Snaps</h3>
<div class="outline-text-3" id="text-org7af5c6f">
</div>
<div id="outline-container-org5d6ec95" class="outline-4">
<h4 id="org5d6ec95">Notes:</h4>
<div class="outline-text-4" id="text-org5d6ec95">
<ul class="org-ul">
<li>4-July-06:</li>
<li>Needs much more ginger! used 1 tsp + 2 tsp fresh&#x2026; not enough!</li>
<li>A bit too sweet.</li>
</ul>
</div>
</div>
