recipes.org
*** Ingredients
- 2 cups all-purpose flour
- 1 teaspoon ground ginger
- 1 teaspoon ground cinnamon
- 2 teaspoons baking soda
- 1/2 teaspoon salt
- 3/4 cup vegetable shortening
- 1 cup granulated sugar
- 1/4 cup light molasses
- 1 large egg
- Sugar for rolling
*** Method
1. Preheat oven to 350*F (175*C).
2. In medium bowl combine flour, ginger, cinnamon, baking soda and salt; set aside.
3. Cream together shortening and sugar, add egg and beat until fluffy. Stir in molasses and mix well. Stir in flour mixture until just mixed
4. Form tablespoonfuls of dough into round balls. Roll tops of balls in sugar. Place on a cookie sheet about 2-inches apart. (These cookies flatten as they bake.) Bake for exactly 9 minutes. Transfer cookies to wire racks to cool completely. 
*** Yield Makes 3 dozen.
*** Credits
- (date created: 6/27/2007 4:42:11 PM)
** Lemon Cornmeal Cake with Lemon Glaze and Crushed-Blueberry Sauce Glaze:
*** Ingredients
- 1 1/2 cups (packed) powdered sugar, sifted
- 2 tablespoons (or more) fresh lemon Juice
- 1 1/2 cups all purpose flour
- 1/3 cup yellow cornmeal
- 3/4 cup sugar
- 3 1/2 teaspoons baking powder
- 1/2 teaspoon salt
- 1 cup buttermilk
- 2 large eggs
- 1 tablespoon finely grated lemon peel
- 3/4 teaspoon vanilla extract
- 1/2 cup (1 stick) unsalted butter, melted, cooled
- Crushed-Blueberry Sauce
*** Method
1) For glaze: Combine powdered sugar and 2 tablespoons lemon juice in small bowl. Stir with spoon until smooth and paste-like, adding more lemon juice by 1/2 teaspoonfuls if glaze is too thick to spread. Set aside.
2) For cake: Position rack in center of oven and preheat to 350 degrees F. Butter 9-inch-diameter cake pan with 2-inch-high sides; line bottom with parchment. Combine flour, cornmeal, sugar, baking powder, and salt in large bowl; whisk to blend. Whisk buttermilk, eggs, lemon peel, and vanilla in small bowl. Pour buttermilk mixture and melted butter into flour mixture. Using rubber spatula, gently fold liquids into flour mixture until just blended (do not stir). Scrape batter into pan; spread evenly.
3) Bake cake until tester inserted into center comes out clean and cake pulls away from sides of pan, about 30 minutes.
4) Immediately run knife around sides of cake. Place rack atop cake in pan. Using oven mitts, hold pan and rack firmly together and invert cake onto rack. Remove pan from cake. Place another rack on bottom of cake; invert 1 more time so that cake is top side up. Stir glaze until blended. While cake is still very hot, drop glaze by tablespoonfuls onto cake; spread to within 1/2 inch of edge (some glaze may drip down sides of cake). Cool completely. Serve with Crushed-Blueberry Sauce.
*** Credits
- Bon Appetit
- April 2009
- by Abigail Johnson Dodge
- [TC made on 29-June-12. Yum! (Don't forget the baking powder!)]
- You can view the complete recipe online at: http://www.epicurious.com/recipes/food/views/Lemon-Cornmeal-Cake-with-Lemon-Glaze-and-Crushed-Blueberry-Sauce-352048?mbid=ipapp
- (date created: 7/2/2012 12:33:23 PM)
** Orange Pineapple Cake
*** Ingredients
- 1 yellow cake mix
- 3 eggs
- 3/4 cup cooking oil
- 1 can mandarin oranges (include juice)
- 1 large can crushed pineapple (include juice)
- 1 instant vanilla pudding mix
- 1/2 teaspoon vanilla
- whipped topping
*** Method
1. Mix cake mix, eggs, oil and oranges. Beat well. Pour into sheet cake pan or two round pans.
2. Bake at 350 degrees for 30 to 35 minutes.
3. Topping
4. Beat the instant pudding with the pinapple and vanilla. Add whipped topping enough to spread on cake.
*** Credits
- Delicious.
- Ellen Willis 18 May 2000 (via Doris Heimburg)
- a.k.a. "Better Than Sex"
- (date created: 6/27/2007 4:42:14 PM)
** Peach Melba Cream Cake
*** For the cake:
**** Ingredients
- 3/4 cup softened, unsalted butter plus more for greasing the pans
- 1 cup sugar
- 1/2 cup brown sugar
- 3 eggs
- 1 1/2 teaspoons pure vanilla extract
- finely grated zest of 1 lemon
- 1/4 cup fresh lemon juice
- 2 1/2 cups all purpose flour
- 1 1/2 teaspoons baking soda
- 1/2 teaspoon salt
- 1 1/2 cups buttermilk
- 4 pounds ripe peaches
- 2 tablespoons fresh lemon juice
- 2 1/2 tablespoons sugar
- 2 cups heavy cream
- 1 1/2 teaspoons pure vanilla extract
**** Method
1) Raspberry Melba Sauce (see recipe)
2) Preheat the oven to 350 degrees F. Butter and flour two 9-inch cake pans (line with buttered and floured wax paper for easier removal, optional).
3) Cream the 3/4 cup butter and sugars in a mixing bowl. Addd the eggs, one at a time, beating well after each adition. Beat in the vanilla, lemon zest and juice.
4) Sift together the flour, baking soda and salt; add to mixture in the bowl, alternating with buttermilk, to make batter.
5) Scrape batter into the pans. Bake until a toothpick inserted in the center comes out clean, about 35 to 40 minutes. Cool the cakes in their pans on a rack for 15 minutes, then turn them out onto the rack, peel off wax paper and cool completely.
6) Shortly before serving, peel, pit and slice the peaches. Toss with lemon juice and 1 tablespoon sugar; set aside for 15 minutes.
7) Whip the cream with the vanilla and the remaining 1 1/2 tablespoons of sugar until it holds soft peaks.
8) Place on cake on a serving platter. Spread with half the cream, then half the peaches. Cover with second cake and top with remaining peaches. Top with a dollop of cream and, if desired, a mint sprig. Serve immediately, with the Raspberry Melba Sauce on the side or drizzled over the cake.
9) Serves 10. 
10) Per serving: 651 calories, 82g carbs, 9g protein, 34 g fat, 167 mg cholesterol.
*** Raspberry Melba Sauce
**** Ingredients
- 2 cups raspberries
- 1/2 cup confectioners' sugar
- 1 tablespoon fresh lemon juice
- 1/4 cup apple juice
**** Method
1. Puree all ingredients, the pass through a strainer to remove the seeds.
2. Makes 2 cups.
3. Per 2 tablespoons: 61 calories, 15g carbohydrates, 0g protein, 0g fat, 0mg cholesterol.
*** Credits
- (date created: 6/27/2007 4:42:14 PM)
** Pie Crust (Classic)
