recipes.html
<div id="outline-container-org6bb264b" class="outline-4">
<h4 id="org6bb264b">Ingredients</h4>
<div class="outline-text-4" id="text-org6bb264b">
<ul class="org-ul">
<li>2 cups all-purpose flour</li>
<li>1 teaspoon ground ginger</li>
<li>1 teaspoon ground cinnamon</li>
<li>2 teaspoons baking soda</li>
<li>1/2 teaspoon salt</li>
<li>3/4 cup vegetable shortening</li>
<li>1 cup granulated sugar</li>
<li>1/4 cup light molasses</li>
<li>1 large egg</li>
<li>Sugar for rolling</li>
</ul>
</div>
</div>
<div id="outline-container-org2b91689" class="outline-4">
<h4 id="org2b91689">Method</h4>
<div class="outline-text-4" id="text-org2b91689">
<ol class="org-ol">
<li>Preheat oven to 350*F (175*C).</li>
<li>In medium bowl combine flour, ginger, cinnamon, baking soda and salt; set aside.</li>
<li>Cream together shortening and sugar, add egg and beat until fluffy. Stir in molasses and mix well. Stir in flour mixture until just mixed</li>
<li>Form tablespoonfuls of dough into round balls. Roll tops of balls in sugar. Place on a cookie sheet about 2-inches apart. (These cookies flatten as they bake.) Bake for exactly 9 minutes. Transfer cookies to wire racks to cool completely.</li>
</ol>
</div>
</div>
<div id="outline-container-org4ac2a2b" class="outline-4">
<h4 id="org4ac2a2b">Yield Makes 3 dozen.</h4>
</div>
<div id="outline-container-org26b9789" class="outline-4">
<h4 id="org26b9789">Credits</h4>
<div class="outline-text-4" id="text-org26b9789">
<ul class="org-ul">
<li>(date created: 6/27/2007 4:42:11 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org93bd41b" class="outline-3">
<h3 id="org93bd41b">Lemon Cornmeal Cake with Lemon Glaze and Crushed-Blueberry Sauce Glaze:</h3>
<div class="outline-text-3" id="text-org93bd41b">
</div>
<div id="outline-container-orgff15c23" class="outline-4">
<h4 id="orgff15c23">Ingredients</h4>
<div class="outline-text-4" id="text-orgff15c23">
<ul class="org-ul">
<li>1 1/2 cups (packed) powdered sugar, sifted</li>
<li>2 tablespoons (or more) fresh lemon Juice</li>
<li>1 1/2 cups all purpose flour</li>
<li>1/3 cup yellow cornmeal</li>
<li>3/4 cup sugar</li>
<li>3 1/2 teaspoons baking powder</li>
<li>1/2 teaspoon salt</li>
<li>1 cup buttermilk</li>
<li>2 large eggs</li>
<li>1 tablespoon finely grated lemon peel</li>
<li>3/4 teaspoon vanilla extract</li>
<li>1/2 cup (1 stick) unsalted butter, melted, cooled</li>
<li>Crushed-Blueberry Sauce</li>
</ul>
</div>
</div>
<div id="outline-container-org9f9a76f" class="outline-4">
<h4 id="org9f9a76f">Method</h4>
<div class="outline-text-4" id="text-org9f9a76f">
<ol class="org-ol">
<li>For glaze: Combine powdered sugar and 2 tablespoons lemon juice in small bowl. Stir with spoon until smooth and paste-like, adding more lemon juice by 1/2 teaspoonfuls if glaze is too thick to spread. Set aside.</li>
<li>For cake: Position rack in center of oven and preheat to 350 degrees F. Butter 9-inch-diameter cake pan with 2-inch-high sides; line bottom with parchment. Combine flour, cornmeal, sugar, baking powder, and salt in large bowl; whisk to blend. Whisk buttermilk, eggs, lemon peel, and vanilla in small bowl. Pour buttermilk mixture and melted butter into flour mixture. Using rubber spatula, gently fold liquids into flour mixture until just blended (do not stir). Scrape batter into pan; spread evenly.</li>
<li>Bake cake until tester inserted into center comes out clean and cake pulls away from sides of pan, about 30 minutes.</li>
<li>Immediately run knife around sides of cake. Place rack atop cake in pan. Using oven mitts, hold pan and rack firmly together and invert cake onto rack. Remove pan from cake. Place another rack on bottom of cake; invert 1 more time so that cake is top side up. Stir glaze until blended. While cake is still very hot, drop glaze by tablespoonfuls onto cake; spread to within 1/2 inch of edge (some glaze may drip down sides of cake). Cool completely. Serve with Crushed-Blueberry Sauce.</li>
</ol>
</div>
</div>
<div id="outline-container-org34738ea" class="outline-4">
<h4 id="org34738ea">Credits</h4>
<div class="outline-text-4" id="text-org34738ea">
<ul class="org-ul">
<li>Bon Appetit</li>
<li>April 2009</li>
<li>by Abigail Johnson Dodge</li>
<li>[TC made on 29-June-12. Yum! (Don't forget the baking powder!)]</li>
<li>You can view the complete recipe online at: <a href="http://www.epicurious.com/recipes/food/views/Lemon-Cornmeal-Cake-with-Lemon-Glaze-and-Crushed-Blueberry-Sauce-352048?mbid=ipapp">http://www.epicurious.com/recipes/food/views/Lemon-Cornmeal-Cake-with-Lemon-Glaze-and-Crushed-Blueberry-Sauce-352048?mbid=ipapp</a></li>
<li>(date created: 7/2/2012 12:33:23 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga28de47" class="outline-3">
<h3 id="orga28de47">Orange Pineapple Cake</h3>
<div class="outline-text-3" id="text-orga28de47">
</div>
<div id="outline-container-org97d047b" class="outline-4">
<h4 id="org97d047b">Ingredients</h4>
<div class="outline-text-4" id="text-org97d047b">
<ul class="org-ul">
<li>1 yellow cake mix</li>
<li>3 eggs</li>
<li>3/4 cup cooking oil</li>
<li>1 can mandarin oranges (include juice)</li>
<li>1 large can crushed pineapple (include juice)</li>
<li>1 instant vanilla pudding mix</li>
<li>1/2 teaspoon vanilla</li>
<li>whipped topping</li>
</ul>
</div>
</div>
<div id="outline-container-org4af81d0" class="outline-4">
<h4 id="org4af81d0">Method</h4>
<div class="outline-text-4" id="text-org4af81d0">
<ol class="org-ol">
<li>Mix cake mix, eggs, oil and oranges. Beat well. Pour into sheet cake pan or two round pans.</li>
<li>Bake at 350 degrees for 30 to 35 minutes.</li>
<li>Topping</li>
<li>Beat the instant pudding with the pinapple and vanilla. Add whipped topping enough to spread on cake.</li>
</ol>
</div>
</div>
<div id="outline-container-org7840884" class="outline-4">
<h4 id="org7840884">Credits</h4>
<div class="outline-text-4" id="text-org7840884">
<ul class="org-ul">
<li>Delicious.</li>
<li>Ellen Willis 18 May 2000 (via Doris Heimburg)</li>
<li>a.k.a. "Better Than Sex"</li>
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3610d4b" class="outline-3">
<h3 id="org3610d4b">Peach Melba Cream Cake</h3>
<div class="outline-text-3" id="text-org3610d4b">
</div>
<div id="outline-container-orgecbf1ac" class="outline-4">
<h4 id="orgecbf1ac">For the cake:</h4>
<div class="outline-text-4" id="text-orgecbf1ac">
</div>
<ul class="org-ul">
<li><a id="orgf3d0974"></a>Ingredients<br />
<div class="outline-text-5" id="text-orgf3d0974">
<ul class="org-ul">
<li>3/4 cup softened, unsalted butter plus more for greasing the pans</li>
<li>1 cup sugar</li>
<li>1/2 cup brown sugar</li>
<li>3 eggs</li>
<li>1 1/2 teaspoons pure vanilla extract</li>
<li>finely grated zest of 1 lemon</li>
<li>1/4 cup fresh lemon juice</li>
<li>2 1/2 cups all purpose flour</li>
<li>1 1/2 teaspoons baking soda</li>
<li>1/2 teaspoon salt</li>
<li>1 1/2 cups buttermilk</li>
<li>4 pounds ripe peaches</li>
<li>2 tablespoons fresh lemon juice</li>
<li>2 1/2 tablespoons sugar</li>
<li>2 cups heavy cream</li>
<li>1 1/2 teaspoons pure vanilla extract</li>
</ul>
</div>
</li>
<li><a id="org078e25c"></a>Method<br />
<div class="outline-text-5" id="text-org078e25c">
<ol class="org-ol">
<li>Raspberry Melba Sauce (see recipe)</li>
<li>Preheat the oven to 350 degrees F. Butter and flour two 9-inch cake pans (line with buttered and floured wax paper for easier removal, optional).</li>
<li>Cream the 3/4 cup butter and sugars in a mixing bowl. Addd the eggs, one at a time, beating well after each adition. Beat in the vanilla, lemon zest and juice.</li>
<li>Sift together the flour, baking soda and salt; add to mixture in the bowl, alternating with buttermilk, to make batter.</li>
<li>Scrape batter into the pans. Bake until a toothpick inserted in the center comes out clean, about 35 to 40 minutes. Cool the cakes in their pans on a rack for 15 minutes, then turn them out onto the rack, peel off wax paper and cool completely.</li>
<li>Shortly before serving, peel, pit and slice the peaches. Toss with lemon juice and 1 tablespoon sugar; set aside for 15 minutes.</li>
<li>Whip the cream with the vanilla and the remaining 1 1/2 tablespoons of sugar until it holds soft peaks.</li>
<li>Place on cake on a serving platter. Spread with half the cream, then half the peaches. Cover with second cake and top with remaining peaches. Top with a dollop of cream and, if desired, a mint sprig. Serve immediately, with the Raspberry Melba Sauce on the side or drizzled over the cake.</li>
<li>Serves 10.</li>
<li>Per serving: 651 calories, 82g carbs, 9g protein, 34 g fat, 167 mg cholesterol.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org2395fac" class="outline-4">
<h4 id="org2395fac">Raspberry Melba Sauce</h4>
<div class="outline-text-4" id="text-org2395fac">
</div>
<ul class="org-ul">
<li><a id="org135aa3b"></a>Ingredients<br />
<div class="outline-text-5" id="text-org135aa3b">
<ul class="org-ul">
<li>2 cups raspberries</li>
<li>1/2 cup confectioners' sugar</li>
<li>1 tablespoon fresh lemon juice</li>
<li>1/4 cup apple juice</li>
</ul>
</div>
</li>
<li><a id="org8f85631"></a>Method<br />
<div class="outline-text-5" id="text-org8f85631">
<ol class="org-ol">
<li>Puree all ingredients, the pass through a strainer to remove the seeds.</li>
<li>Makes 2 cups.</li>
<li>Per 2 tablespoons: 61 calories, 15g carbohydrates, 0g protein, 0g fat, 0mg cholesterol.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org66ffea5" class="outline-4">
<h4 id="org66ffea5">Credits</h4>
<div class="outline-text-4" id="text-org66ffea5">
<ul class="org-ul">
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1db63c0" class="outline-3">
<h3 id="org1db63c0">Pie Crust (Classic)</h3>
<div class="outline-text-3" id="text-org1db63c0">
</div>
