recipes.org
*** Ingredients
- 2 cups all-purpose flour
- 1 teaspoon salt
- 2/3 - 3/4 cup solid veg. shortening
- 4 to 5 tablespoons ice water
*** Method
1. Combine the flour and salt in a food processor. Add the shortening; pulse the machine on and off until the mixture resembles coarse meal.
2. With the machine running,trickle in 4 tablespoons of ice water through the feed tube, until the dough just gathers together. (If the dough seems dry, add up to 1 tablespoon more of ice water, 1/2 teaspoon at a time.)
3. Divide the dough in half, forming each half into a thick disk. Wrap each disk in plastic; refrigerate for at least 1 hour to chill.
4. Remove half the dough from the refrigerator and roll it out on a lightly floured work surface or between 2 sheets of wax paper to form a circle about 1/8-inch thick and 2 inches larger than the pie plate. (Work quickly, as the dough can become sticky.) With the help of a spatula, gently transfer the dough to a pie plate, pressing it lightly into the plate to fit. If the dough should tear, just press it together gently. Trim the dough, leaving a 1-inch overhang. If making a single-crust pie, turn the edge under and flute it decoratively.
5. Repeat for a top crust or for another bottom crust. The diameter for a top crust should be one inch larger than for the pie.
6. Follow the individual pie recipes for filling and baking.
*** Credits
- Makes enough for an 8- or 9-inch double-crust pie. Per 1/8 of single crust: 299 calories, 24g carbs, 3g protein, 2 g fat, 0g cholesterol
- (date created: 6/27/2007 4:42:14 PM)
** Spoon Cookies
From Gourmet, Dec. 2005
Makes 25-30 sandwich cookies
*** Ingredients
- 2 sticks (1 cup) cold unsalted butter, cut into pieces
- 3/4 cup (148.5 grams) sugar
- 2 tsp vanilla
- 2 cups (240 grams) flour
- 1 tsp baking soda
- 1/8 tsp salt, slightly rounded
- 1/2 cup fruit preserves (your choice: cherry and strawberry are good)
*** Method
1. Fill kitchen sink with about 2 inches of cold water. Melt butter in a 2- to 3-quart heavy saucepan over moderate heat and cook, stirring occasionally, until butter turns golden with a nutlike fragrance and flecks on bottom of pan turn a rich caramel brown, 10 to 12 minutes. (Butter will initially foam, then dissipate. A thicker foam will appear and cover the surface just before butter begins to brown; stir more frequently toward end of cooking.) Place pan in sink to stop cooking, then cool, stirring frequently, until butter starts to look opaque, about 4 minutes. Remove pan from sink and stir in sugar and vanilla.
2. Whisk together flour, salt, and baking soda and stir into butter mixture until a dough forms. Shape into a ball, wrap with plastic wrap, and let stand at cool room temperature 1 to 2 hours (to allow flavors to develop).
3. Put oven rack in middle position and preheat oven to 325 degrees F.
4. Press a piece of dough into bowl of teaspoon (table type teaspoon, not one for measuring), flattening top, then slide out and place, flat side down, on an ungreased baking sheet. (Dough will feel crumbly, but will become cohesive when pressed.) Continue forming cookies and arranging on sheet. Bake cookies until just pale golden, 8 to 15 minutes. Cool cookies on sheet on a rack 5 minutes, then transfer cookies to rack and cool completely, about 30 minutes. Cookies are very delicate when hot.
5. While cookies cool, heat preserves in a small saucepan over low heat until just runny, then pour through a sieve into a small bowl, pressing hard on solids, and cool completely. Spread the flat side of a cookie with a thin layer of preserves. Sandwich with flat side of another cookie. Continue with remaining cookies and preserves, then let stand until set, about 45 minutes. Transfer cookies to an airtight contain and (this is the hard part) WAIT 2 DAYS BEFORE EATING.
6. Dough can be made 12 hours before baking and chilled, covered. Bring to room temperature to soften slightly before forming cookies, about 30 minutes. Cookies keep in an airtight container at room temperature 2 weeks.
*** Credits
- courtesy of Nancy Burnett 3-Feb-06
- See http://www.epicurious.com/recipes/food/views/spoon-cookies-233297
- I made these [2016-12-15 Thu] and cooked them for 14 minutes. I had a bit of trouble forming the cookies, but even some of the well-formed ones wound up spreading out in the oven. Filled variously with strawberry, fig and mixed berries preserves.
- (date created: 6/27/2007 4:42:12 PM)
** Tiramisu
*** Ingredients
- 3 eggs
- 1/2 cup sugar
- 1 cup espresso (or strong coffee)
- 8 oz. mascarpone cheese
- 2 Tbls cognac or brandy
- 1/8 cup cocoa
- 20 lady finger or egg cookies
*** Method
1) Combine 3 egg yolks, 1 tablespoon espresso, sugar and cognac into large mixing bowl. Beat 2-3 minutes. Add mascarpone and beat 3-5 minutes until smooth.
2) In another bowl, combine 3 egg whites and a pinch of sugar. Beat until mixture forms stiff peaks. Gently fold into mascarpone mixture.
3) Pour rest of espresso into flat dish. Dip one side of each cookie and layer on bottom of serving dish.
4) Spread 1/3 of mascarpone mixture and sprinkle with cocoa. Continue layering and finish with mascarpone layer.
5) Sprinkle with cocoa and refrigerate for at least 1 hour before serving. /(But it is *so* much yummier the next day!)/
*** Yield
- Serves 6
*** Credits
- (date created: 1/29/2019 10:38:08 AM)
* Entrees
** Asparagus Frittata with Basil, Shallots and Parmesan
*** Ingredients
- 1 pound thin asparagus
- 2 Tbls extra-virgin olive oil
- 3 medium shallots, minced (onions will do in a pinch!)
- 6 large eggs -- egg beaters work just fine!
- 1/2 cup freshly grated Parmigiano-Reggiano cheese (I use Pecorino Romano)
- 1/4 cup shredded fresh basil leaves (I use 1 tsp dried)
- kosher salt and freshly ground black pepper
