recipes.html
<div id="outline-container-orge9f4be5" class="outline-4">
<h4 id="orge9f4be5">Ingredients</h4>
<div class="outline-text-4" id="text-orge9f4be5">
<ul class="org-ul">
<li>2 cups all-purpose flour</li>
<li>1 teaspoon salt</li>
<li>2/3 - 3/4 cup solid veg. shortening</li>
<li>4 to 5 tablespoons ice water</li>
</ul>
</div>
</div>
<div id="outline-container-orgc131291" class="outline-4">
<h4 id="orgc131291">Method</h4>
<div class="outline-text-4" id="text-orgc131291">
<ol class="org-ol">
<li>Combine the flour and salt in a food processor. Add the shortening; pulse the machine on and off until the mixture resembles coarse meal.</li>
<li>With the machine running,trickle in 4 tablespoons of ice water through the feed tube, until the dough just gathers together. (If the dough seems dry, add up to 1 tablespoon more of ice water, 1/2 teaspoon at a time.)</li>
<li>Divide the dough in half, forming each half into a thick disk. Wrap each disk in plastic; refrigerate for at least 1 hour to chill.</li>
<li>Remove half the dough from the refrigerator and roll it out on a lightly floured work surface or between 2 sheets of wax paper to form a circle about 1/8-inch thick and 2 inches larger than the pie plate. (Work quickly, as the dough can become sticky.) With the help of a spatula, gently transfer the dough to a pie plate, pressing it lightly into the plate to fit. If the dough should tear, just press it together gently. Trim the dough, leaving a 1-inch overhang. If making a single-crust pie, turn the edge under and flute it decoratively.</li>
<li>Repeat for a top crust or for another bottom crust. The diameter for a top crust should be one inch larger than for the pie.</li>
<li>Follow the individual pie recipes for filling and baking.</li>
</ol>
</div>
</div>
<div id="outline-container-org26d5598" class="outline-4">
<h4 id="org26d5598">Credits</h4>
<div class="outline-text-4" id="text-org26d5598">
<ul class="org-ul">
<li>Makes enough for an 8- or 9-inch double-crust pie. Per 1/8 of single crust: 299 calories, 24g carbs, 3g protein, 2 g fat, 0g cholesterol</li>
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3c8ba34" class="outline-3">
<h3 id="org3c8ba34">Spoon Cookies</h3>
<div class="outline-text-3" id="text-org3c8ba34">
<p>
From Gourmet, Dec. 2005
Makes 25-30 sandwich cookies
</p>
</div>
<div id="outline-container-orgf5a718a" class="outline-4">
<h4 id="orgf5a718a">Ingredients</h4>
<div class="outline-text-4" id="text-orgf5a718a">
<ul class="org-ul">
<li>2 sticks (1 cup) cold unsalted butter, cut into pieces</li>
<li>3/4 cup (148.5 grams) sugar</li>
<li>2 tsp vanilla</li>
<li>2 cups (240 grams) flour</li>
<li>1 tsp baking soda</li>
<li>1/8 tsp salt, slightly rounded</li>
<li>1/2 cup fruit preserves (your choice: cherry and strawberry are good)</li>
</ul>
</div>
</div>
<div id="outline-container-org9fa2d5b" class="outline-4">
<h4 id="org9fa2d5b">Method</h4>
<div class="outline-text-4" id="text-org9fa2d5b">
<ol class="org-ol">
<li>Fill kitchen sink with about 2 inches of cold water. Melt butter in a 2- to 3-quart heavy saucepan over moderate heat and cook, stirring occasionally, until butter turns golden with a nutlike fragrance and flecks on bottom of pan turn a rich caramel brown, 10 to 12 minutes. (Butter will initially foam, then dissipate. A thicker foam will appear and cover the surface just before butter begins to brown; stir more frequently toward end of cooking.) Place pan in sink to stop cooking, then cool, stirring frequently, until butter starts to look opaque, about 4 minutes. Remove pan from sink and stir in sugar and vanilla.</li>
<li>Whisk together flour, salt, and baking soda and stir into butter mixture until a dough forms. Shape into a ball, wrap with plastic wrap, and let stand at cool room temperature 1 to 2 hours (to allow flavors to develop).</li>
<li>Put oven rack in middle position and preheat oven to 325 degrees F.</li>
<li>Press a piece of dough into bowl of teaspoon (table type teaspoon, not one for measuring), flattening top, then slide out and place, flat side down, on an ungreased baking sheet. (Dough will feel crumbly, but will become cohesive when pressed.) Continue forming cookies and arranging on sheet. Bake cookies until just pale golden, 8 to 15 minutes. Cool cookies on sheet on a rack 5 minutes, then transfer cookies to rack and cool completely, about 30 minutes. Cookies are very delicate when hot.</li>
<li>While cookies cool, heat preserves in a small saucepan over low heat until just runny, then pour through a sieve into a small bowl, pressing hard on solids, and cool completely. Spread the flat side of a cookie with a thin layer of preserves. Sandwich with flat side of another cookie. Continue with remaining cookies and preserves, then let stand until set, about 45 minutes. Transfer cookies to an airtight contain and (this is the hard part) WAIT 2 DAYS BEFORE EATING.</li>
<li>Dough can be made 12 hours before baking and chilled, covered. Bring to room temperature to soften slightly before forming cookies, about 30 minutes. Cookies keep in an airtight container at room temperature 2 weeks.</li>
</ol>
</div>
</div>
<div id="outline-container-org733327e" class="outline-4">
<h4 id="org733327e">Credits</h4>
<div class="outline-text-4" id="text-org733327e">
<ul class="org-ul">
<li>courtesy of Nancy Burnett 3-Feb-06</li>
<li>See <a href="http://www.epicurious.com/recipes/food/views/spoon-cookies-233297">http://www.epicurious.com/recipes/food/views/spoon-cookies-233297</a></li>
<li>I made these <span class="timestamp-wrapper"><span class="timestamp">[2016-12-15 Thu] </span></span> and cooked them for 14 minutes. I had a bit of trouble forming the cookies, but even some of the well-formed ones wound up spreading out in the oven. Filled variously with strawberry, fig and mixed berries preserves.</li>
<li>(date created: 6/27/2007 4:42:12 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf6127d3" class="outline-3">
<h3 id="orgf6127d3">Tiramisu</h3>
<div class="outline-text-3" id="text-orgf6127d3">
</div>
<div id="outline-container-org3b65e3f" class="outline-4">
<h4 id="org3b65e3f">Ingredients</h4>
<div class="outline-text-4" id="text-org3b65e3f">
<ul class="org-ul">
<li>3 eggs</li>
<li>1/2 cup sugar</li>
<li>1 cup espresso (or strong coffee)</li>
<li>8 oz. mascarpone cheese</li>
<li>2 Tbls cognac or brandy</li>
<li>1/8 cup cocoa</li>
<li>20 lady finger or egg cookies</li>
</ul>
</div>
</div>
<div id="outline-container-org756fb77" class="outline-4">
<h4 id="org756fb77">Method</h4>
<div class="outline-text-4" id="text-org756fb77">
<ol class="org-ol">
<li>Combine 3 egg yolks, 1 tablespoon espresso, sugar and cognac into large mixing bowl. Beat 2-3 minutes. Add mascarpone and beat 3-5 minutes until smooth.</li>
<li>In another bowl, combine 3 egg whites and a pinch of sugar. Beat until mixture forms stiff peaks. Gently fold into mascarpone mixture.</li>
<li>Pour rest of espresso into flat dish. Dip one side of each cookie and layer on bottom of serving dish.</li>
<li>Spread 1/3 of mascarpone mixture and sprinkle with cocoa. Continue layering and finish with mascarpone layer.</li>
<li>Sprinkle with cocoa and refrigerate for at least 1 hour before serving. <i>(But it is <b>so</b> much yummier the next day!)</i></li>
</ol>
</div>
</div>
<div id="outline-container-orgb7848c9" class="outline-4">
<h4 id="orgb7848c9">Yield</h4>
<div class="outline-text-4" id="text-orgb7848c9">
<ul class="org-ul">
<li>Serves 6</li>
</ul>
</div>
</div>
<div id="outline-container-org0cc0689" class="outline-4">
<h4 id="org0cc0689">Credits</h4>
<div class="outline-text-4" id="text-org0cc0689">
<ul class="org-ul">
<li>(date created: 1/29/2019 10:38:08 AM)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org392dbf9" class="outline-2">
<h2 id="org392dbf9">Entrees</h2>
<div class="outline-text-2" id="text-org392dbf9">
</div>
<div id="outline-container-org712d316" class="outline-3">
<h3 id="org712d316">Asparagus Frittata with Basil, Shallots and Parmesan</h3>
<div class="outline-text-3" id="text-org712d316">
</div>
<div id="outline-container-org5c37d7a" class="outline-4">
<h4 id="org5c37d7a">Ingredients</h4>
<div class="outline-text-4" id="text-org5c37d7a">
<ul class="org-ul">
<li>1 pound thin asparagus</li>
<li>2 Tbls extra-virgin olive oil</li>
<li>3 medium shallots, minced (onions will do in a pinch!)</li>
<li>6 large eggs &#x2013; egg beaters work just fine!</li>
<li>1/2 cup freshly grated Parmigiano-Reggiano cheese (I use Pecorino Romano)</li>
<li>1/4 cup shredded fresh basil leaves (I use 1 tsp dried)</li>
<li>kosher salt and freshly ground black pepper</li>
</ul>
</div>
</div>
