recipes.org
*** Method
1. Snap and discard tough asparagus ends. Slice the asparagus on the bias into 1-inch-long pieces. Steam the asparagus in a bamboo steamer (or boil in salt water for 1 1/2 minutes), until almost tender.
2. Preheat the broiler. Heat the oil in a 10-inch nonstick skillet with an oven proof handle. Swirl the oil to coat the bottom of the pan evenly. Add the shallots and saute over medium heat until translucent, about 3 minutes. Add the asparagus and cook for 30 seconds. 
3. In a medium bowl, use a fork to lightly beat the eggs, cheese, basil and salt and pepper. Add the egg mixture to the pan and stir gently with a fork to incorporate the vegetables. Cook over medium-low heat, occasionally sliding a spatula around the edges of the pan to loosen the frittata as it sets. Continue cooking until the frittata is set, except for the top, about 8 minutes.
4. Place the pan directly under the broiler and cook just until the top is golden brown and set, 1 to 2 minutes. Do not let the frittata burn.
5. Invert the frittata onto a large platter. (Optionally sprinkle with a little kosher salt.) Cut it into wedges and serve. The frittata may also be cooled to room temperature and then cut and served. 
*** Credits
- [As served at Easter Brunch at Tracey and John's, April 2004. Recipe source: The Complete Italian Vegetarian Cookbook, by Jack Bishop, page 245.]
- (date created: 6/27/2007 4:42:13 PM)
** Butternut Squash Soup
*** Ingredients
- 3 lbs butternut squash
- 7 Tbsp butter
- 2 leeks - thinly sliced (onions will do in a pinch!)
- 1 qt vegetable stock
- 1/4 tsp nutmeg
- 1/2 cup peas (frozen or fresh)
- 8 cups fresh spinach (approx. 1/2 lbs = 10 oz. bag)
- 1 1/4 cup light cream
- salt and pepper to taste
*** Method
1. Slice squash length-wise in half. Place in microwave-proof pan with a small amount of water and microwave on high until flesh is tender (perhaps 20 minutes, depending on microwave).
2. Wash and drain spinach, trim stems, chop and set aside.
3. When squash is cool enough to handle, scoop out.
4. Melt butter in a stock pot and add leeks. Saute until soft. Add stock, squash, nutmeg, salt and pepper. Bring to a boil. 
5. Puree soup in a food processor.
6. Return to pot and add spinach and peas. Simmer until spinach is slightly tender.
7. Stir in cream, heat and serve.
*** Credits
- [Served Easter weekend, April 2004 at Tracey and John's]
- (date created: 6/27/2007 4:42:13 PM)
** Cajun Meat Loaf with Chili Sauce
*** Meat Loaf
**** Ingredients
- 1 cup long grain brown rice
- 1/4 cup oil
- 2/3 cup dried lentils
- 1 1/2 teasp. salt
- 2 cups diced onion
- 1 cup celery, chopped
- 1 cup diced green pepper
- 4 chopped jalapeno peppers
- 1 Tblsp garlic, chopped
- 1 cup pecans, chopped
- 1/2 cup sesame seeds
- 1/2 teasp black pepper
- 1 pinch white pepper
- 2 cups TVP
- 1 1/2 cups barbecue sauce
- 9 eggs
- 1 pound cheddar cheese grated
- 8 ounces tomato juice
- 1/4 cup soy sauce
***** Barbecue Sauce Ingredients
- 1 cup		tomato sauce
- 1/2 teasp		liquid smoke
- 1/4 cup		sugar
- 1/4 cup		cider vinegar
- 1/4 cup		tomato paste
**** Ingredients (50%):
- 1/2 cup long grain brown rice
- 2 Tbls oil
- 1/3 cup dried lentils
- 3/4 teasp. salt
- 1 cup diced onion
- 1/2 cup celery, chopped
- 1/2 cup diced green pepper
- 2 chopped jalapeno peppers
- 1/2 Tblsp garlic, chopped
- 1/2 cup pecans, chopped
- 1/4 cup sesame seeds
- 1/4 teasp black pepper
- 1 pinch white pepper
- 1 cup TVP
- 3/4 cups barbecue sauce
- 4 eggs
- 1/2 pound cheddar cheese grated
- 4 ounces tomato juice
- 2 Tbls soy sauce
***** Barbecue Sauce Ingredients
- 1 cup		tomato sauce
- 1/2 teasp		liquid smoke
- 1/4 cup		sugar
- 1/4 cup		cider vinegar
- 1/4 cup		tomato paste
**** Method
1. Take half the oil, and saute uncooked rice over low heat until golden. Stir often.
2. Add 3 (1.5 for half) cups water, and cook uncovered until rice is tender.
3. In another saute pan, place lentils, 4 cups (2 cups for half) water and  1/2 teaspoon salt. Cook until tender, about 30 minutes and drain. (Do not overcook; lentils should be chewy.)
4. In a large saute pan, take the rest of the oil and saute half the onions until brown.
5. Add the rest of onions, celery and peppers and cook until tender, or about 5 minutes.
6. Mix in the rest of the ingredients, except eggs, cheese and tomato juice. Let cool, then beat eggs with tomato juice and add to mixture.
7. Add  1/4 cup (or 2 Tbls for half) soy sauce. Knead. Wait 5 minutes so TVP can soak up moisture. Taste TVP to see if smooth. If crunchy, add water. Add cheese and place in baking dish. (Optionally, cover loaf with paper thin cheese: e.g., mozerella.)
8. Cover with aluminum foil and bake at 275 degrees for 1 hour or until center is cooked.
9. The meat loaf may be served with ketchup, or with the spicy chili sauce, below.
*** Spicy Chili Sauce
**** Ingredients
- 1 medium	onion, chopped
- 1			green pepper chopped
- 2			jalapeno peppers, chopped
- 1 stalk		celery, diced
- 1/4 cup		oil
- 1 large can	Italian tomatoes
- 1/2 teasp		coriander
- 1 heaping teasp	cumin
- 1/4 cup		soy sauce
**** Method
1. Saute onions. Add peppers, celery and jalapeno peppers and saute until tender. Break tomatoes into pieces with fingers and add spices. Cook for 10 minutes. Salt to taste.
*** Credits
- Park and Orchard Recipe
- from The Record: 6 November 1988
- (date created: 6/27/2007 4:42:14 PM)
** Corn Chowder
*** Ingredients
- 2 onions, chopped
- 3 potatoes, diced
- 8 ounces frozen corn
- 2 cans creamed corn
- 1 can's worth of fresh (or evaporated) milk
- 2-3 Tblsp butter (optional)
*** Method
1. In a stick-proof soup pot, cook onion in 1 Tblsp butter until soft. Add potatoes and cover with water. Simmer until potatoes are almost soft.
2. Add frozen corn and cook for 2 minutes. Add creamed corn; let simmer for 5 minutes. Add 1 can milk and butter (optional). Serve when hot.
*** Credits
- Doris Heimburg 7/21/01
- (revised 3/30/03)
- (date created: 6/27/2007 4:42:14 PM)
** Corn Souffle
