recipes.html
<div id="outline-container-orge7ac43d" class="outline-4">
<h4 id="orge7ac43d">Method</h4>
<div class="outline-text-4" id="text-orge7ac43d">
<ol class="org-ol">
<li>Snap and discard tough asparagus ends. Slice the asparagus on the bias into 1-inch-long pieces. Steam the asparagus in a bamboo steamer (or boil in salt water for 1 1/2 minutes), until almost tender.</li>
<li>Preheat the broiler. Heat the oil in a 10-inch nonstick skillet with an oven proof handle. Swirl the oil to coat the bottom of the pan evenly. Add the shallots and saute over medium heat until translucent, about 3 minutes. Add the asparagus and cook for 30 seconds.</li>
<li>In a medium bowl, use a fork to lightly beat the eggs, cheese, basil and salt and pepper. Add the egg mixture to the pan and stir gently with a fork to incorporate the vegetables. Cook over medium-low heat, occasionally sliding a spatula around the edges of the pan to loosen the frittata as it sets. Continue cooking until the frittata is set, except for the top, about 8 minutes.</li>
<li>Place the pan directly under the broiler and cook just until the top is golden brown and set, 1 to 2 minutes. Do not let the frittata burn.</li>
<li>Invert the frittata onto a large platter. (Optionally sprinkle with a little kosher salt.) Cut it into wedges and serve. The frittata may also be cooled to room temperature and then cut and served.</li>
</ol>
</div>
</div>
<div id="outline-container-orgacb6a66" class="outline-4">
<h4 id="orgacb6a66">Credits</h4>
<div class="outline-text-4" id="text-orgacb6a66">
<ul class="org-ul">
<li>[As served at Easter Brunch at Tracey and John's, April 2004. Recipe source: The Complete Italian Vegetarian Cookbook, by Jack Bishop, page 245.]</li>
<li>(date created: 6/27/2007 4:42:13 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb495a4e" class="outline-3">
<h3 id="orgb495a4e">Butternut Squash Soup</h3>
<div class="outline-text-3" id="text-orgb495a4e">
</div>
<div id="outline-container-orgb5c277d" class="outline-4">
<h4 id="orgb5c277d">Ingredients</h4>
<div class="outline-text-4" id="text-orgb5c277d">
<ul class="org-ul">
<li>3 lbs butternut squash</li>
<li>7 Tbsp butter</li>
<li>2 leeks - thinly sliced (onions will do in a pinch!)</li>
<li>1 qt vegetable stock</li>
<li>1/4 tsp nutmeg</li>
<li>1/2 cup peas (frozen or fresh)</li>
<li>8 cups fresh spinach (approx. 1/2 lbs = 10 oz. bag)</li>
<li>1 1/4 cup light cream</li>
<li>salt and pepper to taste</li>
</ul>
</div>
</div>
<div id="outline-container-orgf178ba4" class="outline-4">
<h4 id="orgf178ba4">Method</h4>
<div class="outline-text-4" id="text-orgf178ba4">
<ol class="org-ol">
<li>Slice squash length-wise in half. Place in microwave-proof pan with a small amount of water and microwave on high until flesh is tender (perhaps 20 minutes, depending on microwave).</li>
<li>Wash and drain spinach, trim stems, chop and set aside.</li>
<li>When squash is cool enough to handle, scoop out.</li>
<li>Melt butter in a stock pot and add leeks. Saute until soft. Add stock, squash, nutmeg, salt and pepper. Bring to a boil.</li>
<li>Puree soup in a food processor.</li>
<li>Return to pot and add spinach and peas. Simmer until spinach is slightly tender.</li>
<li>Stir in cream, heat and serve.</li>
</ol>
</div>
</div>
<div id="outline-container-org523b25c" class="outline-4">
<h4 id="org523b25c">Credits</h4>
<div class="outline-text-4" id="text-org523b25c">
<ul class="org-ul">
<li>[Served Easter weekend, April 2004 at Tracey and John's]</li>
<li>(date created: 6/27/2007 4:42:13 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge7a41d8" class="outline-3">
<h3 id="orge7a41d8">Cajun Meat Loaf with Chili Sauce</h3>
<div class="outline-text-3" id="text-orge7a41d8">
</div>
<div id="outline-container-org2d14fe1" class="outline-4">
<h4 id="org2d14fe1">Meat Loaf</h4>
<div class="outline-text-4" id="text-org2d14fe1">
</div>
<ul class="org-ul">
<li><a id="org3d886e8"></a>Ingredients<br />
<div class="outline-text-5" id="text-org3d886e8">
<ul class="org-ul">
<li>1 cup long grain brown rice</li>
<li>1/4 cup oil</li>
<li>2/3 cup dried lentils</li>
<li>1 1/2 teasp. salt</li>
<li>2 cups diced onion</li>
<li>1 cup celery, chopped</li>
<li>1 cup diced green pepper</li>
<li>4 chopped jalapeno peppers</li>
<li>1 Tblsp garlic, chopped</li>
<li>1 cup pecans, chopped</li>
<li>1/2 cup sesame seeds</li>
<li>1/2 teasp black pepper</li>
<li>1 pinch white pepper</li>
<li>2 cups TVP</li>
<li>1 1/2 cups barbecue sauce</li>
<li>9 eggs</li>
<li>1 pound cheddar cheese grated</li>
<li>8 ounces tomato juice</li>
<li>1/4 cup soy sauce</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org9c2e19f"></a>Barbecue Sauce Ingredients<br />
<div class="outline-text-6" id="text-org9c2e19f">
<ul class="org-ul">
<li>1 cup		tomato sauce</li>
<li>1/2 teasp		liquid smoke</li>
<li>1/4 cup		sugar</li>
<li>1/4 cup		cider vinegar</li>
<li>1/4 cup		tomato paste</li>
</ul>
</div>
</li>
</ul>
</li>
<li><a id="org4baf02f"></a>Ingredients (50%):<br />
<div class="outline-text-5" id="text-org4baf02f">
<ul class="org-ul">
<li>1/2 cup long grain brown rice</li>
<li>2 Tbls oil</li>
<li>1/3 cup dried lentils</li>
<li>3/4 teasp. salt</li>
<li>1 cup diced onion</li>
<li>1/2 cup celery, chopped</li>
<li>1/2 cup diced green pepper</li>
<li>2 chopped jalapeno peppers</li>
<li>1/2 Tblsp garlic, chopped</li>
<li>1/2 cup pecans, chopped</li>
<li>1/4 cup sesame seeds</li>
<li>1/4 teasp black pepper</li>
<li>1 pinch white pepper</li>
<li>1 cup TVP</li>
<li>3/4 cups barbecue sauce</li>
<li>4 eggs</li>
<li>1/2 pound cheddar cheese grated</li>
<li>4 ounces tomato juice</li>
<li>2 Tbls soy sauce</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orga57d1ea"></a>Barbecue Sauce Ingredients<br />
<div class="outline-text-6" id="text-orga57d1ea">
<ul class="org-ul">
<li>1 cup		tomato sauce</li>
<li>1/2 teasp		liquid smoke</li>
<li>1/4 cup		sugar</li>
<li>1/4 cup		cider vinegar</li>
<li>1/4 cup		tomato paste</li>
</ul>
</div>
</li>
</ul>
</li>
<li><a id="org5909054"></a>Method<br />
<div class="outline-text-5" id="text-org5909054">
<ol class="org-ol">
<li>Take half the oil, and saute uncooked rice over low heat until golden. Stir often.</li>
<li>Add 3 (1.5 for half) cups water, and cook uncovered until rice is tender.</li>
<li>In another saute pan, place lentils, 4 cups (2 cups for half) water and  1/2 teaspoon salt. Cook until tender, about 30 minutes and drain. (Do not overcook; lentils should be chewy.)</li>
<li>In a large saute pan, take the rest of the oil and saute half the onions until brown.</li>
<li>Add the rest of onions, celery and peppers and cook until tender, or about 5 minutes.</li>
<li>Mix in the rest of the ingredients, except eggs, cheese and tomato juice. Let cool, then beat eggs with tomato juice and add to mixture.</li>
<li>Add  1/4 cup (or 2 Tbls for half) soy sauce. Knead. Wait 5 minutes so TVP can soak up moisture. Taste TVP to see if smooth. If crunchy, add water. Add cheese and place in baking dish. (Optionally, cover loaf with paper thin cheese: e.g., mozerella.)</li>
<li>Cover with aluminum foil and bake at 275 degrees for 1 hour or until center is cooked.</li>
<li>The meat loaf may be served with ketchup, or with the spicy chili sauce, below.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org994ffc0" class="outline-4">
<h4 id="org994ffc0">Spicy Chili Sauce</h4>
<div class="outline-text-4" id="text-org994ffc0">
</div>
<ul class="org-ul">
<li><a id="org843b8de"></a>Ingredients<br />
<div class="outline-text-5" id="text-org843b8de">
<ul class="org-ul">
<li>1 medium	onion, chopped</li>
<li>1			green pepper chopped</li>
<li>2			jalapeno peppers, chopped</li>
<li>1 stalk		celery, diced</li>
<li>1/4 cup		oil</li>
<li>1 large can	Italian tomatoes</li>
<li>1/2 teasp		coriander</li>
<li>1 heaping teasp	cumin</li>
<li>1/4 cup		soy sauce</li>
</ul>
</div>
</li>
<li><a id="orge0eeb51"></a>Method<br />
<div class="outline-text-5" id="text-orge0eeb51">
<ol class="org-ol">
<li>Saute onions. Add peppers, celery and jalapeno peppers and saute until tender. Break tomatoes into pieces with fingers and add spices. Cook for 10 minutes. Salt to taste.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd4b3f27" class="outline-4">
<h4 id="orgd4b3f27">Credits</h4>
<div class="outline-text-4" id="text-orgd4b3f27">
<ul class="org-ul">
<li>Park and Orchard Recipe</li>
<li>from The Record: 6 November 1988</li>
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8d04ce4" class="outline-3">
<h3 id="org8d04ce4">Corn Chowder</h3>
<div class="outline-text-3" id="text-org8d04ce4">
</div>
<div id="outline-container-org9b12da5" class="outline-4">
<h4 id="org9b12da5">Ingredients</h4>
<div class="outline-text-4" id="text-org9b12da5">
<ul class="org-ul">
<li>2 onions, chopped</li>
<li>3 potatoes, diced</li>
<li>8 ounces frozen corn</li>
<li>2 cans creamed corn</li>
<li>1 can's worth of fresh (or evaporated) milk</li>
<li>2-3 Tblsp butter (optional)</li>
</ul>
</div>
</div>
<div id="outline-container-org66092ca" class="outline-4">
<h4 id="org66092ca">Method</h4>
<div class="outline-text-4" id="text-org66092ca">
<ol class="org-ol">
<li>In a stick-proof soup pot, cook onion in 1 Tblsp butter until soft. Add potatoes and cover with water. Simmer until potatoes are almost soft.</li>
<li>Add frozen corn and cook for 2 minutes. Add creamed corn; let simmer for 5 minutes. Add 1 can milk and butter (optional). Serve when hot.</li>
</ol>
</div>
</div>
<div id="outline-container-org53a8011" class="outline-4">
<h4 id="org53a8011">Credits</h4>
<div class="outline-text-4" id="text-org53a8011">
<ul class="org-ul">
<li>Doris Heimburg 7/21/01</li>
<li>(revised 3/30/03)</li>
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
