recipes.org
*** Credits
Recipe excerpted from The Fresh & Green Table by Susie Middleton,
Chronicle Books (2012). Reprinted with permission.
** Curried Lentil Dish
*** Ingredients
- 15 Tbs lentils (assortment of channa dal, toor dal, urad dal, masoor dal and moong dal (mung beans))
*** Method
1. 1 tsp turmeric
2. 2 tsp grated ginger
3. 5 cloves minced garlic
4. 2 tsp green chilies
5. 1/2 tsp cayenne
6. 1/2 cup chopped red onion
7. 2/3 cup chopped tomato
8. 1 tsp cumin seeds
9. 1 Tbs chopped cilantro leaves
10. 1/2 tsp black pepper
11. 1 Tbs lemon juice
12. 1/2 tsp nutmeg
13. Place lentils in a saucepan, covering with 2" of water. Soak for 3-5 hours.
14. Add turmeric, bring to a boil, then simmer, covered, 1 1/2 hours. Stir periodically so it doesn't stick. Then whisk until relatively creamy and smooth. (Less water will result in more stew-like.)
15. Mix ginger, garlic, chilies, cayenne, onion and tomato. Saute cumin seeds in a little olive oil until brown. Add to tomato mixture for 2 minutes. Add to already whisked dal over moderate heat for 1-2 minutes, stirring.
16. Add cilantro, cook 1-2 minutes. Add black pepper, remove from heat. Then add lemon juice and nutmeg.
*** Credits
- (via Kate 9 April 2011)
- (date created: 4/10/2011 12:35:10 PM)
** Dried Mushroom Soup with Barley
*** Ingredients
- 1/2 ounce dried mushrooms, such as porcini, shiitake, chanterelle and/or morel -- about 2/3 cup
- 6 cups boiling water
- 1 tsp canola or other vegetable oil
- 2 cups chopped onions
- 2 cloves garlic, pressed
- 1 cup finely chopped celery
- 1 cup carrots, peeled and finely chopped
- 3 cups sliced fresh mushrooms (about 10 oz.)
- 1/4 cup soy sauce
- pinch dried thyme
- 1/4 tsp ground black pepper
- 1/2 cup raw pearl barley
- 1/4 cup dry shery or 2 tsp honey
- salt and ground black pepper to taste
*** Method
1. In a saucepan, cover the dried mushrooms with 6 cups boiling water. Simmer for 15 minutes. Remove from heat and set aside for at least 15 minutes.
2. Meanwhile, warm the oil in a soup pot on low heat. Add the onions and garlic, cover and cook for 5 minutes, stirring occasionally. Add the celery and carrots and cook for 5 minutes, stirring occasionally. Add the fresh mushrooms, increase the heat to medium and cook, stirring continuously, for about 3 minutes, until the mushrooms begin to release their jucies. Remove from the heat and set aside.
3. Drain the dried mushrooms, reserving the mushroom stock. Cut off and discard any tough stems, then rinse and chop the mushrooms. Strain the stock through a sieve or-- if dirt or sand is evident-- through a paper coffee filter. Add enough water to the stock to make 7 cups of liquid. 
4. Add the chopped dried mushrooms, mushroom stock, soy sauce, thyme, pepper, barley and optional sherry or honey to the pot of sauteed vegetables. Bring to a boil and then cover; reduce the heat and simmer for 45 minutes.
5. When ready to serve, add salt and pepper to taste. The soup should be brothy, so if it has cooked down and become thick, add a bit more water.
*** Credits
- Per 8 oz serving: 94 calories, 3.5 g protein, 1.2 g fat, 19 g carbs, 4.3 g dietary fiber
- [As served during Easter weeken at Tracey and John's; April 2004; Recipe Source: Moosewood Restaurant Low-Fat Favorites, page 94]
- (date created: 6/27/2007 4:42:13 PM)
** General Tso's Cauliflower
Prep time 15 mins
Cook time 15 mins
Total time 30 mins
Serves: 6-8 servings
*** Ingredients
**** for the General Tso’s sauce:
- 1 tablespoon sesame oil
- 3 cloves garlic, minced
- 1 knob of ginger, grated
- 1/2 cup chicken or vegetable broth
- 1/2 cup soy sauce
- 1/3 cup rice vinegar
- 1/4 cup sugar (more to taste)
- 2 tablespoons tomato paste
- 2 tablespoons cornstarch, dissolved in 1-2 tablespoons of cold water
**** for the Batter:
- 1 cup flour
- 2/3 cup cornstarch
- 1 1/2 teaspoons baking powder
- 2 teaspoons salt
- 4 eggs
- water as needed (about 1/2 cup)
**** other ingredients:
- 1 head cauliflower, cut into small florets
- a deep layer of oil for frying
- scallions and sesame seeds for topping
*** Instructions
**** General Tso’s Sauce: 
1. Heat the sesame oil in a small saucepan over medium low heat.
2. Add the ginger and garlic and stir fry for a minute or two.
3. Add remaining ingredients and whisk to combine.
4. Bring to a low boil; simmer for another 20-30 minutes or until sauce is thickened.
5. Add more sweetness, citrus, etc. to your taste.
**** Cauliflower Batter:
1. Whisk all the batter ingredients until a loose batter forms.The batter should be thick enough to cling to the cauliflower and cover it but stay loose enough to easily drip off (adjust thickness with water).
**** Cauliflower Frying: 
1. Pour oil into a heavy bottomed skillet to make it deep enough so it will cover the cauliflower about halfway (probably ends up being a few cups).
2. Heat the oil over medium heat.
3. Drop a small bit of batter in the oil to test it – when it rises to the top and bubbles, the oil is ready.
4. Dip cauliflower florets in the batter and let the excess drip off before gently setting in the oil.
5. Fry for a few minutes on each side, then flip, repeating sides several times if necessary until you get a nice golden brown fried exterior.
6. The additional frying time helps make it a little crunchier, which I very much like.
7. Remove and set on a cooling rack with paper towels underneath (again, rather than putting it all on a plate or bowl with paper towels, this keeps it crispy vs. soggy).
**** Serving:
1. Toss the fried cauliflower with the sauce (enough just to cover) and sprinkle with scallions and sesame seeds for serving.
2. Serve with rice.
** General Tso's Tofu
Prep time 15 mins
Cook time 15 mins
Total time 30 mins
Serves: 4 servings
*** Ingredients
**** For the tofu:
- 1½ tablespoons honey
- 2 teaspoons Louisiana hot sauce, such as Crystal
- 1 block of regular or firm tofu, drained, pat dry, and cut into 1-inch squares
- 1 ½ tablespoons sesame seeds
- 2 to 3 tablespoons cornstarch (depending on how wet the tofu is)
- ⅓ cup peanut or canola oil, for shallow frying
