recipes.html
<div id="outline-container-orge878bcb" class="outline-4">
<h4 id="orge878bcb">Yield</h4>
<div class="outline-text-4" id="text-orge878bcb">
<p>
Serves 4.
</p>
</div>
</div>
<div id="outline-container-org1be850e" class="outline-4">
<h4 id="org1be850e">Credits</h4>
<div class="outline-text-4" id="text-org1be850e">
<p>
Recipe excerpted from The Fresh &amp; Green Table by Susie Middleton,
Chronicle Books (2012). Reprinted with permission.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfb7c04a" class="outline-3">
<h3 id="orgfb7c04a">Curried Lentil Dish</h3>
<div class="outline-text-3" id="text-orgfb7c04a">
</div>
<div id="outline-container-org3220ad7" class="outline-4">
<h4 id="org3220ad7">Ingredients</h4>
<div class="outline-text-4" id="text-org3220ad7">
<ul class="org-ul">
<li>15 Tbs lentils (assortment of channa dal, toor dal, urad dal, masoor dal and moong dal (mung beans))</li>
</ul>
</div>
</div>
<div id="outline-container-orgcab682f" class="outline-4">
<h4 id="orgcab682f">Method</h4>
<div class="outline-text-4" id="text-orgcab682f">
<ol class="org-ol">
<li>1 tsp turmeric</li>
<li>2 tsp grated ginger</li>
<li>5 cloves minced garlic</li>
<li>2 tsp green chilies</li>
<li>1/2 tsp cayenne</li>
<li>1/2 cup chopped red onion</li>
<li>2/3 cup chopped tomato</li>
<li>1 tsp cumin seeds</li>
<li>1 Tbs chopped cilantro leaves</li>
<li>1/2 tsp black pepper</li>
<li>1 Tbs lemon juice</li>
<li>1/2 tsp nutmeg</li>
<li>Place lentils in a saucepan, covering with 2" of water. Soak for 3-5 hours.</li>
<li>Add turmeric, bring to a boil, then simmer, covered, 1 1/2 hours. Stir periodically so it doesn't stick. Then whisk until relatively creamy and smooth. (Less water will result in more stew-like.)</li>
<li>Mix ginger, garlic, chilies, cayenne, onion and tomato. Saute cumin seeds in a little olive oil until brown. Add to tomato mixture for 2 minutes. Add to already whisked dal over moderate heat for 1-2 minutes, stirring.</li>
<li>Add cilantro, cook 1-2 minutes. Add black pepper, remove from heat. Then add lemon juice and nutmeg.</li>
</ol>
</div>
</div>
<div id="outline-container-org06efe73" class="outline-4">
<h4 id="org06efe73">Credits</h4>
<div class="outline-text-4" id="text-org06efe73">
<ul class="org-ul">
<li>(via Kate 9 April 2011)</li>
<li>(date created: 4/10/2011 12:35:10 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5a539c1" class="outline-3">
<h3 id="org5a539c1">Dried Mushroom Soup with Barley</h3>
<div class="outline-text-3" id="text-org5a539c1">
</div>
<div id="outline-container-orgd0fbbf5" class="outline-4">
<h4 id="orgd0fbbf5">Ingredients</h4>
<div class="outline-text-4" id="text-orgd0fbbf5">
<ul class="org-ul">
<li>1/2 ounce dried mushrooms, such as porcini, shiitake, chanterelle and/or morel &#x2013; about 2/3 cup</li>
<li>6 cups boiling water</li>
<li>1 tsp canola or other vegetable oil</li>
<li>2 cups chopped onions</li>
<li>2 cloves garlic, pressed</li>
<li>1 cup finely chopped celery</li>
<li>1 cup carrots, peeled and finely chopped</li>
<li>3 cups sliced fresh mushrooms (about 10 oz.)</li>
<li>1/4 cup soy sauce</li>
<li>pinch dried thyme</li>
<li>1/4 tsp ground black pepper</li>
<li>1/2 cup raw pearl barley</li>
<li>1/4 cup dry shery or 2 tsp honey</li>
<li>salt and ground black pepper to taste</li>
</ul>
</div>
</div>
<div id="outline-container-org2e7f80a" class="outline-4">
<h4 id="org2e7f80a">Method</h4>
<div class="outline-text-4" id="text-org2e7f80a">
<ol class="org-ol">
<li>In a saucepan, cover the dried mushrooms with 6 cups boiling water. Simmer for 15 minutes. Remove from heat and set aside for at least 15 minutes.</li>
<li>Meanwhile, warm the oil in a soup pot on low heat. Add the onions and garlic, cover and cook for 5 minutes, stirring occasionally. Add the celery and carrots and cook for 5 minutes, stirring occasionally. Add the fresh mushrooms, increase the heat to medium and cook, stirring continuously, for about 3 minutes, until the mushrooms begin to release their jucies. Remove from the heat and set aside.</li>
<li>Drain the dried mushrooms, reserving the mushroom stock. Cut off and discard any tough stems, then rinse and chop the mushrooms. Strain the stock through a sieve or&#x2013; if dirt or sand is evident&#x2013; through a paper coffee filter. Add enough water to the stock to make 7 cups of liquid.</li>
<li>Add the chopped dried mushrooms, mushroom stock, soy sauce, thyme, pepper, barley and optional sherry or honey to the pot of sauteed vegetables. Bring to a boil and then cover; reduce the heat and simmer for 45 minutes.</li>
<li>When ready to serve, add salt and pepper to taste. The soup should be brothy, so if it has cooked down and become thick, add a bit more water.</li>
</ol>
</div>
</div>
<div id="outline-container-orgae83dbd" class="outline-4">
<h4 id="orgae83dbd">Credits</h4>
<div class="outline-text-4" id="text-orgae83dbd">
<ul class="org-ul">
<li>Per 8 oz serving: 94 calories, 3.5 g protein, 1.2 g fat, 19 g carbs, 4.3 g dietary fiber</li>
<li>[As served during Easter weeken at Tracey and John's; April 2004; Recipe Source: Moosewood Restaurant Low-Fat Favorites, page 94]</li>
<li>(date created: 6/27/2007 4:42:13 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgabd92ab" class="outline-3">
<h3 id="orgabd92ab">General Tso's Cauliflower</h3>
<div class="outline-text-3" id="text-orgabd92ab">
<p>
Prep time 15 mins
Cook time 15 mins
Total time 30 mins
Serves: 6-8 servings
</p>
</div>
<div id="outline-container-org5cae75f" class="outline-4">
<h4 id="org5cae75f">Ingredients</h4>
<div class="outline-text-4" id="text-org5cae75f">
</div>
<ul class="org-ul">
<li><a id="org009d869"></a>for the General Tso’s sauce:<br />
<div class="outline-text-5" id="text-org009d869">
<ul class="org-ul">
<li>1 tablespoon sesame oil</li>
<li>3 cloves garlic, minced</li>
<li>1 knob of ginger, grated</li>
<li>1/2 cup chicken or vegetable broth</li>
<li>1/2 cup soy sauce</li>
<li>1/3 cup rice vinegar</li>
<li>1/4 cup sugar (more to taste)</li>
<li>2 tablespoons tomato paste</li>
<li>2 tablespoons cornstarch, dissolved in 1-2 tablespoons of cold water</li>
</ul>
</div>
</li>
<li><a id="org22a430c"></a>for the Batter:<br />
<div class="outline-text-5" id="text-org22a430c">
<ul class="org-ul">
<li>1 cup flour</li>
<li>2/3 cup cornstarch</li>
<li>1 1/2 teaspoons baking powder</li>
<li>2 teaspoons salt</li>
<li>4 eggs</li>
<li>water as needed (about 1/2 cup)</li>
</ul>
</div>
</li>
<li><a id="org802ac53"></a>other ingredients:<br />
<div class="outline-text-5" id="text-org802ac53">
<ul class="org-ul">
<li>1 head cauliflower, cut into small florets</li>
<li>a deep layer of oil for frying</li>
<li>scallions and sesame seeds for topping</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org74832a3" class="outline-4">
<h4 id="org74832a3">Instructions</h4>
<div class="outline-text-4" id="text-org74832a3">
</div>
<ul class="org-ul">
<li><a id="org065b35c"></a>General Tso’s Sauce:<br />
<div class="outline-text-5" id="text-org065b35c">
<ol class="org-ol">
<li>Heat the sesame oil in a small saucepan over medium low heat.</li>
<li>Add the ginger and garlic and stir fry for a minute or two.</li>
<li>Add remaining ingredients and whisk to combine.</li>
<li>Bring to a low boil; simmer for another 20-30 minutes or until sauce is thickened.</li>
<li>Add more sweetness, citrus, etc. to your taste.</li>
</ol>
</div>
</li>
<li><a id="org15c606a"></a>Cauliflower Batter:<br />
<div class="outline-text-5" id="text-org15c606a">
<ol class="org-ol">
<li>Whisk all the batter ingredients until a loose batter forms.The batter should be thick enough to cling to the cauliflower and cover it but stay loose enough to easily drip off (adjust thickness with water).</li>
</ol>
</div>
</li>
<li><a id="org7da82f9"></a>Cauliflower Frying:<br />
<div class="outline-text-5" id="text-org7da82f9">
<ol class="org-ol">
<li>Pour oil into a heavy bottomed skillet to make it deep enough so it will cover the cauliflower about halfway (probably ends up being a few cups).</li>
<li>Heat the oil over medium heat.</li>
<li>Drop a small bit of batter in the oil to test it – when it rises to the top and bubbles, the oil is ready.</li>
<li>Dip cauliflower florets in the batter and let the excess drip off before gently setting in the oil.</li>
<li>Fry for a few minutes on each side, then flip, repeating sides several times if necessary until you get a nice golden brown fried exterior.</li>
<li>The additional frying time helps make it a little crunchier, which I very much like.</li>
<li>Remove and set on a cooling rack with paper towels underneath (again, rather than putting it all on a plate or bowl with paper towels, this keeps it crispy vs. soggy).</li>
</ol>
</div>
</li>
<li><a id="org0f74ccd"></a>Serving:<br />
<div class="outline-text-5" id="text-org0f74ccd">
<ol class="org-ol">
<li>Toss the fried cauliflower with the sauce (enough just to cover) and sprinkle with scallions and sesame seeds for serving.</li>
<li>Serve with rice.</li>
</ol>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org9c49ca8" class="outline-3">
<h3 id="org9c49ca8">General Tso's Tofu</h3>
<div class="outline-text-3" id="text-org9c49ca8">
<p>
Prep time 15 mins
Cook time 15 mins
Total time 30 mins
Serves: 4 servings
</p>
</div>
<div id="outline-container-orgb4267d7" class="outline-4">
<h4 id="orgb4267d7">Ingredients</h4>
<div class="outline-text-4" id="text-orgb4267d7">
</div>
<ul class="org-ul">
<li><a id="org57c08f6"></a>For the tofu:<br />
<div class="outline-text-5" id="text-org57c08f6">
<ul class="org-ul">
<li>1½ tablespoons honey</li>
<li>2 teaspoons Louisiana hot sauce, such as Crystal</li>
<li>1 block of regular or firm tofu, drained, pat dry, and cut into 1-inch squares</li>
<li>1 ½ tablespoons sesame seeds</li>
<li>2 to 3 tablespoons cornstarch (depending on how wet the tofu is)</li>
<li>⅓ cup peanut or canola oil, for shallow frying</li>
</ul>
</div>
</li>
