recipes.org
**** For the rest of the dish:
- ½ teaspoon minced ginger
- 2 cloves minced garlic
- 7 whole dried Chinese red chili peppers (optional)
- ½ of a red bell pepper, cut into large pieces
- ½ tablespoon Shaoxing wine
- 1 cup water or vegetable stock
- 2 cups broccoli florets
- 1½ tablespoons light soy sauce
- 1 teaspoon dark soy sauce
- 2 teaspoons rice vinegar
- ¼ teaspoon salt
- 1 tablespoon sugar
- ½ teaspoon sesame oil
- 1½ tablespoons cornstarch, mixed with 1 tablespoon water
*** Instructions
1. Mix the honey and Louisiana hot sauce in a bowl until well combined. Add the tofu to the bowl, and toss together gently with a spatula until the tofu is well-coated.
2. Next, sprinkle the sesame seeds over the tofu, and toss until evenly distributed. Next, sprinkle the cornstarch over the tofu until lightly coated. If the tofu is still too wet, add a little more cornstarch.
3. Heat ⅓ cup oil in a medium-sized frying pan (we like to use a cast iron skillet) until the oil is about 350F, or when a bamboo chopstick bubbles when inserted into the oil. If you want to make the tofu frying easier, use more oil to achieve a deep fry.
4. Carefully place the tofu pieces into the pan, ensuring that the pieces are not touching, and let fry for about 2 minutes. Turn them over to continue frying on the other side. Work quickly and turn the heat down if you need more time for turning, or if you see they are starting to burn. Continue to cook the tofu until a nice crust is formed, and they turn golden brown (about 4-5 minutes time in total). Transfer the tofu pieces to a sheet pan with a slotted spoon.
5. Heat your wok over medium heat, and add 1 tablespoon of the oil left from tofu-frying, and add the ginger. After 10 seconds, add the garlic and the whole dried chili peppers, and stir for 15 seconds. Next, stir in the red bell peppers and Shaoxing wine.
6. Now add the water or vegetable stock, and let the mixture come up to a boil. Add the broccoli florets.
7. Immediately add the soy sauces, rice vinegar, salt, sugar, and sesame oil. Let the mixture come up to a boil. Immediately add the cornstarch mixture slowly while stirring.
8. The sauce should be thick enough to coat a spoon. Feel free to add more or less of the cornstarch mixture depending on how thick you like your sauce, but give it 30 seconds to 1 minute between additions, as it does take some time for the sauce to thicken.
9. Toss in your fried tofu and give everything a quick stir to make sure the tofu is coated. Serve with steamed rice!
** Grilled Corn and Sweet Onion Salad
*** Ingredients
- 12 ears of corn, husks and silk removed
- 1/4 cup aged sherry vinegar
- 1 tablespoon Dijon mustard
- 1 garlic clove, minced
- 1/2 cup olive oil, plus extra for brushing the corn
- 2 large red bell peppers, diced
- 1 large Vidalia onion, thinly sliced (or use a Maui or Walla Walla onion)
- 4 ripe plum tomatoes, finely chopped
- 1 jalapeno pepper, finely chopped
- 1/4 cup finely chopped chives
- kosher salt and freshly ground pepper
*** Method
1. Preheat a gas or charcoal grill to medium.
2. In a large pot of boiling water, over high heat, cook the corn 5 minutes until barely tender. Brush with olive oil and grill until slightly charred on all sides, above 2 minutes.
3. Remove from the grill and with a sharp knife, scrape the kernels into a medium bowl, or stand each ear on a cutting surface and scrape downward to remove the kernels.
4. Combine the vinegar, mustard and garlic in a large bowl and slowly whisk in the remaining 1/2 cup olive oil until emulsified.
5. Add the corn kernels, bell peppers, onion and tomatoes, jalapeno and chives.
6. Toss to coat with the dressing.
7. Season with salt and pepper.
*** Yield makes 8 servings
*** Credits
- Bobby Flay's Boy Meets Grill
    - Hyperion's New York, 1999, page 200
- http://www.foodnetwork.com/recipes/bobby-flay/grilled-corn-sweet-onion-salad-recipe.html
- (date created: 7/10/2010 3:08:29 PM)
** Grilled Vegetable Gratin
*** Ingredients
- 2 large eggplants (2 pounds)
- 2 large bell peppers
- olive oil
- 2 large red onions, peeled and sliced
- 3 cloves garlic, chopped
- 2 T olive oil
- 4 c tomatoes, peeled and chopped
- 3 T fresh basil, chopped
- 3 T parsley, chopped
- 1-2 t fresh oregano, chopped
- salt and pepper
- 1/2 c dry red wine
- 1 pound rigatoni
- 1/2 pound mozzarella, grated
*** Method
1. Slice the eggplants lengthwise, into  1/2-in slices. Salt each slice on both sides and let sit for 30-45 minutes, until sweating a tan-colored water. Rinse each slice for just a second and pat dry. 
2. Quarter the peppers lengthwise and remove seeds and stems.
3. Brush eggplants and peppers with olive oil and grill over charcoal: eggplant, until tender, peppers (skin side down), until charred. Put the peppers in paper bag for a few minutes, then remove the skins. Cut eggplant and peppers into wide strips and set aside.
4. Heat 2 T olive oil, then saute onion and garlic until golden. Add 3 c tomatoes, the herbs, salt and pepper, and the wine. Simmer until thickened, about 30 minutes.
5. Preheat oven to 350 degrees and oil the gratin dish.
6. Cook the rigatoni until just al dente. Drain and mix with tomato sauce and grilled vegetables.
7. Pour into gratin dish, sprinkle with remaining tomatoes and mozzarella cheese.
8. Bake until very hot and cheese is beginning to color, about 30-40 minutes. If you like a brown, bubbly gratin topping, place under the broiler for a minute.
9. Serve immediately.
*** Credits
- (date created: 9/5/2010 10:02:09 PM)
** Mexican Lasagna
*** Ingredients
- 1 pound canned pinto, pink or black beans, drained and rinsed
- 14 ounce can diced or stewed tomatoes
- 4 ounce can chopped mild green chilies
- 2 cups frozen corn kernels, thawed
- 2 scallions
- 1/2 tsp ground cumin
- 1/2 tsp dried oregano
- 8 corn tortillas
- 1 1/2 cups grated cheese (Monterrey Jack or cheddar)
- reduced-fat sour cream
*** Method
1. Preheat the oven to 400 degrees
2. Combine the first 7 ingredients in a mixing bowl. Mix thoroughly.
3. Lightly oil a wide, 2-quart casserole dish and layer as follows:
     - 4 tortillas, overlapping each other
     - half the bean mixture
     - half the cheese
4. Repeat layers.
5. Bake the casserole for 12 to 15 minutes, until cheese is bubbly. Let stand for a minute or two, then cut into squares to serve. Top with sour cream, if desired.
*** Credits
- From Debbie Rowett, 26 March 2004
- (date created: 6/27/2007 4:42:13 PM)
** Mushroom Pate
