recipes.html
<li><a id="org45e55ce"></a>For the rest of the dish:<br />
<div class="outline-text-5" id="text-org45e55ce">
<ul class="org-ul">
<li>½ teaspoon minced ginger</li>
<li>2 cloves minced garlic</li>
<li>7 whole dried Chinese red chili peppers (optional)</li>
<li>½ of a red bell pepper, cut into large pieces</li>
<li>½ tablespoon Shaoxing wine</li>
<li>1 cup water or vegetable stock</li>
<li>2 cups broccoli florets</li>
<li>1½ tablespoons light soy sauce</li>
<li>1 teaspoon dark soy sauce</li>
<li>2 teaspoons rice vinegar</li>
<li>¼ teaspoon salt</li>
<li>1 tablespoon sugar</li>
<li>½ teaspoon sesame oil</li>
<li>1½ tablespoons cornstarch, mixed with 1 tablespoon water</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgfa6a5bb" class="outline-4">
<h4 id="orgfa6a5bb">Instructions</h4>
<div class="outline-text-4" id="text-orgfa6a5bb">
<ol class="org-ol">
<li>Mix the honey and Louisiana hot sauce in a bowl until well combined. Add the tofu to the bowl, and toss together gently with a spatula until the tofu is well-coated.</li>
<li>Next, sprinkle the sesame seeds over the tofu, and toss until evenly distributed. Next, sprinkle the cornstarch over the tofu until lightly coated. If the tofu is still too wet, add a little more cornstarch.</li>
<li>Heat ⅓ cup oil in a medium-sized frying pan (we like to use a cast iron skillet) until the oil is about 350F, or when a bamboo chopstick bubbles when inserted into the oil. If you want to make the tofu frying easier, use more oil to achieve a deep fry.</li>
<li>Carefully place the tofu pieces into the pan, ensuring that the pieces are not touching, and let fry for about 2 minutes. Turn them over to continue frying on the other side. Work quickly and turn the heat down if you need more time for turning, or if you see they are starting to burn. Continue to cook the tofu until a nice crust is formed, and they turn golden brown (about 4-5 minutes time in total). Transfer the tofu pieces to a sheet pan with a slotted spoon.</li>
<li>Heat your wok over medium heat, and add 1 tablespoon of the oil left from tofu-frying, and add the ginger. After 10 seconds, add the garlic and the whole dried chili peppers, and stir for 15 seconds. Next, stir in the red bell peppers and Shaoxing wine.</li>
<li>Now add the water or vegetable stock, and let the mixture come up to a boil. Add the broccoli florets.</li>
<li>Immediately add the soy sauces, rice vinegar, salt, sugar, and sesame oil. Let the mixture come up to a boil. Immediately add the cornstarch mixture slowly while stirring.</li>
<li>The sauce should be thick enough to coat a spoon. Feel free to add more or less of the cornstarch mixture depending on how thick you like your sauce, but give it 30 seconds to 1 minute between additions, as it does take some time for the sauce to thicken.</li>
<li>Toss in your fried tofu and give everything a quick stir to make sure the tofu is coated. Serve with steamed rice!</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org28b31f1" class="outline-3">
<h3 id="org28b31f1">Grilled Corn and Sweet Onion Salad</h3>
<div class="outline-text-3" id="text-org28b31f1">
</div>
<div id="outline-container-org5def909" class="outline-4">
<h4 id="org5def909">Ingredients</h4>
<div class="outline-text-4" id="text-org5def909">
<ul class="org-ul">
<li>12 ears of corn, husks and silk removed</li>
<li>1/4 cup aged sherry vinegar</li>
<li>1 tablespoon Dijon mustard</li>
<li>1 garlic clove, minced</li>
<li>1/2 cup olive oil, plus extra for brushing the corn</li>
<li>2 large red bell peppers, diced</li>
<li>1 large Vidalia onion, thinly sliced (or use a Maui or Walla Walla onion)</li>
<li>4 ripe plum tomatoes, finely chopped</li>
<li>1 jalapeno pepper, finely chopped</li>
<li>1/4 cup finely chopped chives</li>
<li>kosher salt and freshly ground pepper</li>
</ul>
</div>
</div>
<div id="outline-container-org5273f8d" class="outline-4">
<h4 id="org5273f8d">Method</h4>
<div class="outline-text-4" id="text-org5273f8d">
<ol class="org-ol">
<li>Preheat a gas or charcoal grill to medium.</li>
<li>In a large pot of boiling water, over high heat, cook the corn 5 minutes until barely tender. Brush with olive oil and grill until slightly charred on all sides, above 2 minutes.</li>
<li>Remove from the grill and with a sharp knife, scrape the kernels into a medium bowl, or stand each ear on a cutting surface and scrape downward to remove the kernels.</li>
<li>Combine the vinegar, mustard and garlic in a large bowl and slowly whisk in the remaining 1/2 cup olive oil until emulsified.</li>
<li>Add the corn kernels, bell peppers, onion and tomatoes, jalapeno and chives.</li>
<li>Toss to coat with the dressing.</li>
<li>Season with salt and pepper.</li>
</ol>
</div>
</div>
<div id="outline-container-org717c917" class="outline-4">
<h4 id="org717c917">Yield makes 8 servings</h4>
</div>
<div id="outline-container-org9b466e7" class="outline-4">
<h4 id="org9b466e7">Credits</h4>
<div class="outline-text-4" id="text-org9b466e7">
<ul class="org-ul">
<li>Bobby Flay's Boy Meets Grill
<ul class="org-ul">
<li>Hyperion's New York, 1999, page 200</li>
</ul></li>
<li><a href="http://www.foodnetwork.com/recipes/bobby-flay/grilled-corn-sweet-onion-salad-recipe.html">http://www.foodnetwork.com/recipes/bobby-flay/grilled-corn-sweet-onion-salad-recipe.html</a></li>
<li>(date created: 7/10/2010 3:08:29 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga2354dd" class="outline-3">
<h3 id="orga2354dd">Grilled Vegetable Gratin</h3>
<div class="outline-text-3" id="text-orga2354dd">
</div>
<div id="outline-container-org5f3076d" class="outline-4">
<h4 id="org5f3076d">Ingredients</h4>
<div class="outline-text-4" id="text-org5f3076d">
<ul class="org-ul">
<li>2 large eggplants (2 pounds)</li>
<li>2 large bell peppers</li>
<li>olive oil</li>
<li>2 large red onions, peeled and sliced</li>
<li>3 cloves garlic, chopped</li>
<li>2 T olive oil</li>
<li>4 c tomatoes, peeled and chopped</li>
<li>3 T fresh basil, chopped</li>
<li>3 T parsley, chopped</li>
<li>1-2 t fresh oregano, chopped</li>
<li>salt and pepper</li>
<li>1/2 c dry red wine</li>
<li>1 pound rigatoni</li>
<li>1/2 pound mozzarella, grated</li>
</ul>
</div>
</div>
<div id="outline-container-org76c1b21" class="outline-4">
<h4 id="org76c1b21">Method</h4>
<div class="outline-text-4" id="text-org76c1b21">
<ol class="org-ol">
<li>Slice the eggplants lengthwise, into  1/2-in slices. Salt each slice on both sides and let sit for 30-45 minutes, until sweating a tan-colored water. Rinse each slice for just a second and pat dry.</li>
<li>Quarter the peppers lengthwise and remove seeds and stems.</li>
<li>Brush eggplants and peppers with olive oil and grill over charcoal: eggplant, until tender, peppers (skin side down), until charred. Put the peppers in paper bag for a few minutes, then remove the skins. Cut eggplant and peppers into wide strips and set aside.</li>
<li>Heat 2 T olive oil, then saute onion and garlic until golden. Add 3 c tomatoes, the herbs, salt and pepper, and the wine. Simmer until thickened, about 30 minutes.</li>
<li>Preheat oven to 350 degrees and oil the gratin dish.</li>
<li>Cook the rigatoni until just al dente. Drain and mix with tomato sauce and grilled vegetables.</li>
<li>Pour into gratin dish, sprinkle with remaining tomatoes and mozzarella cheese.</li>
<li>Bake until very hot and cheese is beginning to color, about 30-40 minutes. If you like a brown, bubbly gratin topping, place under the broiler for a minute.</li>
<li>Serve immediately.</li>
</ol>
</div>
</div>
<div id="outline-container-org58a00af" class="outline-4">
<h4 id="org58a00af">Credits</h4>
<div class="outline-text-4" id="text-org58a00af">
<ul class="org-ul">
<li>(date created: 9/5/2010 10:02:09 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8797f2a" class="outline-3">
<h3 id="org8797f2a">Mexican Lasagna</h3>
<div class="outline-text-3" id="text-org8797f2a">
</div>
<div id="outline-container-org3f87a6d" class="outline-4">
<h4 id="org3f87a6d">Ingredients</h4>
<div class="outline-text-4" id="text-org3f87a6d">
<ul class="org-ul">
<li>1 pound canned pinto, pink or black beans, drained and rinsed</li>
<li>14 ounce can diced or stewed tomatoes</li>
<li>4 ounce can chopped mild green chilies</li>
<li>2 cups frozen corn kernels, thawed</li>
<li>2 scallions</li>
<li>1/2 tsp ground cumin</li>
<li>1/2 tsp dried oregano</li>
<li>8 corn tortillas</li>
<li>1 1/2 cups grated cheese (Monterrey Jack or cheddar)</li>
<li>reduced-fat sour cream</li>
</ul>
</div>
</div>
<div id="outline-container-org4eba46c" class="outline-4">
<h4 id="org4eba46c">Method</h4>
<div class="outline-text-4" id="text-org4eba46c">
<ol class="org-ol">
<li>Preheat the oven to 400 degrees</li>
<li>Combine the first 7 ingredients in a mixing bowl. Mix thoroughly.</li>
<li>Lightly oil a wide, 2-quart casserole dish and layer as follows:
<ul class="org-ul">
<li>4 tortillas, overlapping each other</li>
<li>half the bean mixture</li>
<li>half the cheese</li>
</ul></li>
<li>Repeat layers.</li>
<li>Bake the casserole for 12 to 15 minutes, until cheese is bubbly. Let stand for a minute or two, then cut into squares to serve. Top with sour cream, if desired.</li>
</ol>
</div>
</div>
<div id="outline-container-org623b141" class="outline-4">
<h4 id="org623b141">Credits</h4>
<div class="outline-text-4" id="text-org623b141">
<ul class="org-ul">
<li>From Debbie Rowett, 26 March 2004</li>
<li>(date created: 6/27/2007 4:42:13 PM)</li>
</ul>
</div>
</div>
</div>
