recipes.org
*** Ingredients
- 1/2 large onion, chopped
- 2 scallions, chopped
- 4 cloves garlic, minced
- 1 1/2 cup of mushrooms, minced
- 2 tablespoons of sherry
- 1 tablespoon of olive oil
- 2 stalks celery, minced
- 1/2 cup of walnuts
- 1/2 cup of bread crumbs, whole grain
- 1 pinch of rosemary
- 1/2 teaspoon of thyme
- 1 tablespoon of tamari sauce
- 1/2 teaspoon of basil, fresh, of course
*** Method
1. Heat oil in skillet and add onion. Saute, stirring, until limp but not browned. Add mushrooms, garlic and sherry. Saute one - two minutes until mushrooms begin to juice. Stir in rosemary, thyme, tamari, salt and basil. 
2. Put remaining ingredients into food processor and combine until minced. Add mushroom mixture and blend. Put mixture into bowl and refrigerate two hours. 
3. Spread on bread and crackers or hollow out a loaf of French bread and stuff.
*** Credits
- http://www.basic-recipes.com/r/p/mushroom3.htm 28Dec08
- (date created: 12/18/2008 9:01:35 AM)
** Noodle Kugel
*** Ingredients
- 3 Eggs
- 1 Tbsp of Cinnamon
- 1 Tbsp Vanilla Extract
- 2 - 2.5 Cups of Sugar (all depends on how sweet you like it)
- 1 lb Bag of Broad Noodles
- 1.5 lbs Container of Cottage Cheese
- 1 lb Container of Sour Cream
- 2 Sticks of Unsalted Butter
- 1 Aluminum Lasagna Pan
- 1 Small Box of Corn Flakes
*** Method
1. Beat 3 eggs. 
2. Melt 1 Stick of Butter.
3. Boil Noodles.  Drain.  
4. Put noodles, Cottage Cheese, Sour Cream, Sugar, Eggs, Cinnamon, Vanilla Extract and melted butter into a large bowl and mix.  Once mixed pour contents into the Aluminum Lasagna pan.
5. Take Corn Flakes and put them in a zip lock bag.  Crush.
6. Once crushed, sprinkle Corn Flake Crumbs over the top of the entire Kugel.  Take the remaining stick of butter and cut into thin pieces and dot the top of the kugel
7. Bake in over for 90 minutes at about 400.
*** Credits
- Sandy Tootleman, 2-April-2012 (Spring Fling 2012)
- (date created: 4/2/2012 4:29:56 PM)
** Pasta Quills with Cheesy Aubergine (Eggplant) Sauce
Serves 6
*** Ingredients
- 1 1/4 lb. eggplant, cut into 1/2 in cubes
- salt & pepper
- 3 tbsp. olive oil
- 1/2 oz. butter or margarine
- 1 garlic clove, chopped
- 16 fl. oz canned chopped tomatoes
- 12 oz. pasta quills (penne)
- 4 oz. firm goat cheese, cubed
- 3 tbsp. shredded fresh basil or 1 tsp. dried basil
*** Method
1. Put the eggplant cubes in a large colander and sprinkle them lightly with salt. Let drain at least 30 minutes.
2. Rinse the eggplant under cold water and drain well. Dry on kitchen paper.
3. Heat the oil and butter in a large saucepan. Add the eggplant and fry until just golden on all sides, stirring frequently.
4. Stir in the garlic and tomatoes. Simmer until thickened, about 15 minutes. Season with salt & pepper.
5. Cook the penne in a large pan of boiling salted water until just tender (check packet instructions for timing). Drain well and transfer to a warmed serving bowl.
6. Add the eggplant sauce, goat cheese and basil to the pasta and toss well together. Serve immediately.
*** Credits
- Marsha Montgomery 10 June 2003
- (date created: 6/27/2007 4:42:13 PM)
** Chicago-Style Deep-Dish Pizza
*** Dough
**** Ingredients
- 2 packages rapid rise dry yeast
- 2 cups warm water
- 1/2 cup vegetable oil
- 4 tablespoons olive oil
- 1/2 cup cornmeal
- 5 1/2 cups flour
**** Method
1. 
     a. In the bowl of a stand mixer (e.g. KitchenAid), dissolve the yeast in the water.
     b. Add the vegetable oil, olive oil, cornmeal, and half of the flour.
     c. Beat for 10 minutes.
     d. Attach the dough hook and mix in the remaining flour.
     e. Knead for several minutes with the mixer. /(Note: because the dough is very rich and moist, it would be difficult to do this by hand.)/
2. 
     a. Remove dough and place on a clean counter-top.
     b. Cover with a very large metal bowl and allow to rise until double in bulk.
     c. Punch down and allow to rise again.
     d. Punch down a second time and you are ready to make pizza!
     e. Pre-heat oven to 475 degreesF.
3. 
     a. Oil your deep-dish pizza pan.
     b. Depending on the size of your pan, place some dough in the pan and push it out to the edges using your fingers.
     c. Put in enough dough so that you can run the crust right up the side of the pan.
     d. Make it about 1/8-inch thick throughout the pan.
*** Toppings
**** Ingredients
- 1/3 pound sliced mozzarella cheese
- 2 cups Italian-style whole peeled tomatoes, drained and squished
- 1 teaspoon basil
- 1 teaspoon oregano
- 2 cloves garlic, minced
- Salt to taste
- 3 tablespoons grated Parmesan cheese
- 3 tablespoons olive oil
**** Method
1. Place the cheese in tile-like layers on the bottom of the pie.
2. Next put in the tomatoes and the basil, oregano, garlic, and salt, reserving the Parmesan cheese for the top.
3. Drizzle olive oil over the top of the pie and you are ready to bake.
4. Bake the pie in a 475 degreesF oven until the top is golden and gooey and the crust a light golden brown, about 35 to 40 minutes.
*** Credits
https://www.pizzamaking.com/deepdish.php
JC found this after Nancy made America's Test Kitchen's version of Uno's deep-dish pizza.
** Vegetable Pot Pie
*** Ingredients
- 1 cup potato, diced
- 1 cup onion, diced
- 1 cup celery, diced
- 1 cup carrot, diced
- 1/3 cup melted butter
- 1/2 cup all-purpose flour
- 2 cups vegetable broth
- 1 cup half-and-half
- 1 teaspoon salt
- 1/4 teaspoon pepper
- 1/2 teaspoon of rosemary (optional)
- 1/2 teaspoon of thyme (optional)
- 1/2 cup TVP and/or mock meat (optional)
- 1 pie crust (either store bought or your own recipe)
