recipes.html
<div id="outline-container-orgb0d77c0" class="outline-3">
<h3 id="orgb0d77c0">Mushroom Pate</h3>
<div class="outline-text-3" id="text-orgb0d77c0">
</div>
<div id="outline-container-org29c4ccf" class="outline-4">
<h4 id="org29c4ccf">Ingredients</h4>
<div class="outline-text-4" id="text-org29c4ccf">
<ul class="org-ul">
<li>1/2 large onion, chopped</li>
<li>2 scallions, chopped</li>
<li>4 cloves garlic, minced</li>
<li>1 1/2 cup of mushrooms, minced</li>
<li>2 tablespoons of sherry</li>
<li>1 tablespoon of olive oil</li>
<li>2 stalks celery, minced</li>
<li>1/2 cup of walnuts</li>
<li>1/2 cup of bread crumbs, whole grain</li>
<li>1 pinch of rosemary</li>
<li>1/2 teaspoon of thyme</li>
<li>1 tablespoon of tamari sauce</li>
<li>1/2 teaspoon of basil, fresh, of course</li>
</ul>
</div>
</div>
<div id="outline-container-orgc1d1398" class="outline-4">
<h4 id="orgc1d1398">Method</h4>
<div class="outline-text-4" id="text-orgc1d1398">
<ol class="org-ol">
<li>Heat oil in skillet and add onion. Saute, stirring, until limp but not browned. Add mushrooms, garlic and sherry. Saute one - two minutes until mushrooms begin to juice. Stir in rosemary, thyme, tamari, salt and basil.</li>
<li>Put remaining ingredients into food processor and combine until minced. Add mushroom mixture and blend. Put mixture into bowl and refrigerate two hours.</li>
<li>Spread on bread and crackers or hollow out a loaf of French bread and stuff.</li>
</ol>
</div>
</div>
<div id="outline-container-org6016dc3" class="outline-4">
<h4 id="org6016dc3">Credits</h4>
<div class="outline-text-4" id="text-org6016dc3">
<ul class="org-ul">
<li><a href="http://www.basic-recipes.com/r/p/mushroom3.htm">http://www.basic-recipes.com/r/p/mushroom3.htm</a> 28Dec08</li>
<li>(date created: 12/18/2008 9:01:35 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7b0fa8c" class="outline-3">
<h3 id="org7b0fa8c">Noodle Kugel</h3>
<div class="outline-text-3" id="text-org7b0fa8c">
</div>
<div id="outline-container-orga902e81" class="outline-4">
<h4 id="orga902e81">Ingredients</h4>
<div class="outline-text-4" id="text-orga902e81">
<ul class="org-ul">
<li>3 Eggs</li>
<li>1 Tbsp of Cinnamon</li>
<li>1 Tbsp Vanilla Extract</li>
<li>2 - 2.5 Cups of Sugar (all depends on how sweet you like it)</li>
<li>1 lb Bag of Broad Noodles</li>
<li>1.5 lbs Container of Cottage Cheese</li>
<li>1 lb Container of Sour Cream</li>
<li>2 Sticks of Unsalted Butter</li>
<li>1 Aluminum Lasagna Pan</li>
<li>1 Small Box of Corn Flakes</li>
</ul>
</div>
</div>
<div id="outline-container-org7d18bfd" class="outline-4">
<h4 id="org7d18bfd">Method</h4>
<div class="outline-text-4" id="text-org7d18bfd">
<ol class="org-ol">
<li>Beat 3 eggs.</li>
<li>Melt 1 Stick of Butter.</li>
<li>Boil Noodles.  Drain.</li>
<li>Put noodles, Cottage Cheese, Sour Cream, Sugar, Eggs, Cinnamon, Vanilla Extract and melted butter into a large bowl and mix.  Once mixed pour contents into the Aluminum Lasagna pan.</li>
<li>Take Corn Flakes and put them in a zip lock bag.  Crush.</li>
<li>Once crushed, sprinkle Corn Flake Crumbs over the top of the entire Kugel.  Take the remaining stick of butter and cut into thin pieces and dot the top of the kugel</li>
<li>Bake in over for 90 minutes at about 400.</li>
</ol>
</div>
</div>
<div id="outline-container-orgb1f2b3c" class="outline-4">
<h4 id="orgb1f2b3c">Credits</h4>
<div class="outline-text-4" id="text-orgb1f2b3c">
<ul class="org-ul">
<li>Sandy Tootleman, 2-April-2012 (Spring Fling 2012)</li>
<li>(date created: 4/2/2012 4:29:56 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7a7747f" class="outline-3">
<h3 id="org7a7747f">Pasta Quills with Cheesy Aubergine (Eggplant) Sauce</h3>
<div class="outline-text-3" id="text-org7a7747f">
<p>
Serves 6
</p>
</div>
<div id="outline-container-orgf133187" class="outline-4">
<h4 id="orgf133187">Ingredients</h4>
<div class="outline-text-4" id="text-orgf133187">
<ul class="org-ul">
<li>1 1/4 lb. eggplant, cut into 1/2 in cubes</li>
<li>salt &amp; pepper</li>
<li>3 tbsp. olive oil</li>
<li>1/2 oz. butter or margarine</li>
<li>1 garlic clove, chopped</li>
<li>16 fl. oz canned chopped tomatoes</li>
<li>12 oz. pasta quills (penne)</li>
<li>4 oz. firm goat cheese, cubed</li>
<li>3 tbsp. shredded fresh basil or 1 tsp. dried basil</li>
</ul>
</div>
</div>
<div id="outline-container-orgeb23604" class="outline-4">
<h4 id="orgeb23604">Method</h4>
<div class="outline-text-4" id="text-orgeb23604">
<ol class="org-ol">
<li>Put the eggplant cubes in a large colander and sprinkle them lightly with salt. Let drain at least 30 minutes.</li>
<li>Rinse the eggplant under cold water and drain well. Dry on kitchen paper.</li>
<li>Heat the oil and butter in a large saucepan. Add the eggplant and fry until just golden on all sides, stirring frequently.</li>
<li>Stir in the garlic and tomatoes. Simmer until thickened, about 15 minutes. Season with salt &amp; pepper.</li>
<li>Cook the penne in a large pan of boiling salted water until just tender (check packet instructions for timing). Drain well and transfer to a warmed serving bowl.</li>
<li>Add the eggplant sauce, goat cheese and basil to the pasta and toss well together. Serve immediately.</li>
</ol>
</div>
</div>
<div id="outline-container-org30022ee" class="outline-4">
<h4 id="org30022ee">Credits</h4>
<div class="outline-text-4" id="text-org30022ee">
<ul class="org-ul">
<li>Marsha Montgomery 10 June 2003</li>
<li>(date created: 6/27/2007 4:42:13 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc5617c0" class="outline-3">
<h3 id="orgc5617c0">Chicago-Style Deep-Dish Pizza</h3>
<div class="outline-text-3" id="text-orgc5617c0">
</div>
<div id="outline-container-org7a9e230" class="outline-4">
<h4 id="org7a9e230">Dough</h4>
<div class="outline-text-4" id="text-org7a9e230">
</div>
<ul class="org-ul">
<li><a id="org8004690"></a>Ingredients<br />
<div class="outline-text-5" id="text-org8004690">
<ul class="org-ul">
<li>2 packages rapid rise dry yeast</li>
<li>2 cups warm water</li>
<li>1/2 cup vegetable oil</li>
<li>4 tablespoons olive oil</li>
<li>1/2 cup cornmeal</li>
<li>5 1/2 cups flour</li>
</ul>
</div>
</li>
<li><a id="org346b2df"></a>Method<br />
<div class="outline-text-5" id="text-org346b2df">
<ol class="org-ol">
<li><ol class="org-ol">
<li>In the bowl of a stand mixer (e.g. KitchenAid), dissolve the yeast in the water.</li>
<li>Add the vegetable oil, olive oil, cornmeal, and half of the flour.</li>
<li>Beat for 10 minutes.</li>
<li>Attach the dough hook and mix in the remaining flour.</li>
<li>Knead for several minutes with the mixer. <i>(Note: because the dough is very rich and moist, it would be difficult to do this by hand.)</i></li>
</ol></li>
<li><ol class="org-ol">
<li>Remove dough and place on a clean counter-top.</li>
<li>Cover with a very large metal bowl and allow to rise until double in bulk.</li>
<li>Punch down and allow to rise again.</li>
<li>Punch down a second time and you are ready to make pizza!</li>
<li>Pre-heat oven to 475 degreesF.</li>
</ol></li>
<li><ol class="org-ol">
<li>Oil your deep-dish pizza pan.</li>
<li>Depending on the size of your pan, place some dough in the pan and push it out to the edges using your fingers.</li>
<li>Put in enough dough so that you can run the crust right up the side of the pan.</li>
<li>Make it about 1/8-inch thick throughout the pan.</li>
</ol></li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd0bde07" class="outline-4">
<h4 id="orgd0bde07">Toppings</h4>
<div class="outline-text-4" id="text-orgd0bde07">
</div>
<ul class="org-ul">
<li><a id="org888fc51"></a>Ingredients<br />
<div class="outline-text-5" id="text-org888fc51">
<ul class="org-ul">
<li>1/3 pound sliced mozzarella cheese</li>
<li>2 cups Italian-style whole peeled tomatoes, drained and squished</li>
<li>1 teaspoon basil</li>
<li>1 teaspoon oregano</li>
<li>2 cloves garlic, minced</li>
<li>Salt to taste</li>
<li>3 tablespoons grated Parmesan cheese</li>
<li>3 tablespoons olive oil</li>
</ul>
</div>
</li>
<li><a id="org5d0cb53"></a>Method<br />
<div class="outline-text-5" id="text-org5d0cb53">
<ol class="org-ol">
<li>Place the cheese in tile-like layers on the bottom of the pie.</li>
<li>Next put in the tomatoes and the basil, oregano, garlic, and salt, reserving the Parmesan cheese for the top.</li>
<li>Drizzle olive oil over the top of the pie and you are ready to bake.</li>
<li>Bake the pie in a 475 degreesF oven until the top is golden and gooey and the crust a light golden brown, about 35 to 40 minutes.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgeac22ab" class="outline-4">
<h4 id="orgeac22ab">Credits</h4>
<div class="outline-text-4" id="text-orgeac22ab">
<p>
<a href="https://www.pizzamaking.com/deepdish.php">https://www.pizzamaking.com/deepdish.php</a>
JC found this after Nancy made America's Test Kitchen's version of Uno's deep-dish pizza.
</p>
</div>
</div>
</div>
<div id="outline-container-org1cb9e5b" class="outline-3">
<h3 id="org1cb9e5b">Vegetable Pot Pie</h3>
<div class="outline-text-3" id="text-org1cb9e5b">
</div>
<div id="outline-container-org200fd94" class="outline-4">
<h4 id="org200fd94">Ingredients</h4>
<div class="outline-text-4" id="text-org200fd94">
<ul class="org-ul">
<li>1 cup potato, diced</li>
<li>1 cup onion, diced</li>
<li>1 cup celery, diced</li>
<li>1 cup carrot, diced</li>
<li>1/3 cup melted butter</li>
<li>1/2 cup all-purpose flour</li>
<li>2 cups vegetable broth</li>
<li>1 cup half-and-half</li>
<li>1 teaspoon salt</li>
<li>1/4 teaspoon pepper</li>
<li>1/2 teaspoon of rosemary (optional)</li>
<li>1/2 teaspoon of thyme (optional)</li>
<li>1/2 cup TVP and/or mock meat (optional)</li>
<li>1 pie crust (either store bought or your own recipe)</li>
</ul>
</div>
</div>
