recipes.org
*** Method
1. Preheat oven to 400 degrees F.
2. Saute onion, celery, carrots and potatoes in butter for 10 minutes.
3. Add flour to sauteed mixture, stirring well, cook one minute stirring constantly.
4. Combine broth and half and half.
5. Gradually stir into vegetable mixture.
6. Cook over medium heat stirring constantly until thickened and bubbly.
7. Stir in salt and pepper; add TVP and/or mock meat and stir well.
8. Pour into shallow 2 quart casserole dish and top with pie shells.
9. Cut slits to allow steam to escape.
10. Bake for 40-50 minutes or until pastry is golden brown and filling is bubbly and cooked through.
*** Credits
Recommended by Louise.
Prep Time: 1 hr
Total Time: 1 hr 45 mins
Servings: 6-8
** Quiche
*** Ingredients
- red onion
- red pepper
- 3 eggs
- 1 1/2 cup half-and-half
- 1 cup grated swiss
- spices (thyme, taragon...)
*** Method
1. 400 degrees for 35 minutes or until set.
*** Credits
- (date created: 6/27/2007 4:42:13 PM)
** Refried Bean, Zucchini and Corn Gratin
*** Ingredients
**** for the beans
- 3 cups simmered black beans or pinto beans, with liquid (see recipe)
- 2 tablespoons grapeseed or sunflower oil
- 2 teaspoons cumin seeds, ground
- 1 chipotle in adobo, seeded and minced (optional)
- Salt to taste
- 1 teaspoon mild or hot chili powder (more to taste)
**** for the squash:
- 2 tablespoons extra virgin olive oil
- ½ cup minced onion
- Salt to taste
- 2 garlic cloves, minced
- 1 ½ pounds zucchini or mixed zucchini and yellow squash, sliced about 1/4 inch thick
- ½ to 1 teaspoon oregano, preferably Mexican oregano, to taste
**** for the corn
- 2 cups corn kernels (fresh or frozen)
- 1 ¼ cups milk
- 1 serrano chile, minced
- ¼ cup cornmeal or polenta
- Salt to taste
- ½ cup grated asadero, Monterey Jack or pecorino
- ¼ cup crumbled queso cotijo, queso fresco, or feta
- 1 tablespoon butter or extra virgin olive oil
*** Method
1. Heat oven to 375 degrees. Oil or butter a 2-quart baking dish or gratin dish.
2. Refry beans: Drain off about 1/2 cup of liquid from beans, retaining it in a separate bowl to use later for moistening beans, should they dry out. Heat oil over medium-high heat in a large, heavy nonstick frying pan and add ground cumin and chili. Cook, stirring over medium heat, for about a minute, until the spices begin to sizzle and cook. Add beans and optional chipotle. Fry beans, stirring and mashing with the back of a spoon, until they thicken and form a thin crust on the bottom of the pan. Stir up crust and mix into the beans. Cook until beans are thick but not dry, about 10 minutes. Add liquid you saved from the beans if they seem too dry. Taste refried beans and adjust salt (they probably won't need any as the broth reduces when you refry them). Spread in an even layer in the baking dish. (Note: If you use canned beans, do not drain. The frying process will go more quickly.)
3. Clean and dry skillet. Heat over medium heat and add olive oil. Add onion and cook, stirring, until tender, about 5 minutes. Add a pinch of salt and garlic and cook, stirring, until garlic is fragrant, about 30 seconds. Add squash, oregano, salt and pepper, and turn up heat slightly. Cook, stirring often or tossing in pan, until squash is translucent and tender, 5 to 10 minutes. Taste and adjust seasoning. Spread in an even layer over the beans.
4. Combine corn and milk in a saucepan and bring to a simmer. Simmer 5 minutes, until corn is just tender. Stir in cornmeal and minced serrano, add salt to taste, and continue to simmer until mixture is thick, 3 to 5 minutes. Stir in grated cheese. Remove from heat and spread in an even layer over squash. Sprinkle crumbled cheese over top. Dot with butter or drizzle on oil.
5. Place in oven and bake 25 minutes, until bubbly and crumbled cheese is lightly browned. Serve hot or warm.
**** Tip
Advance preparation: The refried beans will keep for 3 or 4 days in the refrigerator, but you will need to moisten them before you assemble the gratin.
*** Credits
http://cooking.nytimes.com/recipes/1016969-refried-bean-zucchini-and-corn-gratin
[2016-07-13 Wed] TC made for JC and Doris; yum!
** Roasted Eggplant, Crisp Garlic, and Basil Pasta
*** Ingredients
- 8 medium baby japanese eggplant (or 1 Globe eggplant) ends trimmed
- 6 tablespoons olive oil divided plus more for garnish
- 4 sprigs fresh thyme (or oregano) leaves stripped
- kosher salt and freshly ground black pepper
- 6 medium garlic cloves thinly sliced
- 1 (14-ounce) can tomato puree
- 1 tablespoon balsamic or sherry vinegar
- 1 teaspoon unrefined cane sugar (optional)
- 12 ounces spaghetti
- 3 ounces feta or goat cheese crumbled
- 1 handful fresh basil leaves thinly sliced
*** Method
1. Heat oven to 450 degreesF and arrange a rack in the middle. Slice baby eggplant lengthwse or cut larger eggplant into 1-inch cubes then combine with half of the olive oil and the thyme or oregano. Season with salt and freshly ground black pepper and toss to combine. Spread on a silicone baking mat or foil-lined baking sheet in one even layer and roast, stirring a few times, until soft and golden brown, about 20 to 30 minutes.
2. Meanwhile,  bring a large pot of heavily salted water to a boil over high heat.
3. In a large frying pan, heat the remaining oil over medium-high heat. When it shimmers, add garlic and cook until garlic is crisp, golden brown, and fragrant. Remove garlic to a paper towel-lined plate and set aside.
4. Return pan with olive oil to the stove over medium heat and add the tomatoes and vinegar, sugar, season with salt, reduce heat to medium-low, and simmer, stirring occasionally, until slightly thickened, about 10 minutes
5. Meanwhile, when the water boils, cook pasta according to package directions. Reserve 1 cup of pasta water and drain pasta. Set aside.
6. Add eggplant to pasta sauce and simmer until heated through. Taste, and, add more vinegar if the sauce is sweet, or, as needed, add sugar to make the sauce sweeter.
7. Add reserved pasta to pasta sauce and stir to coat. Add 1/4 cup of the reserved pasta water and stir until each piece of pasta is just coated with the sauce. Add additional pasta water as needed to help the sauce coat the pasta. Remove from heat, top with cheese, basil, and crisp garlic and season with additional salt and pepper, as desired. Finish pasta with a drizzle of additional olive oil and serve.
