recipes.html
<div id="outline-container-org519f95f" class="outline-4">
<h4 id="org519f95f">Method</h4>
<div class="outline-text-4" id="text-org519f95f">
<ol class="org-ol">
<li>Preheat oven to 400 degrees F.</li>
<li>Saute onion, celery, carrots and potatoes in butter for 10 minutes.</li>
<li>Add flour to sauteed mixture, stirring well, cook one minute stirring constantly.</li>
<li>Combine broth and half and half.</li>
<li>Gradually stir into vegetable mixture.</li>
<li>Cook over medium heat stirring constantly until thickened and bubbly.</li>
<li>Stir in salt and pepper; add TVP and/or mock meat and stir well.</li>
<li>Pour into shallow 2 quart casserole dish and top with pie shells.</li>
<li>Cut slits to allow steam to escape.</li>
<li>Bake for 40-50 minutes or until pastry is golden brown and filling is bubbly and cooked through.</li>
</ol>
</div>
</div>
<div id="outline-container-orgf2215af" class="outline-4">
<h4 id="orgf2215af">Credits</h4>
<div class="outline-text-4" id="text-orgf2215af">
<p>
Recommended by Louise.
Prep Time: 1 hr
Total Time: 1 hr 45 mins
Servings: 6-8
</p>
</div>
</div>
</div>
<div id="outline-container-orgd93a50d" class="outline-3">
<h3 id="orgd93a50d">Quiche</h3>
<div class="outline-text-3" id="text-orgd93a50d">
</div>
<div id="outline-container-org8b7d0e7" class="outline-4">
<h4 id="org8b7d0e7">Ingredients</h4>
<div class="outline-text-4" id="text-org8b7d0e7">
<ul class="org-ul">
<li>red onion</li>
<li>red pepper</li>
<li>3 eggs</li>
<li>1 1/2 cup half-and-half</li>
<li>1 cup grated swiss</li>
<li>spices (thyme, taragon&#x2026;)</li>
</ul>
</div>
</div>
<div id="outline-container-org0e6cc61" class="outline-4">
<h4 id="org0e6cc61">Method</h4>
<div class="outline-text-4" id="text-org0e6cc61">
<ol class="org-ol">
<li>400 degrees for 35 minutes or until set.</li>
</ol>
</div>
</div>
<div id="outline-container-org0106c8b" class="outline-4">
<h4 id="org0106c8b">Credits</h4>
<div class="outline-text-4" id="text-org0106c8b">
<ul class="org-ul">
<li>(date created: 6/27/2007 4:42:13 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org98ee1b0" class="outline-3">
<h3 id="org98ee1b0">Refried Bean, Zucchini and Corn Gratin</h3>
<div class="outline-text-3" id="text-org98ee1b0">
</div>
<div id="outline-container-orgf4e5576" class="outline-4">
<h4 id="orgf4e5576">Ingredients</h4>
<div class="outline-text-4" id="text-orgf4e5576">
</div>
<ul class="org-ul">
<li><a id="orgd806c91"></a>for the beans<br />
<div class="outline-text-5" id="text-orgd806c91">
<ul class="org-ul">
<li>3 cups simmered black beans or pinto beans, with liquid (see recipe)</li>
<li>2 tablespoons grapeseed or sunflower oil</li>
<li>2 teaspoons cumin seeds, ground</li>
<li>1 chipotle in adobo, seeded and minced (optional)</li>
<li>Salt to taste</li>
<li>1 teaspoon mild or hot chili powder (more to taste)</li>
</ul>
</div>
</li>
<li><a id="orga1103e9"></a>for the squash:<br />
<div class="outline-text-5" id="text-orga1103e9">
<ul class="org-ul">
<li>2 tablespoons extra virgin olive oil</li>
<li>½ cup minced onion</li>
<li>Salt to taste</li>
<li>2 garlic cloves, minced</li>
<li>1 ½ pounds zucchini or mixed zucchini and yellow squash, sliced about 1/4 inch thick</li>
<li>½ to 1 teaspoon oregano, preferably Mexican oregano, to taste</li>
</ul>
</div>
</li>
<li><a id="org5e7d363"></a>for the corn<br />
<div class="outline-text-5" id="text-org5e7d363">
<ul class="org-ul">
<li>2 cups corn kernels (fresh or frozen)</li>
<li>1 ¼ cups milk</li>
<li>1 serrano chile, minced</li>
<li>¼ cup cornmeal or polenta</li>
<li>Salt to taste</li>
<li>½ cup grated asadero, Monterey Jack or pecorino</li>
<li>¼ cup crumbled queso cotijo, queso fresco, or feta</li>
<li>1 tablespoon butter or extra virgin olive oil</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org92e88e2" class="outline-4">
<h4 id="org92e88e2">Method</h4>
<div class="outline-text-4" id="text-org92e88e2">
<ol class="org-ol">
<li>Heat oven to 375 degrees. Oil or butter a 2-quart baking dish or gratin dish.</li>
<li>Refry beans: Drain off about 1/2 cup of liquid from beans, retaining it in a separate bowl to use later for moistening beans, should they dry out. Heat oil over medium-high heat in a large, heavy nonstick frying pan and add ground cumin and chili. Cook, stirring over medium heat, for about a minute, until the spices begin to sizzle and cook. Add beans and optional chipotle. Fry beans, stirring and mashing with the back of a spoon, until they thicken and form a thin crust on the bottom of the pan. Stir up crust and mix into the beans. Cook until beans are thick but not dry, about 10 minutes. Add liquid you saved from the beans if they seem too dry. Taste refried beans and adjust salt (they probably won't need any as the broth reduces when you refry them). Spread in an even layer in the baking dish. (Note: If you use canned beans, do not drain. The frying process will go more quickly.)</li>
<li>Clean and dry skillet. Heat over medium heat and add olive oil. Add onion and cook, stirring, until tender, about 5 minutes. Add a pinch of salt and garlic and cook, stirring, until garlic is fragrant, about 30 seconds. Add squash, oregano, salt and pepper, and turn up heat slightly. Cook, stirring often or tossing in pan, until squash is translucent and tender, 5 to 10 minutes. Taste and adjust seasoning. Spread in an even layer over the beans.</li>
<li>Combine corn and milk in a saucepan and bring to a simmer. Simmer 5 minutes, until corn is just tender. Stir in cornmeal and minced serrano, add salt to taste, and continue to simmer until mixture is thick, 3 to 5 minutes. Stir in grated cheese. Remove from heat and spread in an even layer over squash. Sprinkle crumbled cheese over top. Dot with butter or drizzle on oil.</li>
<li>Place in oven and bake 25 minutes, until bubbly and crumbled cheese is lightly browned. Serve hot or warm.</li>
</ol>
</div>
<ul class="org-ul">
<li><a id="orgb86cf4c"></a>Tip<br />
<div class="outline-text-5" id="text-orgb86cf4c">
<p>
Advance preparation: The refried beans will keep for 3 or 4 days in the refrigerator, but you will need to moisten them before you assemble the gratin.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org64a6ebf" class="outline-4">
<h4 id="org64a6ebf">Credits</h4>
<div class="outline-text-4" id="text-org64a6ebf">
<p>
<a href="http://cooking.nytimes.com/recipes/1016969-refried-bean-zucchini-and-corn-gratin">http://cooking.nytimes.com/recipes/1016969-refried-bean-zucchini-and-corn-gratin</a>
<span class="timestamp-wrapper"><span class="timestamp">[2016-07-13 Wed] </span></span> TC made for JC and Doris; yum!
</p>
</div>
</div>
</div>
<div id="outline-container-org88c92d1" class="outline-3">
<h3 id="org88c92d1">Roasted Eggplant, Crisp Garlic, and Basil Pasta</h3>
<div class="outline-text-3" id="text-org88c92d1">
</div>
<div id="outline-container-org2a920ee" class="outline-4">
<h4 id="org2a920ee">Ingredients</h4>
<div class="outline-text-4" id="text-org2a920ee">
<ul class="org-ul">
<li>8 medium baby japanese eggplant (or 1 Globe eggplant) ends trimmed</li>
<li>6 tablespoons olive oil divided plus more for garnish</li>
<li>4 sprigs fresh thyme (or oregano) leaves stripped</li>
<li>kosher salt and freshly ground black pepper</li>
<li>6 medium garlic cloves thinly sliced</li>
<li>1 (14-ounce) can tomato puree</li>
<li>1 tablespoon balsamic or sherry vinegar</li>
<li>1 teaspoon unrefined cane sugar (optional)</li>
<li>12 ounces spaghetti</li>
<li>3 ounces feta or goat cheese crumbled</li>
<li>1 handful fresh basil leaves thinly sliced</li>
</ul>
</div>
</div>
<div id="outline-container-org8ccb257" class="outline-4">
<h4 id="org8ccb257">Method</h4>
<div class="outline-text-4" id="text-org8ccb257">
<ol class="org-ol">
<li>Heat oven to 450 degreesF and arrange a rack in the middle. Slice baby eggplant lengthwse or cut larger eggplant into 1-inch cubes then combine with half of the olive oil and the thyme or oregano. Season with salt and freshly ground black pepper and toss to combine. Spread on a silicone baking mat or foil-lined baking sheet in one even layer and roast, stirring a few times, until soft and golden brown, about 20 to 30 minutes.</li>
<li>Meanwhile,  bring a large pot of heavily salted water to a boil over high heat.</li>
<li>In a large frying pan, heat the remaining oil over medium-high heat. When it shimmers, add garlic and cook until garlic is crisp, golden brown, and fragrant. Remove garlic to a paper towel-lined plate and set aside.</li>
<li>Return pan with olive oil to the stove over medium heat and add the tomatoes and vinegar, sugar, season with salt, reduce heat to medium-low, and simmer, stirring occasionally, until slightly thickened, about 10 minutes</li>
<li>Meanwhile, when the water boils, cook pasta according to package directions. Reserve 1 cup of pasta water and drain pasta. Set aside.</li>
<li>Add eggplant to pasta sauce and simmer until heated through. Taste, and, add more vinegar if the sauce is sweet, or, as needed, add sugar to make the sauce sweeter.</li>
<li>Add reserved pasta to pasta sauce and stir to coat. Add 1/4 cup of the reserved pasta water and stir until each piece of pasta is just coated with the sauce. Add additional pasta water as needed to help the sauce coat the pasta. Remove from heat, top with cheese, basil, and crisp garlic and season with additional salt and pepper, as desired. Finish pasta with a drizzle of additional olive oil and serve.</li>
</ol>
</div>
</div>
