recipes.org
*** Credits
http://saltandwind.com/recipes/38-late-summer-roasted-eggplant-pasta-recipe
** Southwestern Quiche With Potato Crust 
*** Ingredients
- 6 large eggs
- 1 tsp. salt
- 1.5 cups frozen shredded hash brown potatoes, thawed
- 1/2 medium red bell pepper, diced
- 1/2 cup fresh or frozen corn kernels, thawed if frozen
- 2 green onions (white and green parts), thinly sliced
- 2 tbsp. chopped fresh cilantro
- 3/4 cup shredded or crumbled Cheddar cheese
- 1/2 cup low-fat milk
- 2 chipotle chiles in adobo sauce, w/ 2 tsp. sauce reserved
*** Method
1. Preheat oven to 375 degrees F. Coat the pie dish with cooking spray. Whisk together 1 egg and 1/4 tsp. salt in a medium bowl. Stir in shredded hash browns. Press the potato mixture into the bottom and sides of the pie dish to form crust. Bake for 15 minutes, or until lightly browned.
2. Sprinkle the bell pepper, corn, green onions, cilantro, and cheese over the potato crust.
3. In a blender, mix together the remaining eggs, milk, 3/4 tsp. salt, chiles and adobo sauce. Pour mixture over vegetables in pie dish. Bake 20 to 25 minutes, or until knife inserted in center comes out clean. Let stand 5 minutes before serving.
4. Serves 6.
5. I served the quiche topped with avocado slices and good store-bought salsa (I had Mrs. Renfro's Black Bean Salsa on hand). It was quite tasty, and everyone wanted seconds. I'll make this again, but I think next time I'll serve it with some black beans or a salad on the side, to add some fiber, and maybe add a third chipotle pepper (love the smokey flavor they add). Adapted from January 2007 Vegetarian Times recipe.
*** Credits
- http://www.grouprecipes.com/20674/southwestern-quiche-with-potato-crust.html 11 August 2008
- (date created: 8/11/2008 12:14:31 PM)
** Spicy Black Bean Cakes
*** Lime Sour Cream:
**** Ingredients
- * 1/2 cup reduced fat sour cream
- * 2 teaspoons fresh lime juice
- * 1 small fresh jalapeno pepper, minced
- * salt to taste
**** Method
- Combine all ingredients.
*** Bean Cakes:
**** Ingredients
- 1/4 cup quinoa, dry
- 2 (14.5 ounce) cans black beans, drained and rinsed
- 2 tbsp olive oil
- 6 cloves garlic, pressed
- 2 fresh jalapeno peppers, finely diced and/or
- 1 chipotle jalapeno peppers, in adobo sauce
- 1 tablespoon ground cumin
- 1 tablespoon chili pepper
- salt and black pepper to taste
- 1 egg, lightly beaten
- 1/2 cup plain dried bread crumbs (optional)
- 1/2 cup corn kernels (optional)
**** Method
1) To prepare lime sour cream, mix the sour cream, lime juice, 1 small minced jalapeno, and salt together in a small bowl. Cover, and refrigerate.
2) Preheat oven to 375 degrees.
3) Cook the quinoa per instructions on package.  (Toast quinoa first, rinse then simmer 1/4 cup quinoa in 1/2 cup boiling water.) This will take about 10-15 minutes.
4) Puree black beans with olive oil, garlic, peppers and spices in a food processor.
5) Whisk egg in a medium-sized bowl.
6) Add black bean puree, cooked quinoa and bread crumbs (if using) to egg bowl and mix until fully combined into a batter.
7) Place 6 cupcake papers on a baking sheet.  Divide black bean cake batter among the 6 cups, and bake for about 15 to 20 minutes.
8) Allow black bean cakes to cool for a few minutes.  Remove from papers.  Serve over a bed of spinach with fresh salsa and grated cheese. Or over polenta or mashed potatoes.
9) Serve with lime sour cream.
*** Credits
- January 2011; inspired by 
- http://www.myplateisfullblog.com/2010/03/26/quinoa-black-bean-cakes/ and http://allrecipes.com//Recipe/spicy-black-bean-cakes/Detail.aspx
- (date created: 1/30/2011 4:42:14 PM)
** Thai Red Curry Summer Squash
by mlsawatzky of Sandbrook Meadow Farm
*** Ingredients
- 3 medium summer squash cubed
- 1 sweet onion, sliced
- 2 cloves of garlic sliced
- 2 TBLSP olive oil
- 1 - 2 TBLSP red curry paste (MASRE brand good)
- 1 - 2 cans coconut milk (lite is good)
- 1 1/4 TBLSP fish sauce
- 1 TBLSP brown sugar
- Salt
- Sweet (Thai) Basil
*** Method
1. Saute curry paste in olive oil 1-2 minutes to bring out flavor.  Add 1 cup coconut milk  & simmer 4 minutes.  Add onion, garlic and squash.  Cook until beginning to get tender.  Add 1 1/2 cup coconut milk or water and fish sauce & sugar.  Add salt to taste & remove from heat and add sweet basil
2. May use other vegetables as well
3. From Mary Laura @ Sandbrook 11-July-2012
*** Credits
- (It was very tasty when she served it during pick up this week!)
- (date created: 7/12/2012 11:14:32 AM)
** Pizza
*** Master Dough with Starter
Makes about 29 ounces (820 grams) dough, enough for 2 pizzas This is what I'd call the quintessential American pizza dough, inspired by New York–style pizza: medium thin, satisfyingly chewy, and the ideal companion to mozzarella, tomato sauce, and the pizza toppings Americans love best, from pepperoni and sausage to olives, mushrooms, and other vegetables. It's the dough I teach first to new students, and the one I recommend experimenting with because it's so versatile and user-friendly.
**** Ingredients
- 2.2 grams (3/4 teaspoon) active dry yeast
- 70 grams (1/4 cup plus 1 tablespoon) warm water (80 degreesF to 85 degreesF)
- 453 grams flour (3-1/2 cups) with 13 to 14 percent protein, preferably All Trumps, Pendleton Flour Mills Power, Giusto's High Performer, King Arthur Sir Lancelot Unbleached Hi-Gluten, or Tony's California Artisan Flour
- 10 grams (1 tablespoon plus 1/4 teaspoon) diastatic malt
- 210 grams (3/4 cup plus 2 tablespoons) ice water, plus more as needed
- 90 grams Poolish (see sidebar) or Tiga (see sidebar)
- 10 grams (2 teaspoons) fine sea salt
- 5 grams (1 teaspoon) extra virgin
- olive oil
