recipes.html
<div id="outline-container-orga23f98a" class="outline-4">
<h4 id="orga23f98a">Credits</h4>
<div class="outline-text-4" id="text-orga23f98a">
<p>
<a href="http://saltandwind.com/recipes/38-late-summer-roasted-eggplant-pasta-recipe">http://saltandwind.com/recipes/38-late-summer-roasted-eggplant-pasta-recipe</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgdda36b9" class="outline-3">
<h3 id="orgdda36b9">Southwestern Quiche With Potato Crust</h3>
<div class="outline-text-3" id="text-orgdda36b9">
</div>
<div id="outline-container-org45a2359" class="outline-4">
<h4 id="org45a2359">Ingredients</h4>
<div class="outline-text-4" id="text-org45a2359">
<ul class="org-ul">
<li>6 large eggs</li>
<li>1 tsp. salt</li>
<li>1.5 cups frozen shredded hash brown potatoes, thawed</li>
<li>1/2 medium red bell pepper, diced</li>
<li>1/2 cup fresh or frozen corn kernels, thawed if frozen</li>
<li>2 green onions (white and green parts), thinly sliced</li>
<li>2 tbsp. chopped fresh cilantro</li>
<li>3/4 cup shredded or crumbled Cheddar cheese</li>
<li>1/2 cup low-fat milk</li>
<li>2 chipotle chiles in adobo sauce, w/ 2 tsp. sauce reserved</li>
</ul>
</div>
</div>
<div id="outline-container-orgd26dac7" class="outline-4">
<h4 id="orgd26dac7">Method</h4>
<div class="outline-text-4" id="text-orgd26dac7">
<ol class="org-ol">
<li>Preheat oven to 375 degrees F. Coat the pie dish with cooking spray. Whisk together 1 egg and 1/4 tsp. salt in a medium bowl. Stir in shredded hash browns. Press the potato mixture into the bottom and sides of the pie dish to form crust. Bake for 15 minutes, or until lightly browned.</li>
<li>Sprinkle the bell pepper, corn, green onions, cilantro, and cheese over the potato crust.</li>
<li>In a blender, mix together the remaining eggs, milk, 3/4 tsp. salt, chiles and adobo sauce. Pour mixture over vegetables in pie dish. Bake 20 to 25 minutes, or until knife inserted in center comes out clean. Let stand 5 minutes before serving.</li>
<li>Serves 6.</li>
<li>I served the quiche topped with avocado slices and good store-bought salsa (I had Mrs. Renfro's Black Bean Salsa on hand). It was quite tasty, and everyone wanted seconds. I'll make this again, but I think next time I'll serve it with some black beans or a salad on the side, to add some fiber, and maybe add a third chipotle pepper (love the smokey flavor they add). Adapted from January 2007 Vegetarian Times recipe.</li>
</ol>
</div>
</div>
<div id="outline-container-org9361b5a" class="outline-4">
<h4 id="org9361b5a">Credits</h4>
<div class="outline-text-4" id="text-org9361b5a">
<ul class="org-ul">
<li><a href="http://www.grouprecipes.com/20674/southwestern-quiche-with-potato-crust.html">http://www.grouprecipes.com/20674/southwestern-quiche-with-potato-crust.html</a> 11 August 2008</li>
<li>(date created: 8/11/2008 12:14:31 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcb7fa30" class="outline-3">
<h3 id="orgcb7fa30">Spicy Black Bean Cakes</h3>
<div class="outline-text-3" id="text-orgcb7fa30">
</div>
<div id="outline-container-org840e036" class="outline-4">
<h4 id="org840e036">Lime Sour Cream:</h4>
<div class="outline-text-4" id="text-org840e036">
</div>
<ul class="org-ul">
<li><a id="org944db0a"></a>Ingredients<br />
<div class="outline-text-5" id="text-org944db0a">
<ul class="org-ul">
<li>* 1/2 cup reduced fat sour cream</li>
<li>* 2 teaspoons fresh lime juice</li>
<li>* 1 small fresh jalapeno pepper, minced</li>
<li>* salt to taste</li>
</ul>
</div>
</li>
<li><a id="org892a5e5"></a>Method<br />
<div class="outline-text-5" id="text-org892a5e5">
<ul class="org-ul">
<li>Combine all ingredients.</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org5d9f73a" class="outline-4">
<h4 id="org5d9f73a">Bean Cakes:</h4>
<div class="outline-text-4" id="text-org5d9f73a">
</div>
<ul class="org-ul">
<li><a id="org4f9f99e"></a>Ingredients<br />
<div class="outline-text-5" id="text-org4f9f99e">
<ul class="org-ul">
<li>1/4 cup quinoa, dry</li>
<li>2 (14.5 ounce) cans black beans, drained and rinsed</li>
<li>2 tbsp olive oil</li>
<li>6 cloves garlic, pressed</li>
<li>2 fresh jalapeno peppers, finely diced and/or</li>
<li>1 chipotle jalapeno peppers, in adobo sauce</li>
<li>1 tablespoon ground cumin</li>
<li>1 tablespoon chili pepper</li>
<li>salt and black pepper to taste</li>
<li>1 egg, lightly beaten</li>
<li>1/2 cup plain dried bread crumbs (optional)</li>
<li>1/2 cup corn kernels (optional)</li>
</ul>
</div>
</li>
<li><a id="orge2e104e"></a>Method<br />
<div class="outline-text-5" id="text-orge2e104e">
<ol class="org-ol">
<li>To prepare lime sour cream, mix the sour cream, lime juice, 1 small minced jalapeno, and salt together in a small bowl. Cover, and refrigerate.</li>
<li>Preheat oven to 375 degrees.</li>
<li>Cook the quinoa per instructions on package.  (Toast quinoa first, rinse then simmer 1/4 cup quinoa in 1/2 cup boiling water.) This will take about 10-15 minutes.</li>
<li>Puree black beans with olive oil, garlic, peppers and spices in a food processor.</li>
<li>Whisk egg in a medium-sized bowl.</li>
<li>Add black bean puree, cooked quinoa and bread crumbs (if using) to egg bowl and mix until fully combined into a batter.</li>
<li>Place 6 cupcake papers on a baking sheet.  Divide black bean cake batter among the 6 cups, and bake for about 15 to 20 minutes.</li>
<li>Allow black bean cakes to cool for a few minutes.  Remove from papers.  Serve over a bed of spinach with fresh salsa and grated cheese. Or over polenta or mashed potatoes.</li>
<li>Serve with lime sour cream.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org13daefa" class="outline-4">
<h4 id="org13daefa">Credits</h4>
<div class="outline-text-4" id="text-org13daefa">
<ul class="org-ul">
<li>January 2011; inspired by</li>
<li><a href="http://www.myplateisfullblog.com/2010/03/26/quinoa-black-bean-cakes/">http://www.myplateisfullblog.com/2010/03/26/quinoa-black-bean-cakes/</a> and <a href="http://allrecipes.com//Recipe/spicy-black-bean-cakes/Detail.aspx">http://allrecipes.com//Recipe/spicy-black-bean-cakes/Detail.aspx</a></li>
<li>(date created: 1/30/2011 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8da0a8e" class="outline-3">
<h3 id="org8da0a8e">Thai Red Curry Summer Squash</h3>
<div class="outline-text-3" id="text-org8da0a8e">
<p>
by mlsawatzky of Sandbrook Meadow Farm
</p>
</div>
<div id="outline-container-org7c12f69" class="outline-4">
<h4 id="org7c12f69">Ingredients</h4>
<div class="outline-text-4" id="text-org7c12f69">
<ul class="org-ul">
<li>3 medium summer squash cubed</li>
<li>1 sweet onion, sliced</li>
<li>2 cloves of garlic sliced</li>
<li>2 TBLSP olive oil</li>
<li>1 - 2 TBLSP red curry paste (MASRE brand good)</li>
<li>1 - 2 cans coconut milk (lite is good)</li>
<li>1 1/4 TBLSP fish sauce</li>
<li>1 TBLSP brown sugar</li>
<li>Salt</li>
<li>Sweet (Thai) Basil</li>
</ul>
</div>
</div>
<div id="outline-container-org6ed99b7" class="outline-4">
<h4 id="org6ed99b7">Method</h4>
<div class="outline-text-4" id="text-org6ed99b7">
<ol class="org-ol">
<li>Saute curry paste in olive oil 1-2 minutes to bring out flavor.  Add 1 cup coconut milk  &amp; simmer 4 minutes.  Add onion, garlic and squash.  Cook until beginning to get tender.  Add 1 1/2 cup coconut milk or water and fish sauce &amp; sugar.  Add salt to taste &amp; remove from heat and add sweet basil</li>
<li>May use other vegetables as well</li>
<li>From Mary Laura @ Sandbrook 11-July-2012</li>
</ol>
</div>
</div>
<div id="outline-container-org4519e70" class="outline-4">
<h4 id="org4519e70">Credits</h4>
<div class="outline-text-4" id="text-org4519e70">
<ul class="org-ul">
<li>(It was very tasty when she served it during pick up this week!)</li>
<li>(date created: 7/12/2012 11:14:32 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgdf43050" class="outline-3">
<h3 id="orgdf43050">Pizza</h3>
<div class="outline-text-3" id="text-orgdf43050">
</div>
<div id="outline-container-org407d45b" class="outline-4">
<h4 id="org407d45b">Master Dough with Starter</h4>
<div class="outline-text-4" id="text-org407d45b">
<p>
Makes about 29 ounces (820 grams) dough, enough for 2 pizzas This is what I'd call the quintessential American pizza dough, inspired by New York–style pizza: medium thin, satisfyingly chewy, and the ideal companion to mozzarella, tomato sauce, and the pizza toppings Americans love best, from pepperoni and sausage to olives, mushrooms, and other vegetables. It's the dough I teach first to new students, and the one I recommend experimenting with because it's so versatile and user-friendly.
</p>
</div>
<ul class="org-ul">
<li><a id="orge38a7f7"></a>Ingredients<br />
<div class="outline-text-5" id="text-orge38a7f7">
<ul class="org-ul">
<li>2.2 grams (3/4 teaspoon) active dry yeast</li>
<li>70 grams (1/4 cup plus 1 tablespoon) warm water (80 degreesF to 85 degreesF)</li>
<li>453 grams flour (3-1/2 cups) with 13 to 14 percent protein, preferably All Trumps, Pendleton Flour Mills Power, Giusto's High Performer, King Arthur Sir Lancelot Unbleached Hi-Gluten, or Tony's California Artisan Flour</li>
<li>10 grams (1 tablespoon plus 1/4 teaspoon) diastatic malt</li>
<li>210 grams (3/4 cup plus 2 tablespoons) ice water, plus more as needed</li>
<li>90 grams Poolish (see sidebar) or Tiga (see sidebar)</li>
<li>10 grams (2 teaspoons) fine sea salt</li>
<li>5 grams (1 teaspoon) extra virgin</li>
<li>olive oil</li>
</ul>
</div>
</li>
