recipes.html
<li><a id="org87caf8f"></a>Method<br />
<div class="outline-text-5" id="text-org87caf8f">
<ol class="org-ol">
<li>Put the yeast in a small bowl, add the warm water, and whisk vigorously for 30 seconds. The yeast should dissolve in the water and the mixture should foam. If it doesn't and the yeast granules float, the yeast is “dead” and should be discarded. Begin again with a fresh amount of yeast and water.</li>
<li>Combine the flour and malt in the bowl of a stand mixer fitted with the dough hook.</li>
<li>With the mixer running on the lowest speed, pour in most of the icewater, reserving about 2 tablespoons, followed by the yeast-water mixture. Pour the reserved water into the yeast bowl, swirl it around to dislodge any bits of yeast stuck to the bowl, and add to the mixer. Mix for about 15 seconds, stop the mixer, and add the poolish or tiga.</li>
<li>Continue to mix the dough at the lowest speed for about 1 minute, until most of the dough comes together around the hook. Stop the mixer. Use your fingers to pull away any dough clinging to the hook, and scrape the sides and bottom of the bowl with a bowl scraper or rubber spatula. Check the bottom of the bowl for any unincorporated flour. Turn the dough over and press it into the bottom of the bowl to pick up any stray pieces. If the dough isn't holding together, add small amounts of water (about 1/2 teaspoon to start) and mix until the dough is no longer dry and holds together.</li>
<li>Add the salt and mix on the lowest speed for 1 minute to combine.</li>
<li>Stop the mixer, pull the dough off the hook, and add the oil. Mix the dough for 1 to 2 minutes, stopping the mixer from time to time to pull the dough off the hook and scrape down the sides of the bowl, until all of the oil is absorbed. The dough won't look completely smooth.</li>
<li>Use a bowl scraper to transfer the dough to an unfloured work surface, then knead it for 2 to 3 minutes, until smooth. Cover the dough with a damp dish towel and let rest at room temperature for 20 minutes. Use the dough cutter to loosen the dough and to cut it in half.  Weigh the dough, adjusting the quantity as necessary to give you two 13-ounce pieces. Form each piece into a ball. Any remaining dough can be discarded.</li>
<li>Form the dough into balls. Set the balls on a half sheet pan, spacing them about 3 inches apart. Or, if you will be baking the balls on different days, place each ball on a quarter sheet pan. Wrap the pan(s) airtight with a double layer of plastic wrap, sealing the wrap well under the pan(s). Put the pan(s) in a level spot in the refrigerator and refrigerate for 24 to 48 hours.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org7eb55f1" class="outline-4">
<h4 id="org7eb55f1">TIGA and POOLISH Starters</h4>
<div class="outline-text-4" id="text-org7eb55f1">
<p>
Here are the two starters I use most frequently in this book and in my restaurants. Tiga is my slightly more hydrated version of a classic biga starter, which is usually between 50 and 60 percent water. This “Tony's biga,” which I call “Tiga,” has 70 percent hydration.
My poolish follows the traditional proportions of equal parts water and flour, so its hydration is much higher at 100 percent. In general, unless I specify otherwise, use the same flour in your starter that you will be using in your dough. I always make starters with cold water to slow down the fermentation process for greater flavor complexity. It's helpful to use a clear glass bowl so you can see how well your starter is fermenting.
</p>
</div>
<ul class="org-ul">
<li><a id="org597c964"></a>TIGA<br />
<div class="outline-text-5" id="text-org597c964">
<p>
Makes 90 grams
</p>
</div>
<ul class="org-ul">
<li><a id="org5caa17f"></a>Ingredients<br />
<div class="outline-text-6" id="text-org5caa17f">
<ul class="org-ul">
<li>0.14 gram (one-third of 1/8 teaspoon) active dry yeast or 0.42 gram
fresh yeast, broken into small pieces</li>
<li>39 grams (2 tablespoons plus 2 teaspoons) cold tap water</li>
<li>55 grams (1/4 cup plus 3 tablespoons) flour used in dough recipe</li>
</ul>
</div>
</li>
<li><a id="orgf5e4b81"></a>Method<br />
<div class="outline-text-6" id="text-orgf5e4b81">
<ol class="org-ol">
<li>Put the yeast in a small bowl, add the water, and whisk vigorously for 30 seconds. The mixture should bubble on top. If it doesn't and the yeast granules float, the yeast is “dead” and should be discarded. Begin again with a fresh amount of yeast and water.</li>
<li>Add the flour and stir well with a rubber spatula to combine. The consistency will be quite thick.</li>
<li>Scrape down the sides of the bowl, cover the bowl with plastic wrap, and let sit at room temperature for 18 hours. Refrigerate for 30 minutes to cool slightly before using.</li>
<li>If you are not using the starter right away, you can store it in the refrigerator, though I suggest keeping it for no more than 8 hours. Bring it to cool room temperature before using.</li>
</ol>
</div>
</li>
</ul>
</li>
<li><a id="orgb0e32eb"></a>POOLISH<br />
<div class="outline-text-5" id="text-orgb0e32eb">
<p>
Makes 90 grams
</p>
</div>
<ul class="org-ul">
<li><a id="org7b59d4b"></a>Ingredients<br />
<div class="outline-text-6" id="text-org7b59d4b">
<ul class="org-ul">
<li>0.12 gram (one-third of 1/8 teaspoon) active dry yeast or 0.36 gram
fresh yeast, broken into small pieces</li>
<li>47 grams (3 tablespoons plus 1 teaspoon) cold tap water</li>
<li>47 grams (1/4 cup plus 2 tablespoons) flour used in dough recipe</li>
</ul>
</div>
</li>
<li><a id="org549f19f"></a>Method<br />
<div class="outline-text-6" id="text-org549f19f">
<ol class="org-ol">
<li>Put the yeast in a small bowl, add the water, and whisk vigorously for 30 seconds. The mixture should bubble on top. If it doesn't and the yeast granules float, the yeast is “dead” and should be discarded. Begin again with a fresh amount of yeast and water.</li>
<li>Add the flour and stir well with a rubber spatula to combine. The consistency will be quite thick, resembling a thick pancake batter.</li>
<li>Scrape down the sides of the bowl, cover the bowl with plastic wrap, and let sit at room temperature for 18 hours. Refrigerate for 30 minutes to cool slightly before using.</li>
<li>If you are not using the starter right away, you can store it in the refrigerator, though I suggest keeping it for no more than 8 hours. Bring to cool room temperature before using.</li>
</ol>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org74d379b" class="outline-4">
<h4 id="org74d379b">Credits</h4>
<div class="outline-text-4" id="text-org74d379b">
<p>
Tony Gemignani's Master Dough with Starter
<a href="http://www.pri.org/stories/2015-02-25/how-tony-gemignani-shocked-pizza-world">http://www.pri.org/stories/2015-02-25/how-tony-gemignani-shocked-pizza-world</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgff4d48e" class="outline-3">
<h3 id="orgff4d48e">Ultimate Veggie Burger Recipe</h3>
<div class="outline-text-3" id="text-orgff4d48e">
<p>
These make great do-ahead meals, and you can store shaped, ready-to-cook patties in the refrigerator for a week's worth of work lunches. Sprouted garbanzos are becoming more readily available, but if you can't find them, canned or cooked garbanzos (chickpeas) will work great. Sprouting boosts their already fantastic nutritional value even more&#x2026;
</p>
</div>
