recipes.org
*** Ingredients
- 2 1/2 cups sprouted garbanzo beans (chickpeas) OR canned garbanzos, drained and rinsed
- 4 large eggs
- 1/2 teaspoon fine-grain sea salt
- 1/3 cup chopped fresh cilantro
- 1 onion, chopped
- Grated zest of one large lemon
- 1 cup micro sprouts, chopped (try brocolli, onion, or alfalfa sprouts - optional)
- 1 cup toasted (whole-grain) bread crumbs
- 1 tablespoon extra-virgin olive oil (or clarified butter)
Method:
1. If you are using sprouted garbanzos, steam them until just tender, about 10 minutes. Most of you will be using canned beans, so jump right in and combine the garbanzos, eggs, and salt in a food processor. Puree until the mixture is the consistency of a very thick, slightly chunky hummus. Pour into a mixing bowl and stir in the cilantro, onion, zest, and sprouts. Add the breadcrumbs, stir, and let sit for a couple of minutes so the crumbs can absorb some of the moisture. At this point, you should have a moist mixture that you can easily form into twelve 1 1/2-inch-thick patties. I err on the moist side here, because it makes for a nicely textured burger. You can always add more bread crumbs a bit at a time to firm up the dough if need be. Conversely, a bit of water or more egg can be used to moisten the batter.
2. Heat the oil in a heavy skillet over medium low, add 4 patties, cover, and cook for 7 to 10 minutes, until the bottoms begin to brown. Turn up the heat if there is no browning after 10 minutes. Flip the patties and cook the second side for 7 minutes, or until golden. Remove from the skillet and cool on a wire rack while you cook the remaining patties. Carefully cut each patty in half, insert your favorite fillings, and enjoy immediately.
3. Makes 12 mini burgers.
*** Credits
- 101 Cookbooks http://www.101cookbooks.com/
- (date created: 5/2/2009 2:37:06 PM)
** Vegetable Enchiladas
*** Ingredients
- 3 tbsp. vegetable oil
- 1 onion, minced
- 1 clove garlic, minced or pressed
- 1 green pepper, chopped fine
- 3 stalks celery, chopped fine
- 1 c. chopped parsley
- 1 c. coarsely grated zucchini
- 2 c. green beans, chopped sm.
- 1 tsp. salt
- Dash each of chili, cumin powder, corn flour
- 2 c. grated cheddar or Jack cheese
- 3 1/2 c. Red Sauce
- 12 corn or whole wheat flour tortillas
- 1/2 c. chopped black olives
*** Method
1. Saute onion, garlic, pepper and celery in oil. Add parsley, zucchini and green beans with salt, cumin, and chili powder and cook, covered, until tender.
2. If vegetables are very wet, thicken with corn flour. Add 1 cup of the cheese and 3/4 cup of the red sauce. Preheat oven to 350 degrees.
3. Fill each tortilla with 1/3 cup of vegetable mixture. Roll them up and place in a baking dish, seam-side down, close together and cover with remaining sauce. Top with remaining cheese and olives and heat until sauce bubbles.
4. RED SAUCE:
5. 1/2 lg. onion, chopped
6. 2 tbsp. oil
7. 1 bay leaf
8. 1 tsp. cumin
9. 3 c. tomatoes
10. 1 tsp. salt
11. 1 clove garlic, minced
12. 2 tbsp. chopped green pepper
13. 1 tsp. oregano
14. 1/2 tsp. chili powder
15. 1 (6 oz.) can tomato paste
16. Saute onion and garlic in oil. Add pepper, bay leaf, oregano, cumin, chili powder, tomatoes, tomato paste and salt. Simmer for half and hour and remove bay leaf. Serves 6.
*** Credits
- http://www.cooks.com/rec/doc/0,1649,144160-243196,00.html
- (date created: 5/2/2009 2:35:32 PM)
** Vegetable Pot Pie
Prep Time: 1 hr 
Total Time: 1 hr 45 mins
Servings: 6-8
*** Ingredients
- 1 cup potato, diced
- 1 cup onion, diced
- 1 cup celery, diced
- 1 cup carrots, diced
- 1/3 cup melted butter
- 1/2 cup all-purpose flour
- 2 cups broth
- 1 cup half-and-half
- 1 teaspoon salt
- 1/4 teaspoon pepper
- 1 cup peas
- 1 cup TVP (optional)
- 2 pie crusts (either store bought or your own recipe)
*** Method
1. Preheat oven to 400 degreesF.
2. Saute onion, celery, carrots and potatoes in butter for 10 minutes.
3. Add flour to sauteed mixture, stirring well, cook one minute stirring constantly.
4. Combine broth and half and half; gradually stir into vegetable mixture.
6. Cook over medium heat stirring constantly until thickened and bubbly.
7. Stir in salt and pepper; add peas and TVP (if using) and stir well.
8. Pour into shallow 2 quart casserole dish and top with pie shells.
9. Cut slits to allow steam to escape.
10. Bake for 40-50 minutes or until pastry is golden brown and filling is bubbly and cooked through.
*** Credits
By Vincy Bramblett on August 07, 2001 97.40%;  708 Reviews
https://www.epicurious.com/recipes/member/views/delicious-chicken-pot-pie-52349241
http://www.geniuskitchen.com/recipe/delicious-chicken-pot-pie-10744
** Vegetarian Lentil Burger Recipe
These make great do-ahead meals, and you can store shaped, ready-to-cook patties in the refrigerator for a week's worth of work lunches. I use black lentils in this recipe, some of the other types of lentils are too mushy when cooked - so I'd stick with the black lentils. Feel free to spice up the batter by experimenting with your favorite seasonings.
*** Ingredients
- 3 cups cooked black lentils
- 4 large eggs
- 1/2 teaspoon fine-grain sea salt
- 1 onion, finely chopped
- 1 cup toasted fine (whole-grain) bread crumbs
- 1 tablespoon extra-virgin olive oil (or clarified butter)
*** Method
1. Combine the lentils, eggs, and salt in a food processor. Puree until the mixture is the consistency of a runny yet textured hummus - it's o.k. if many of the lentils remain whole (see photo). Pour into a mixing bowl and stir in the onion. Add the breadcrumbs, stir, and let sit for a couple of minutes so the crumbs can absorb some of the moisture. At this point, you should have a very moist mixture that you can easily form into twelve 1 1/2-inch-thick patties. I err on the moist side here, because it makes for a nicely textured burger. You can always add more bread crumbs a bit at a time to firm up the dough if need be. Conversely, a bit of water or more egg can be used to moisten the batter.
2. Heat the oil in a heavy skillet over medium low, add 4 patties, cover, and cook for 7 to 10 minutes, until the bottoms begin to brown. Turn up the heat if there is no browning after 10 minutes. Flip the patties and cook the second side for 7 minutes, or until golden. Remove from the skillet and cool on a wire rack while you cook the remaining patties. Carefully cut each patty in half, insert your favorite fillings, and enjoy immediately.
3. Makes 12 mini burgers.
