recipes.html
<div id="outline-container-orgc29af75" class="outline-4">
<h4 id="orgc29af75">Ingredients</h4>
<div class="outline-text-4" id="text-orgc29af75">
<ul class="org-ul">
<li>2 1/2 cups sprouted garbanzo beans (chickpeas) OR canned garbanzos, drained and rinsed</li>
<li>4 large eggs</li>
<li>1/2 teaspoon fine-grain sea salt</li>
<li>1/3 cup chopped fresh cilantro</li>
<li>1 onion, chopped</li>
<li>Grated zest of one large lemon</li>
<li>1 cup micro sprouts, chopped (try brocolli, onion, or alfalfa sprouts - optional)</li>
<li>1 cup toasted (whole-grain) bread crumbs</li>
<li>1 tablespoon extra-virgin olive oil (or clarified butter)</li>
</ul>
<p>
Method:
</p>
<ol class="org-ol">
<li>If you are using sprouted garbanzos, steam them until just tender, about 10 minutes. Most of you will be using canned beans, so jump right in and combine the garbanzos, eggs, and salt in a food processor. Puree until the mixture is the consistency of a very thick, slightly chunky hummus. Pour into a mixing bowl and stir in the cilantro, onion, zest, and sprouts. Add the breadcrumbs, stir, and let sit for a couple of minutes so the crumbs can absorb some of the moisture. At this point, you should have a moist mixture that you can easily form into twelve 1 1/2-inch-thick patties. I err on the moist side here, because it makes for a nicely textured burger. You can always add more bread crumbs a bit at a time to firm up the dough if need be. Conversely, a bit of water or more egg can be used to moisten the batter.</li>
<li>Heat the oil in a heavy skillet over medium low, add 4 patties, cover, and cook for 7 to 10 minutes, until the bottoms begin to brown. Turn up the heat if there is no browning after 10 minutes. Flip the patties and cook the second side for 7 minutes, or until golden. Remove from the skillet and cool on a wire rack while you cook the remaining patties. Carefully cut each patty in half, insert your favorite fillings, and enjoy immediately.</li>
<li>Makes 12 mini burgers.</li>
</ol>
</div>
</div>
<div id="outline-container-orga563c51" class="outline-4">
<h4 id="orga563c51">Credits</h4>
<div class="outline-text-4" id="text-orga563c51">
<ul class="org-ul">
<li>101 Cookbooks <a href="http://www.101cookbooks.com/">http://www.101cookbooks.com/</a></li>
<li>(date created: 5/2/2009 2:37:06 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org45ef0d3" class="outline-3">
<h3 id="org45ef0d3">Vegetable Enchiladas</h3>
<div class="outline-text-3" id="text-org45ef0d3">
</div>
<div id="outline-container-org4408a51" class="outline-4">
<h4 id="org4408a51">Ingredients</h4>
<div class="outline-text-4" id="text-org4408a51">
<ul class="org-ul">
<li>3 tbsp. vegetable oil</li>
<li>1 onion, minced</li>
<li>1 clove garlic, minced or pressed</li>
<li>1 green pepper, chopped fine</li>
<li>3 stalks celery, chopped fine</li>
<li>1 c. chopped parsley</li>
<li>1 c. coarsely grated zucchini</li>
<li>2 c. green beans, chopped sm.</li>
<li>1 tsp. salt</li>
<li>Dash each of chili, cumin powder, corn flour</li>
<li>2 c. grated cheddar or Jack cheese</li>
<li>3 1/2 c. Red Sauce</li>
<li>12 corn or whole wheat flour tortillas</li>
<li>1/2 c. chopped black olives</li>
</ul>
</div>
</div>
<div id="outline-container-org39ae65a" class="outline-4">
<h4 id="org39ae65a">Method</h4>
<div class="outline-text-4" id="text-org39ae65a">
<ol class="org-ol">
<li>Saute onion, garlic, pepper and celery in oil. Add parsley, zucchini and green beans with salt, cumin, and chili powder and cook, covered, until tender.</li>
<li>If vegetables are very wet, thicken with corn flour. Add 1 cup of the cheese and 3/4 cup of the red sauce. Preheat oven to 350 degrees.</li>
<li>Fill each tortilla with 1/3 cup of vegetable mixture. Roll them up and place in a baking dish, seam-side down, close together and cover with remaining sauce. Top with remaining cheese and olives and heat until sauce bubbles.</li>
<li>RED SAUCE:</li>
<li>1/2 lg. onion, chopped</li>
<li>2 tbsp. oil</li>
<li>1 bay leaf</li>
<li>1 tsp. cumin</li>
<li>3 c. tomatoes</li>
<li>1 tsp. salt</li>
<li>1 clove garlic, minced</li>
<li>2 tbsp. chopped green pepper</li>
<li>1 tsp. oregano</li>
<li>1/2 tsp. chili powder</li>
<li>1 (6 oz.) can tomato paste</li>
<li>Saute onion and garlic in oil. Add pepper, bay leaf, oregano, cumin, chili powder, tomatoes, tomato paste and salt. Simmer for half and hour and remove bay leaf. Serves 6.</li>
</ol>
</div>
</div>
<div id="outline-container-org903e372" class="outline-4">
<h4 id="org903e372">Credits</h4>
<div class="outline-text-4" id="text-org903e372">
<ul class="org-ul">
<li><a href="http://www.cooks.com/rec/doc/0,1649,144160-243196,00.html">http://www.cooks.com/rec/doc/0,1649,144160-243196,00.html</a></li>
<li>(date created: 5/2/2009 2:35:32 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org80e06fb" class="outline-3">
<h3 id="org80e06fb">Vegetable Pot Pie</h3>
<div class="outline-text-3" id="text-org80e06fb">
<p>
Prep Time: 1 hr 
Total Time: 1 hr 45 mins
Servings: 6-8
</p>
</div>
<div id="outline-container-orgbc2a57a" class="outline-4">
<h4 id="orgbc2a57a">Ingredients</h4>
<div class="outline-text-4" id="text-orgbc2a57a">
<ul class="org-ul">
<li>1 cup potato, diced</li>
<li>1 cup onion, diced</li>
<li>1 cup celery, diced</li>
<li>1 cup carrots, diced</li>
<li>1/3 cup melted butter</li>
<li>1/2 cup all-purpose flour</li>
<li>2 cups broth</li>
<li>1 cup half-and-half</li>
<li>1 teaspoon salt</li>
<li>1/4 teaspoon pepper</li>
<li>1 cup peas</li>
<li>1 cup TVP (optional)</li>
<li>2 pie crusts (either store bought or your own recipe)</li>
</ul>
</div>
</div>
<div id="outline-container-org493ce47" class="outline-4">
<h4 id="org493ce47">Method</h4>
<div class="outline-text-4" id="text-org493ce47">
<ol class="org-ol">
<li>Preheat oven to 400 degreesF.</li>
<li>Saute onion, celery, carrots and potatoes in butter for 10 minutes.</li>
<li>Add flour to sauteed mixture, stirring well, cook one minute stirring constantly.</li>
<li>Combine broth and half and half; gradually stir into vegetable mixture.</li>
<li>Cook over medium heat stirring constantly until thickened and bubbly.</li>
<li>Stir in salt and pepper; add peas and TVP (if using) and stir well.</li>
<li>Pour into shallow 2 quart casserole dish and top with pie shells.</li>
<li>Cut slits to allow steam to escape.</li>
<li>Bake for 40-50 minutes or until pastry is golden brown and filling is bubbly and cooked through.</li>
</ol>
</div>
</div>
<div id="outline-container-org47c1d9d" class="outline-4">
<h4 id="org47c1d9d">Credits</h4>
<div class="outline-text-4" id="text-org47c1d9d">
<p>
By Vincy Bramblett on August 07, 2001 97.40%;  708 Reviews
<a href="https://www.epicurious.com/recipes/member/views/delicious-chicken-pot-pie-52349241">https://www.epicurious.com/recipes/member/views/delicious-chicken-pot-pie-52349241</a>
<a href="http://www.geniuskitchen.com/recipe/delicious-chicken-pot-pie-10744">http://www.geniuskitchen.com/recipe/delicious-chicken-pot-pie-10744</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orga3404d3" class="outline-3">
<h3 id="orga3404d3">Vegetarian Lentil Burger Recipe</h3>
<div class="outline-text-3" id="text-orga3404d3">
<p>
These make great do-ahead meals, and you can store shaped, ready-to-cook patties in the refrigerator for a week's worth of work lunches. I use black lentils in this recipe, some of the other types of lentils are too mushy when cooked - so I'd stick with the black lentils. Feel free to spice up the batter by experimenting with your favorite seasonings.
</p>
</div>
<div id="outline-container-org76a5cfb" class="outline-4">
<h4 id="org76a5cfb">Ingredients</h4>
<div class="outline-text-4" id="text-org76a5cfb">
<ul class="org-ul">
<li>3 cups cooked black lentils</li>
<li>4 large eggs</li>
<li>1/2 teaspoon fine-grain sea salt</li>
<li>1 onion, finely chopped</li>
<li>1 cup toasted fine (whole-grain) bread crumbs</li>
<li>1 tablespoon extra-virgin olive oil (or clarified butter)</li>
</ul>
</div>
</div>
<div id="outline-container-org228aa34" class="outline-4">
<h4 id="org228aa34">Method</h4>
<div class="outline-text-4" id="text-org228aa34">
<ol class="org-ol">
<li>Combine the lentils, eggs, and salt in a food processor. Puree until the mixture is the consistency of a runny yet textured hummus - it's o.k. if many of the lentils remain whole (see photo). Pour into a mixing bowl and stir in the onion. Add the breadcrumbs, stir, and let sit for a couple of minutes so the crumbs can absorb some of the moisture. At this point, you should have a very moist mixture that you can easily form into twelve 1 1/2-inch-thick patties. I err on the moist side here, because it makes for a nicely textured burger. You can always add more bread crumbs a bit at a time to firm up the dough if need be. Conversely, a bit of water or more egg can be used to moisten the batter.</li>
<li>Heat the oil in a heavy skillet over medium low, add 4 patties, cover, and cook for 7 to 10 minutes, until the bottoms begin to brown. Turn up the heat if there is no browning after 10 minutes. Flip the patties and cook the second side for 7 minutes, or until golden. Remove from the skillet and cool on a wire rack while you cook the remaining patties. Carefully cut each patty in half, insert your favorite fillings, and enjoy immediately.</li>
<li>Makes 12 mini burgers.</li>
</ol>
</div>
</div>
