recipes.org
*** Credits
- http://www.101cookbooks.com/archives/print/vegetarian-lentil-burgers-recipe.html
- (date created: 5/2/2009 2:36:27 PM)
* Sides
** Authentic Thai Peanut Sauce
*** Ingredients
- 4 teaspoons corn oil
- 1/2 cup minced red onion
- 2 tablespoons minced garlic
- 1/2 teaspoon hot chili pepper
- 2 tablespoons sugar
- 2 tablespoons vinegar
- 1/3 cup peanut butter
- 1 cup of water
*** Method
1. In a blender, combine corn oil, onion, garlic and hot chili pepper; blend for 1 minute
2. Empty the mixture into a saucepan and place over low heat until the mixture starts releasing aroma. Add peanut butter and mix well over low heat.
3. Add water and let it simmer for 10 minutes or until thickened.
4. Stir in vinegar and sugar; continue to simmer for another 1-2 minutes. Taste and add more vinegar and sugar if the mixture does not have the sour and sweet taste.
5. Place sauce in a shallow plate for satay dipping or pour over fresh salad.
*** Credits
- Submitted by: Pat; downloaded 26 Jan 2009
- (date created: 1/26/2009 9:11:21 AM)
** Avacado with Cheese Dressing
*** Ingredients
- 1 avocado - halved & stoned
- 15ml (1tbsp) Coleraine Cheddar Cheese w/ beer & garlic - grated
- 5ml (1tsp) lemon juice
- 45ml (3tbsp) Yogurt
- 30ml (2tbsp) dry roasted peanuts - coarsely chopped
*** Method
1. Scoop flesh out of avocado and finely chop.
2. Blend w/ cheese and lemon juice to make a paste.
3. Fold in yogurt.
4. Spoon mixture into avocado shells.
5. Chill.
6. Sprinkle with peanuts just before serving.
*** Credits
- Ulster Tatler April 1997
- Brier Country House B&B
- (date created: 6/27/2007 4:42:14 PM)
** Syrupy "Aged" Balsamic in Minutes
*** Ingredients
Combine:
- 1/3 cup balsamic
- 1 Tbl sugar
- 1 Tbl port
*** Method
1. Simmer over extremely low heat; barely simmering. Shake periodically. 
2. Serve over fresh fruits, cheese and/or ice cream.
*** Credits
- http://lifehacker.com/5924332/simmer-balsamic-vinegar-with-sugar-and-port-to-get-sweet-syrupy-aged-balsamic-in-minutes
- 9 July 2012
- (date created: 7/9/2012 8:53:55 AM)
** Takeout Style Broccoli with Garlic Sauce
*** Yield
Serves: 4
*** Ingredients
- 1 pound broccoli, cut into florets
- 1 teaspoon dark soy sauce
- 2 tablespoons soy sauce
- 1½ teaspoons rice wine vinegar
- 2 teaspoons sugar
- ¾ cup hot chicken or vegetable stock (to keep the dish vegetarian)
- ½ teaspoon sesame oil
- A pinch of fresh ground white pepper
- 2 tablespoons vegetable oil
- 4 cloves of minced garlic (about a tablespoon)
- 1 tablespoon Shaoxing wine
- Cornstarch slurry (1½ tablespoons cornstarch mixed with 1½ tablespoons water)
- 1 teaspoon homemade chili oil (optional)
*** Method
1. Wash the broccoli thoroughly and set aside. Mix the soy sauces, rice wine vinegar, sugar, stock, sesame oil, and ground white pepper, and set aside.
2. Heat the wok over high heat. Add the vegetable oil, garlic, and broccoli and quickly stir-fry so the garlic doesn't burn.
3. Stir fry for 15 seconds, and add the Shaoxing rice wine around the perimeter of the wok. Give everything a quick stir and add in the sauce mixture. Let the sauce come to a boil, and mix the cornstarch and water together to make a slurry.
4. Add the cornstarch slurry slowly while stirring the broccoli and sauce constantly. Let the sauce cook and thicken until it coats the back of a spoon. If you like a thick sauce, add more cornstarch and water. If you like your sauce thinner, add less cornstarch and water. If you'd like, stir in the chili oil at this point. Serve!
*** Credits
http://thewoksoflife.com/2017/03/broccoli-garlic-sauce/
[2018-01-23 Tue] Made for myself. It was ok, a bit too vinegary.
 Crispy Cauliflower Buffalo Wings
*** Ingredients
- 1/2 head cauliflower, chopped into bite size pieces
- 1 cup garbanzo bean (or wheat) flour
- 1 cup water
- 1 tsp. garlic powder (or minced fresh garlic)
- 1/2 tsp. salt
- 1 tsp. melted butter or ghee
- 2/3 cup hot sauce
*** Method
1. Preheat oven to 450F.
2. In a medium size bowl, combine flour, water, garlic powder and salt. Whisk together until smooth.
3. Toss cauliflower into batter making sure to coat each piece completely, then place battered
   cauliflower on a lightly greased, non-stick baking sheet. 
4. Bake for 15 minutes, tossing half way through.
5. In the meantime, combine melted butter and hot sauce in a large bowl, stirring.
6. When cauliflower is done, remove it from the oven and gently toss it in the hot sauce mixture.
7. Place cauliflower back on the baking sheet and cook for an additional 25 minutes or until it
   becomes crispy. Allow cauliflower to cool for 15 minutes before serving. 
8. Serve with your favorite creamy dressing.
*** Yield Serves 4
*** Credits
http://www.mindbodygreen.com/0-13441/crispy-cauliflower-buffalo-wings-gluten-free.html
** Caramelized Onion and Sun-Dried Tomato Dip 
Makes 1 cup; serves 4-6
*** Ingredients
- 2 tablespoons	olive oil
- 1 tablespoon	butter
- 4 cups		sliced mild onions
- 1/4 teaspoon	dried rosemary, crumbled
- 1/8 teaspoon	dried thyme
- 1/3 cup		water
- 2 tablespoons	white wine
- 6			oil-marinated sun-dried tomato halves
- 1 tablespoon	chopped fresh parsley
- 1/2 teaspoon	capers (optional!)
- 6 small		pitted black olives (For best results use a good flavorful olive such as a kalamata.)
