recipes.html
<div id="outline-container-org958188f" class="outline-4">
<h4 id="org958188f">Credits</h4>
<div class="outline-text-4" id="text-org958188f">
<ul class="org-ul">
<li><a href="http://www.101cookbooks.com/archives/print/vegetarian-lentil-burgers-recipe.html">http://www.101cookbooks.com/archives/print/vegetarian-lentil-burgers-recipe.html</a></li>
<li>(date created: 5/2/2009 2:36:27 PM)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org8f6cfef" class="outline-2">
<h2 id="org8f6cfef">Sides</h2>
<div class="outline-text-2" id="text-org8f6cfef">
</div>
<div id="outline-container-orgeaf29a4" class="outline-3">
<h3 id="orgeaf29a4">Authentic Thai Peanut Sauce</h3>
<div class="outline-text-3" id="text-orgeaf29a4">
</div>
<div id="outline-container-orgf50233e" class="outline-4">
<h4 id="orgf50233e">Ingredients</h4>
<div class="outline-text-4" id="text-orgf50233e">
<ul class="org-ul">
<li>4 teaspoons corn oil</li>
<li>1/2 cup minced red onion</li>
<li>2 tablespoons minced garlic</li>
<li>1/2 teaspoon hot chili pepper</li>
<li>2 tablespoons sugar</li>
<li>2 tablespoons vinegar</li>
<li>1/3 cup peanut butter</li>
<li>1 cup of water</li>
</ul>
</div>
</div>
<div id="outline-container-orge5a4874" class="outline-4">
<h4 id="orge5a4874">Method</h4>
<div class="outline-text-4" id="text-orge5a4874">
<ol class="org-ol">
<li>In a blender, combine corn oil, onion, garlic and hot chili pepper; blend for 1 minute</li>
<li>Empty the mixture into a saucepan and place over low heat until the mixture starts releasing aroma. Add peanut butter and mix well over low heat.</li>
<li>Add water and let it simmer for 10 minutes or until thickened.</li>
<li>Stir in vinegar and sugar; continue to simmer for another 1-2 minutes. Taste and add more vinegar and sugar if the mixture does not have the sour and sweet taste.</li>
<li>Place sauce in a shallow plate for satay dipping or pour over fresh salad.</li>
</ol>
</div>
</div>
<div id="outline-container-org2bc0562" class="outline-4">
<h4 id="org2bc0562">Credits</h4>
<div class="outline-text-4" id="text-org2bc0562">
<ul class="org-ul">
<li>Submitted by: Pat; downloaded 26 Jan 2009</li>
<li>(date created: 1/26/2009 9:11:21 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org08ffde4" class="outline-3">
<h3 id="org08ffde4">Avacado with Cheese Dressing</h3>
<div class="outline-text-3" id="text-org08ffde4">
</div>
<div id="outline-container-orgd85fe2e" class="outline-4">
<h4 id="orgd85fe2e">Ingredients</h4>
<div class="outline-text-4" id="text-orgd85fe2e">
<ul class="org-ul">
<li>1 avocado - halved &amp; stoned</li>
<li>15ml (1tbsp) Coleraine Cheddar Cheese w/ beer &amp; garlic - grated</li>
<li>5ml (1tsp) lemon juice</li>
<li>45ml (3tbsp) Yogurt</li>
<li>30ml (2tbsp) dry roasted peanuts - coarsely chopped</li>
</ul>
</div>
</div>
<div id="outline-container-org84c7dc9" class="outline-4">
<h4 id="org84c7dc9">Method</h4>
<div class="outline-text-4" id="text-org84c7dc9">
<ol class="org-ol">
<li>Scoop flesh out of avocado and finely chop.</li>
<li>Blend w/ cheese and lemon juice to make a paste.</li>
<li>Fold in yogurt.</li>
<li>Spoon mixture into avocado shells.</li>
<li>Chill.</li>
<li>Sprinkle with peanuts just before serving.</li>
</ol>
</div>
</div>
<div id="outline-container-orgb4392b1" class="outline-4">
<h4 id="orgb4392b1">Credits</h4>
<div class="outline-text-4" id="text-orgb4392b1">
<ul class="org-ul">
<li>Ulster Tatler April 1997</li>
<li>Brier Country House B&amp;B</li>
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8a20608" class="outline-3">
<h3 id="org8a20608">Syrupy "Aged" Balsamic in Minutes</h3>
<div class="outline-text-3" id="text-org8a20608">
</div>
<div id="outline-container-orgd9a8078" class="outline-4">
<h4 id="orgd9a8078">Ingredients</h4>
<div class="outline-text-4" id="text-orgd9a8078">
<p>
Combine:
</p>
<ul class="org-ul">
<li>1/3 cup balsamic</li>
<li>1 Tbl sugar</li>
<li>1 Tbl port</li>
</ul>
</div>
</div>
<div id="outline-container-orgc991506" class="outline-4">
<h4 id="orgc991506">Method</h4>
<div class="outline-text-4" id="text-orgc991506">
<ol class="org-ol">
<li>Simmer over extremely low heat; barely simmering. Shake periodically.</li>
<li>Serve over fresh fruits, cheese and/or ice cream.</li>
</ol>
</div>
</div>
<div id="outline-container-orgef4c7bd" class="outline-4">
<h4 id="orgef4c7bd">Credits</h4>
<div class="outline-text-4" id="text-orgef4c7bd">
<ul class="org-ul">
<li><a href="http://lifehacker.com/5924332/simmer-balsamic-vinegar-with-sugar-and-port-to-get-sweet-syrupy-aged-balsamic-in-minutes">http://lifehacker.com/5924332/simmer-balsamic-vinegar-with-sugar-and-port-to-get-sweet-syrupy-aged-balsamic-in-minutes</a></li>
<li>9 July 2012</li>
<li>(date created: 7/9/2012 8:53:55 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc41506f" class="outline-3">
<h3 id="orgc41506f">Takeout Style Broccoli with Garlic Sauce</h3>
<div class="outline-text-3" id="text-orgc41506f">
</div>
<div id="outline-container-org7688c5d" class="outline-4">
<h4 id="org7688c5d">Yield</h4>
<div class="outline-text-4" id="text-org7688c5d">
<p>
Serves: 4
</p>
</div>
</div>
<div id="outline-container-org86de987" class="outline-4">
<h4 id="org86de987">Ingredients</h4>
<div class="outline-text-4" id="text-org86de987">
<ul class="org-ul">
<li>1 pound broccoli, cut into florets</li>
<li>1 teaspoon dark soy sauce</li>
<li>2 tablespoons soy sauce</li>
<li>1½ teaspoons rice wine vinegar</li>
<li>2 teaspoons sugar</li>
<li>¾ cup hot chicken or vegetable stock (to keep the dish vegetarian)</li>
<li>½ teaspoon sesame oil</li>
<li>A pinch of fresh ground white pepper</li>
<li>2 tablespoons vegetable oil</li>
<li>4 cloves of minced garlic (about a tablespoon)</li>
<li>1 tablespoon Shaoxing wine</li>
<li>Cornstarch slurry (1½ tablespoons cornstarch mixed with 1½ tablespoons water)</li>
<li>1 teaspoon homemade chili oil (optional)</li>
</ul>
</div>
</div>
<div id="outline-container-orgb0d0231" class="outline-4">
<h4 id="orgb0d0231">Method</h4>
<div class="outline-text-4" id="text-orgb0d0231">
<ol class="org-ol">
<li>Wash the broccoli thoroughly and set aside. Mix the soy sauces, rice wine vinegar, sugar, stock, sesame oil, and ground white pepper, and set aside.</li>
<li>Heat the wok over high heat. Add the vegetable oil, garlic, and broccoli and quickly stir-fry so the garlic doesn't burn.</li>
<li>Stir fry for 15 seconds, and add the Shaoxing rice wine around the perimeter of the wok. Give everything a quick stir and add in the sauce mixture. Let the sauce come to a boil, and mix the cornstarch and water together to make a slurry.</li>
<li>Add the cornstarch slurry slowly while stirring the broccoli and sauce constantly. Let the sauce cook and thicken until it coats the back of a spoon. If you like a thick sauce, add more cornstarch and water. If you like your sauce thinner, add less cornstarch and water. If you'd like, stir in the chili oil at this point. Serve!</li>
</ol>
</div>
</div>
<div id="outline-container-org1cd00b1" class="outline-4">
<h4 id="org1cd00b1">Credits</h4>
<div class="outline-text-4" id="text-org1cd00b1">
<p>
<a href="http://thewoksoflife.com/2017/03/broccoli-garlic-sauce/">http://thewoksoflife.com/2017/03/broccoli-garlic-sauce/</a>
<span class="timestamp-wrapper"><span class="timestamp">[2018-01-23 Tue] </span></span> Made for myself. It was ok, a bit too vinegary.
 Crispy Cauliflower Buffalo Wings
</p>
</div>
</div>
<div id="outline-container-org3b9d96f" class="outline-4">
<h4 id="org3b9d96f">Ingredients</h4>
<div class="outline-text-4" id="text-org3b9d96f">
<ul class="org-ul">
<li>1/2 head cauliflower, chopped into bite size pieces</li>
<li>1 cup garbanzo bean (or wheat) flour</li>
<li>1 cup water</li>
<li>1 tsp. garlic powder (or minced fresh garlic)</li>
<li>1/2 tsp. salt</li>
<li>1 tsp. melted butter or ghee</li>
<li>2/3 cup hot sauce</li>
</ul>
</div>
</div>
<div id="outline-container-orgff0ef94" class="outline-4">
<h4 id="orgff0ef94">Method</h4>
<div class="outline-text-4" id="text-orgff0ef94">
<ol class="org-ol">
<li>Preheat oven to 450F.</li>
<li>In a medium size bowl, combine flour, water, garlic powder and salt. Whisk together until smooth.</li>
<li>Toss cauliflower into batter making sure to coat each piece completely, then place battered
cauliflower on a lightly greased, non-stick baking sheet.</li>
<li>Bake for 15 minutes, tossing half way through.</li>
<li>In the meantime, combine melted butter and hot sauce in a large bowl, stirring.</li>
<li>When cauliflower is done, remove it from the oven and gently toss it in the hot sauce mixture.</li>
<li>Place cauliflower back on the baking sheet and cook for an additional 25 minutes or until it
becomes crispy. Allow cauliflower to cool for 15 minutes before serving.</li>
<li>Serve with your favorite creamy dressing.</li>
</ol>
</div>
</div>
<div id="outline-container-org0a07a78" class="outline-4">
<h4 id="org0a07a78">Yield Serves 4</h4>
</div>
<div id="outline-container-org2e6372d" class="outline-4">
<h4 id="org2e6372d">Credits</h4>
<div class="outline-text-4" id="text-org2e6372d">
<p>
<a href="http://www.mindbodygreen.com/0-13441/crispy-cauliflower-buffalo-wings-gluten-free.html">http://www.mindbodygreen.com/0-13441/crispy-cauliflower-buffalo-wings-gluten-free.html</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgd5d6df6" class="outline-3">
<h3 id="orgd5d6df6">Caramelized Onion and Sun-Dried Tomato Dip</h3>
<div class="outline-text-3" id="text-orgd5d6df6">
<p>
Makes 1 cup; serves 4-6
</p>
</div>
<div id="outline-container-orgbe8a33b" class="outline-4">
<h4 id="orgbe8a33b">Ingredients</h4>
<div class="outline-text-4" id="text-orgbe8a33b">
<ul class="org-ul">
<li>2 tablespoons	olive oil</li>
<li>1 tablespoon	butter</li>
<li>4 cups		sliced mild onions</li>
<li>1/4 teaspoon	dried rosemary, crumbled</li>
<li>1/8 teaspoon	dried thyme</li>
<li>1/3 cup		water</li>
<li>2 tablespoons	white wine</li>
<li>6			oil-marinated sun-dried tomato halves</li>
<li>1 tablespoon	chopped fresh parsley</li>
<li>1/2 teaspoon	capers (optional!)</li>
<li>6 small		pitted black olives (For best results use a good flavorful olive such as a kalamata.)</li>
</ul>
</div>
</div>
