recipes.org
*** Method
1. In a large skillet over medium-high heat, heat the oil and the butter.
2. Add the onion; cook, stirring until softened about 2 minutes. Stir in the
3. the rosemary and thyme. Lower the heat and cook slowly, uncovered, until onions are golden, stirring occasionally, about 45 minutes. [Don't try to hurry the onions; they'll know this and won't caramelize! -jc]
4. Add the water, wine, sun-dried tomatoes, parsley and capers (if you have to!). Bring to a boil. Remove from heat and transfer to a food processor container fitted with a steel blade. Add the olives. Cover and process until everything is finely chopped.
5. Variation: Substitute water for the wine.
*** Credits
- As served by John and Tracey at their house in November, 2002 from a recipe appearing on page 65 of the book "1,000 Vegetarian Recipes" by Carol Gelles.
- (date created: 6/27/2007 4:42:14 PM)
** Champ
*** Ingredients
- 2 lbs. potatoes, unpeeled
- 2/3 cup milk
- 4-5 scallions, finely chopped
- 1/4- 1/2 cup butter
- salt and pepper
*** Method
1. Champ, also known as cally, poundies and pandy, is one of the most famous ways of serving Ireland's best loved vegetable--the potato. Champ is the country's way of serving mashed potatoes.
2. Heat a pan of salted water and boil the potatoes in their skins until tender. Drain and dry over low heat covered with a paper towel. Peel and mash well.
3. While the potatoes are cooking, put the milk and chopped scallions into a saucepan, bring to a boil, and simmer for a few minutes. Gradually beat the milk and onion mixture into the mashed potatoes to form a soft, but not sloppy, mixture. Beat in half the butter and searson with salt pepper. Divide among 4 warm plates or bowls. Make a well in the center of each serving, cut the remaining butter into 4 pieces, and put one piece in each of the hollows. Serve immediately.
4. Cook's notes:
5. Traditionally, champ would have been served as a main meal, with a glass of milk or buttermilk. Today, however, it is used to acocompany meats such as boiled ham and broiled sausages. Parsley, young nettle tops, peas and fava beans can be substituted for the scallions.
6. Serves 4.
7. Prep time: 5 minutes
8. Cooking time: 20-25 minutes
*** Credits
- Irish Food & Folklore by Clare Connery
- Greg's 9/3/01 
- (date created: 6/27/2007 4:42:14 PM)
** Cheese Grits
*** Ingredients
- 1/2 c. white grits
- 3/4 tsp. salt
- 2 1/2 c. boiling water
- 1/4 lb. cheddar cheese, grated
- 1 egg, well beaten
- Pinch of cayenne pepper
- Paprika
*** Method
1. Gradually stir grits and salt into the boiling water. Cover and cook for about 10 minutes, until grits are done, stirring often. 
2. Add all but 1/3 cup of the grated cheese and the egg. Season with cayenne and stir until mixture is smooth. Cover and cook a little longer until cheese is melted. Pour into a well greased casserole and top with remaining cheese and dust with paprika. Bake in a 325 degree oven for 25 minutes.
3. Serves 2.
*** Credits
- (date created: 5/17/2008 7:56:05 AM)
** Chipotle Ranch Dressing
*** Ingredients, Version 1:
1. 1 cup mayonnaise
2. 1 cup sour cream
3. 1 cup buttermilk
4. 1 1/2 teaspoons granulated garlic
5. 1 teaspoon garlic powder
6. 1 1/2 teaspoons onion powder
7. 1/4 cup dried parsley ( I used fresh)
8. 1 1/2 teaspoons dried chipotle powder
9. 1 1/2 teaspoons lime juice
10. 1 1/2 teaspoons salt
*** Ingredients, Version 2:
1. 1/2 cup mayo (or use sour cream, vegan mayo “Veganaise” – or make with silken tofu, see notes below)
2. 1 tablespoon water (for a thinner sauce)
3. 1 - 2 teaspoons lime juice (to taste)
4. 1/8 teaspoon salt, more to taste
5. 1/2 teaspoon chili powder
6. 1 teaspoon smoked paprika
7. 1/8 - 1/4 teaspoon chipotle powder – you can also use one canned chipotle pepper (blending it with the mayo in a blender) or just stir in a teaspoon or two of the spicy smoky adobo sauce from the can. Start conservatively, adding more to taste.
*** Method
- Mix in mixer or food processor on low speed until well mixed. Or whisk.
- Refrigerate.
*** Credits
http://www.food.com/recipeprint.do?rid=250131
https://www.feastingathome.com/chipotle-mayo/
Made [2017-07-02 Sun]. Tasty!
** Easy Red Pepper Hummus
Serves 8
*** Ingredients
- 1 (16 ounce) can garbanzo beans, drained and rinsed
- 1 tablespoon olive oil
- 1 medium red bell pepper, cut into 1/2 inch pieces
- 1 tablespoon tahini
- 1 fresh lime, juiced
- 1 1/2 tablespoons water
- 1/2 teaspoon salt
- 1/4 teaspoon ground black pepper
- 1/4 teaspoon garlic powder
*** Method
1. In a food processor or blender, mix the garbanzo beans, olive oil, red bell pepper, tahini, lime juice, water, salt, black pepper, and garlic powder. Blend until smooth. 
*** Credits
- Posted by: "New Hope-L'ville Vegetarians"  nhlveg@yahoo.com     nhlveg
- Sat Dec 13, 2008 7:16 am (PST)
- Here's yet another "Recipe of the Week".  Please don't forget to send in your favorite recipes so we can keep this going.
- (date created: 12/15/2008 8:29:45 AM)
** Gougeres
Makes 16
*** Ingredients
- 1 cup water
- 1/2 cup unsalted butter, cut into pieces
- 1/2 teaspoon salt
- 1/8 teaspoon white pepper (black works too)
- 1/8 teaspoon cayenne pepper
- 1 cup all purpose flour
- 4 eggs at room temperature
- 3/4 cup to 1 1/2 cups finely shredded gruyere cheese (about 2 oz) - you can experiment with different kinds of cheese
