recipes.html
<div id="outline-container-org11c1012" class="outline-4">
<h4 id="org11c1012">Method</h4>
<div class="outline-text-4" id="text-org11c1012">
<ol class="org-ol">
<li>In a large skillet over medium-high heat, heat the oil and the butter.</li>
<li>Add the onion; cook, stirring until softened about 2 minutes. Stir in the</li>
<li>the rosemary and thyme. Lower the heat and cook slowly, uncovered, until onions are golden, stirring occasionally, about 45 minutes. [Don't try to hurry the onions; they'll know this and won't caramelize! -jc]</li>
<li>Add the water, wine, sun-dried tomatoes, parsley and capers (if you have to!). Bring to a boil. Remove from heat and transfer to a food processor container fitted with a steel blade. Add the olives. Cover and process until everything is finely chopped.</li>
<li>Variation: Substitute water for the wine.</li>
</ol>
</div>
</div>
<div id="outline-container-org7611c7a" class="outline-4">
<h4 id="org7611c7a">Credits</h4>
<div class="outline-text-4" id="text-org7611c7a">
<ul class="org-ul">
<li>As served by John and Tracey at their house in November, 2002 from a recipe appearing on page 65 of the book "1,000 Vegetarian Recipes" by Carol Gelles.</li>
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge457498" class="outline-3">
<h3 id="orge457498">Champ</h3>
<div class="outline-text-3" id="text-orge457498">
</div>
<div id="outline-container-org092eea4" class="outline-4">
<h4 id="org092eea4">Ingredients</h4>
<div class="outline-text-4" id="text-org092eea4">
<ul class="org-ul">
<li>2 lbs. potatoes, unpeeled</li>
<li>2/3 cup milk</li>
<li>4-5 scallions, finely chopped</li>
<li>1/4- 1/2 cup butter</li>
<li>salt and pepper</li>
</ul>
</div>
</div>
<div id="outline-container-org41a17d9" class="outline-4">
<h4 id="org41a17d9">Method</h4>
<div class="outline-text-4" id="text-org41a17d9">
<ol class="org-ol">
<li>Champ, also known as cally, poundies and pandy, is one of the most famous ways of serving Ireland's best loved vegetable&#x2013;the potato. Champ is the country's way of serving mashed potatoes.</li>
<li>Heat a pan of salted water and boil the potatoes in their skins until tender. Drain and dry over low heat covered with a paper towel. Peel and mash well.</li>
<li>While the potatoes are cooking, put the milk and chopped scallions into a saucepan, bring to a boil, and simmer for a few minutes. Gradually beat the milk and onion mixture into the mashed potatoes to form a soft, but not sloppy, mixture. Beat in half the butter and searson with salt pepper. Divide among 4 warm plates or bowls. Make a well in the center of each serving, cut the remaining butter into 4 pieces, and put one piece in each of the hollows. Serve immediately.</li>
<li>Cook's notes:</li>
<li>Traditionally, champ would have been served as a main meal, with a glass of milk or buttermilk. Today, however, it is used to acocompany meats such as boiled ham and broiled sausages. Parsley, young nettle tops, peas and fava beans can be substituted for the scallions.</li>
<li>Serves 4.</li>
<li>Prep time: 5 minutes</li>
<li>Cooking time: 20-25 minutes</li>
</ol>
</div>
</div>
<div id="outline-container-orgddeeb02" class="outline-4">
<h4 id="orgddeeb02">Credits</h4>
<div class="outline-text-4" id="text-orgddeeb02">
<ul class="org-ul">
<li>Irish Food &amp; Folklore by Clare Connery</li>
<li>Greg's 9/3/01</li>
<li>(date created: 6/27/2007 4:42:14 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org45efd86" class="outline-3">
<h3 id="org45efd86">Cheese Grits</h3>
<div class="outline-text-3" id="text-org45efd86">
</div>
<div id="outline-container-orgd9f5250" class="outline-4">
<h4 id="orgd9f5250">Ingredients</h4>
<div class="outline-text-4" id="text-orgd9f5250">
<ul class="org-ul">
<li>1/2 c. white grits</li>
<li>3/4 tsp. salt</li>
<li>2 1/2 c. boiling water</li>
<li>1/4 lb. cheddar cheese, grated</li>
<li>1 egg, well beaten</li>
<li>Pinch of cayenne pepper</li>
<li>Paprika</li>
</ul>
</div>
</div>
<div id="outline-container-orge97c34b" class="outline-4">
<h4 id="orge97c34b">Method</h4>
<div class="outline-text-4" id="text-orge97c34b">
<ol class="org-ol">
<li>Gradually stir grits and salt into the boiling water. Cover and cook for about 10 minutes, until grits are done, stirring often.</li>
<li>Add all but 1/3 cup of the grated cheese and the egg. Season with cayenne and stir until mixture is smooth. Cover and cook a little longer until cheese is melted. Pour into a well greased casserole and top with remaining cheese and dust with paprika. Bake in a 325 degree oven for 25 minutes.</li>
<li>Serves 2.</li>
</ol>
</div>
</div>
<div id="outline-container-org5191d6e" class="outline-4">
<h4 id="org5191d6e">Credits</h4>
<div class="outline-text-4" id="text-org5191d6e">
<ul class="org-ul">
<li>(date created: 5/17/2008 7:56:05 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc7dcad0" class="outline-3">
<h3 id="orgc7dcad0">Chipotle Ranch Dressing</h3>
<div class="outline-text-3" id="text-orgc7dcad0">
</div>
<div id="outline-container-org3587a1b" class="outline-4">
<h4 id="org3587a1b">Ingredients, Version 1:</h4>
<div class="outline-text-4" id="text-org3587a1b">
<ol class="org-ol">
<li>1 cup mayonnaise</li>
<li>1 cup sour cream</li>
<li>1 cup buttermilk</li>
<li>1 1/2 teaspoons granulated garlic</li>
<li>1 teaspoon garlic powder</li>
<li>1 1/2 teaspoons onion powder</li>
<li>1/4 cup dried parsley ( I used fresh)</li>
<li>1 1/2 teaspoons dried chipotle powder</li>
<li>1 1/2 teaspoons lime juice</li>
<li>1 1/2 teaspoons salt</li>
</ol>
</div>
</div>
<div id="outline-container-org3e358d2" class="outline-4">
<h4 id="org3e358d2">Ingredients, Version 2:</h4>
<div class="outline-text-4" id="text-org3e358d2">
<ol class="org-ol">
<li>1/2 cup mayo (or use sour cream, vegan mayo “Veganaise” – or make with silken tofu, see notes below)</li>
<li>1 tablespoon water (for a thinner sauce)</li>
<li>1 - 2 teaspoons lime juice (to taste)</li>
<li>1/8 teaspoon salt, more to taste</li>
<li>1/2 teaspoon chili powder</li>
<li>1 teaspoon smoked paprika</li>
<li>1/8 - 1/4 teaspoon chipotle powder – you can also use one canned chipotle pepper (blending it with the mayo in a blender) or just stir in a teaspoon or two of the spicy smoky adobo sauce from the can. Start conservatively, adding more to taste.</li>
</ol>
</div>
</div>
<div id="outline-container-org9900b4d" class="outline-4">
<h4 id="org9900b4d">Method</h4>
<div class="outline-text-4" id="text-org9900b4d">
<ul class="org-ul">
<li>Mix in mixer or food processor on low speed until well mixed. Or whisk.</li>
<li>Refrigerate.</li>
</ul>
</div>
</div>
<div id="outline-container-org340676b" class="outline-4">
<h4 id="org340676b">Credits</h4>
<div class="outline-text-4" id="text-org340676b">
<p>
<a href="http://www.food.com/recipeprint.do?rid=250131">http://www.food.com/recipeprint.do?rid=250131</a>
<a href="https://www.feastingathome.com/chipotle-mayo/">https://www.feastingathome.com/chipotle-mayo/</a>
Made <span class="timestamp-wrapper"><span class="timestamp">[2017-07-02 Sun]</span></span>. Tasty!
</p>
</div>
</div>
</div>
<div id="outline-container-org27a26ba" class="outline-3">
<h3 id="org27a26ba">Easy Red Pepper Hummus</h3>
<div class="outline-text-3" id="text-org27a26ba">
<p>
Serves 8
</p>
</div>
<div id="outline-container-org828a160" class="outline-4">
<h4 id="org828a160">Ingredients</h4>
<div class="outline-text-4" id="text-org828a160">
<ul class="org-ul">
<li>1 (16 ounce) can garbanzo beans, drained and rinsed</li>
<li>1 tablespoon olive oil</li>
<li>1 medium red bell pepper, cut into 1/2 inch pieces</li>
<li>1 tablespoon tahini</li>
<li>1 fresh lime, juiced</li>
<li>1 1/2 tablespoons water</li>
<li>1/2 teaspoon salt</li>
<li>1/4 teaspoon ground black pepper</li>
<li>1/4 teaspoon garlic powder</li>
</ul>
</div>
</div>
<div id="outline-container-orgdaad5af" class="outline-4">
<h4 id="orgdaad5af">Method</h4>
<div class="outline-text-4" id="text-orgdaad5af">
<ol class="org-ol">
<li>In a food processor or blender, mix the garbanzo beans, olive oil, red bell pepper, tahini, lime juice, water, salt, black pepper, and garlic powder. Blend until smooth.</li>
</ol>
</div>
</div>
<div id="outline-container-orgb38a481" class="outline-4">
<h4 id="orgb38a481">Credits</h4>
<div class="outline-text-4" id="text-orgb38a481">
<ul class="org-ul">
<li>Posted by: "New Hope-L'ville Vegetarians"  nhlveg@yahoo.com     nhlveg</li>
<li>Sat Dec 13, 2008 7:16 am (PST)</li>
<li>Here's yet another "Recipe of the Week".  Please don't forget to send in your favorite recipes so we can keep this going.</li>
<li>(date created: 12/15/2008 8:29:45 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1b46ee0" class="outline-3">
<h3 id="org1b46ee0">Gougeres</h3>
<div class="outline-text-3" id="text-org1b46ee0">
<p>
Makes 16
</p>
</div>
<div id="outline-container-org875b4c6" class="outline-4">
<h4 id="org875b4c6">Ingredients</h4>
<div class="outline-text-4" id="text-org875b4c6">
<ul class="org-ul">
<li>1 cup water</li>
<li>1/2 cup unsalted butter, cut into pieces</li>
<li>1/2 teaspoon salt</li>
<li>1/8 teaspoon white pepper (black works too)</li>
<li>1/8 teaspoon cayenne pepper</li>
<li>1 cup all purpose flour</li>
<li>4 eggs at room temperature</li>
<li>3/4 cup to 1 1/2 cups finely shredded gruyere cheese (about 2 oz) - you can experiment with different kinds of cheese</li>
</ul>
</div>
</div>
