recipes.org
*** Method
1. Place water, butter, salt and pepper in heavy medium saucepan.  Heat over medium heat stirring until butter is melted and mixture boils. 
2. Stir in flour all at once.  Beat  with wooden spoon over heat until begins to form a ball, about 1 minute. 
3. Remove from heat and beat until slightly cooled about 30 seconds.
4. Add eggs to flour mixture one at a time while beating with electric hand mixer between each addition until mixture has a dull satiny sheen. 
5. Stir in cheese until well blended.
6. Butter and flour large baking sheet, or line with parchment paper.  Drop warm paste by heaping tablespoonfuls onto baking sheet at least 2 inches apart. 
7. Bake until very well browned at 350 degrees, about 35 minutes.  It could take longer for them to be well browned. 
8. Remove from oven and transfer to wire rack.  Cut tiny slit in side of each puff to allow steam to escape. 
9. These are best eaten the day they are baked.  You can freeze them on the baking sheet before cooking (add 10 minutes to cooking time) or heat them briefly to crisp them up again if you make them the previous day. 
*** Credits
- Great with soup or salad.
- (date created: 6/27/2007 4:42:10 PM)
** Habanero Hot Sauce
*** Ingredients
- 5 garlic cloves, unpeeled
- 1/2 cup peeled, roughly chopped carrot (you'll need 1 medium carrot)
- 1/2 cup roughly chopped white onion (you'll need about half of a small onion)
- 12 medium (about 5 ounces) orange habanero chiles, stemmed
- 1 cup apple cider vinegar
- About 2 teaspoons Salt
- 1/4 teaspoon Sugar
*** Method
1. Roast the garlic in a skillet over medium heat, turning regularly until soft and blackened in spots, 10 to 15 minutes. Cool and peel.
2. In a small saucepan, combine the carrot, onion and habanero chiles with the vinegar and 1 cup water. Partially cover and simmer over medium-low heat until the carrots are thoroughly tender, about 10 minutes.
3. Pour into a blender jar, add the roasted garlic, salt and sugar. Blend until smooth. Thin with a little additional water if you think your hot sauce is too thick. Taste and season with additional salt if you think necessary.
4. Pour into jars or bottles and store in the refrigerator until you're ready to add some dazzle to a dish.
*** Yield
- Servings: 2cups
*** Credits
- http://www.rickbayless.com/wp-content/plugins/wp-ultimate-recipe/template/recipe_print.php
- Recipe from Season 5 of Mexico-One Plate at a Time
** Hollandaise Sauce
*** Ingredients
- 2 egg yolks
- 3 Tbls lemon juice
- 1/2 cup butter
*** Method
1. Stir 2 egg yolks, slightly beaten, and 3 tablespoons lemon juice vigorously in 1-quart saucepan with wooden spoon.
2. Add 1/4 cup butter. Heat over very low heat, stirring constantly, until butter is melted.
3. Add 1/4 cup butter, stirring vigorously until butter is melted and sauce thickens.
4. (Be sure butter melts slowly; this give eggs time to cook and thicken sauce without curdling.) Serve hot or at room temperature. 
*** Yield 3/4 cup sauce
*** Credits
- Betty Crocker
- (date created: 6/27/2007 4:42:10 PM)
** Indian-Style Rice Salad
Time: 30 to 60 minutes, depending on the type of rice
*** Ingredients
- 1 1/2 to 2 cups brown or white basmati rice
- Salt and freshly ground black pepper
- 1/4 cup chopped scallion
- 3/4 cup cubed cooked potato
- 3/4 cup cooked cauliflower florets
- 3/4 cup cooked green peas
- 1/2 cup coconut milk, or more as needed
- 3 tablespoons rice wine vinegar, or more to taste
- 1 tablespoon curry powder, or to taste
- 1 jalapeno or other hot fresh chili, stemmed, seeded and minced, or to taste, optional
- 1/2 cup chopped fresh cilantro.
*** Method
1. Cook rice in abundant salted water, as you would pasta, until it's just done; white rice will take 10 to 15 minutes, brown 30 or a little longer.
2. Drain, rinse in cold water, drain again, then combine with vegetables in a large bowl.
3. Combine black pepper, coconut milk, rice wine vinegar and curry powder in a blender and turn machine on; a creamy emulsion will form within 30 seconds. Taste and add more vinegar a teaspoon or two at a time until balance tastes right to you, then add more curry powder, salt, or pepper, if needed.
4. Drizzle vinaigrette over rice and vegetables.
5. Use 2 big forks to combine, fluffing rice and tossing gently to separate grains.
6. Stir in chili, if using, and cilantro, taste, and adjust seasoning or moisten with a little more dressing.
7. Serve at room temperature, or refrigerate for up to a day, bringing salad back to room temperature before serving.
*** Yield 4 to 8 servings.
*** Credits
- New York Times "The Minimalist" 30 July 2008
- (date created: 7/31/2008 9:53:08 AM)
** Japanese Ginger Dressing
*** Ingredients
1. 1/2 onion
2. 1/2 cup canola oil
3. 1/2 cup rice vinegar
4. 1/4 cup soy sauce
5. 1 inch chunk of fresh ginger
6. 1 tbs sugar
7. Salt and pepper to taste
*** Method
Mix everything
** Patatas Bravas
*** Ingredients
**** Dipping Sauce:
- 1 clove garlic, minced, or more to taste
- 1/2 teaspoon smoked paprika
- 1 pinch salt
- 1 cup mayonnaise
- 1 tablespoon sherry vinegar, or more to taste
- 1 teaspoon tomato paste
- 1/4 teaspoon ground chipotle peppers
- 1 pinch cayenne pepper, or more to taste
**** Spice Blend:
- 1/2 tablespoon salt (was 1T)
- 1/2 teaspoon ground black pepper
- 1/2 teaspoon paprika
- 1/2 teaspoon ground chipotle peppers
**** Patatas
- 2 quarts cold water
- 1 tablespoon salt
- 1 teaspoon smoked paprika
- 1 teaspoon ground cumin
- 2 bay leaves
- 2 pounds russet potatoes, peeled and cut into 1-inch cubes
- 2 cups vegetable oil for frying
