recipes.html
<div id="outline-container-orge12120e" class="outline-4">
<h4 id="orge12120e">Method</h4>
<div class="outline-text-4" id="text-orge12120e">
<ol class="org-ol">
<li>Place water, butter, salt and pepper in heavy medium saucepan.  Heat over medium heat stirring until butter is melted and mixture boils.</li>
<li>Stir in flour all at once.  Beat  with wooden spoon over heat until begins to form a ball, about 1 minute.</li>
<li>Remove from heat and beat until slightly cooled about 30 seconds.</li>
<li>Add eggs to flour mixture one at a time while beating with electric hand mixer between each addition until mixture has a dull satiny sheen.</li>
<li>Stir in cheese until well blended.</li>
<li>Butter and flour large baking sheet, or line with parchment paper.  Drop warm paste by heaping tablespoonfuls onto baking sheet at least 2 inches apart.</li>
<li>Bake until very well browned at 350 degrees, about 35 minutes.  It could take longer for them to be well browned.</li>
<li>Remove from oven and transfer to wire rack.  Cut tiny slit in side of each puff to allow steam to escape.</li>
<li>These are best eaten the day they are baked.  You can freeze them on the baking sheet before cooking (add 10 minutes to cooking time) or heat them briefly to crisp them up again if you make them the previous day.</li>
</ol>
</div>
</div>
<div id="outline-container-orgd2d5d22" class="outline-4">
<h4 id="orgd2d5d22">Credits</h4>
<div class="outline-text-4" id="text-orgd2d5d22">
<ul class="org-ul">
<li>Great with soup or salad.</li>
<li>(date created: 6/27/2007 4:42:10 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgefb22a4" class="outline-3">
<h3 id="orgefb22a4">Habanero Hot Sauce</h3>
<div class="outline-text-3" id="text-orgefb22a4">
</div>
<div id="outline-container-org5f5d077" class="outline-4">
<h4 id="org5f5d077">Ingredients</h4>
<div class="outline-text-4" id="text-org5f5d077">
<ul class="org-ul">
<li>5 garlic cloves, unpeeled</li>
<li>1/2 cup peeled, roughly chopped carrot (you'll need 1 medium carrot)</li>
<li>1/2 cup roughly chopped white onion (you'll need about half of a small onion)</li>
<li>12 medium (about 5 ounces) orange habanero chiles, stemmed</li>
<li>1 cup apple cider vinegar</li>
<li>About 2 teaspoons Salt</li>
<li>1/4 teaspoon Sugar</li>
</ul>
</div>
</div>
<div id="outline-container-org2a165d3" class="outline-4">
<h4 id="org2a165d3">Method</h4>
<div class="outline-text-4" id="text-org2a165d3">
<ol class="org-ol">
<li>Roast the garlic in a skillet over medium heat, turning regularly until soft and blackened in spots, 10 to 15 minutes. Cool and peel.</li>
<li>In a small saucepan, combine the carrot, onion and habanero chiles with the vinegar and 1 cup water. Partially cover and simmer over medium-low heat until the carrots are thoroughly tender, about 10 minutes.</li>
<li>Pour into a blender jar, add the roasted garlic, salt and sugar. Blend until smooth. Thin with a little additional water if you think your hot sauce is too thick. Taste and season with additional salt if you think necessary.</li>
<li>Pour into jars or bottles and store in the refrigerator until you're ready to add some dazzle to a dish.</li>
</ol>
</div>
</div>
<div id="outline-container-org889b7a7" class="outline-4">
<h4 id="org889b7a7">Yield</h4>
<div class="outline-text-4" id="text-org889b7a7">
<ul class="org-ul">
<li>Servings: 2cups</li>
</ul>
</div>
</div>
<div id="outline-container-org495ad05" class="outline-4">
<h4 id="org495ad05">Credits</h4>
<div class="outline-text-4" id="text-org495ad05">
<ul class="org-ul">
<li><a href="http://www.rickbayless.com/wp-content/plugins/wp-ultimate-recipe/template/recipe_print.php">http://www.rickbayless.com/wp-content/plugins/wp-ultimate-recipe/template/recipe_print.php</a></li>
<li>Recipe from Season 5 of Mexico-One Plate at a Time</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org353918f" class="outline-3">
<h3 id="org353918f">Hollandaise Sauce</h3>
<div class="outline-text-3" id="text-org353918f">
</div>
<div id="outline-container-org09d91e2" class="outline-4">
<h4 id="org09d91e2">Ingredients</h4>
<div class="outline-text-4" id="text-org09d91e2">
<ul class="org-ul">
<li>2 egg yolks</li>
<li>3 Tbls lemon juice</li>
<li>1/2 cup butter</li>
</ul>
</div>
</div>
<div id="outline-container-org8abc840" class="outline-4">
<h4 id="org8abc840">Method</h4>
<div class="outline-text-4" id="text-org8abc840">
<ol class="org-ol">
<li>Stir 2 egg yolks, slightly beaten, and 3 tablespoons lemon juice vigorously in 1-quart saucepan with wooden spoon.</li>
<li>Add 1/4 cup butter. Heat over very low heat, stirring constantly, until butter is melted.</li>
<li>Add 1/4 cup butter, stirring vigorously until butter is melted and sauce thickens.</li>
<li>(Be sure butter melts slowly; this give eggs time to cook and thicken sauce without curdling.) Serve hot or at room temperature.</li>
</ol>
</div>
</div>
<div id="outline-container-orge641ee8" class="outline-4">
<h4 id="orge641ee8">Yield 3/4 cup sauce</h4>
</div>
<div id="outline-container-orga79353c" class="outline-4">
<h4 id="orga79353c">Credits</h4>
<div class="outline-text-4" id="text-orga79353c">
<ul class="org-ul">
<li>Betty Crocker</li>
<li>(date created: 6/27/2007 4:42:10 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf1cff04" class="outline-3">
<h3 id="orgf1cff04">Indian-Style Rice Salad</h3>
<div class="outline-text-3" id="text-orgf1cff04">
<p>
Time: 30 to 60 minutes, depending on the type of rice
</p>
</div>
<div id="outline-container-orgf61e6fb" class="outline-4">
<h4 id="orgf61e6fb">Ingredients</h4>
<div class="outline-text-4" id="text-orgf61e6fb">
<ul class="org-ul">
<li>1 1/2 to 2 cups brown or white basmati rice</li>
<li>Salt and freshly ground black pepper</li>
<li>1/4 cup chopped scallion</li>
<li>3/4 cup cubed cooked potato</li>
<li>3/4 cup cooked cauliflower florets</li>
<li>3/4 cup cooked green peas</li>
<li>1/2 cup coconut milk, or more as needed</li>
<li>3 tablespoons rice wine vinegar, or more to taste</li>
<li>1 tablespoon curry powder, or to taste</li>
<li>1 jalapeno or other hot fresh chili, stemmed, seeded and minced, or to taste, optional</li>
<li>1/2 cup chopped fresh cilantro.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf11ad95" class="outline-4">
<h4 id="orgf11ad95">Method</h4>
<div class="outline-text-4" id="text-orgf11ad95">
<ol class="org-ol">
<li>Cook rice in abundant salted water, as you would pasta, until it's just done; white rice will take 10 to 15 minutes, brown 30 or a little longer.</li>
<li>Drain, rinse in cold water, drain again, then combine with vegetables in a large bowl.</li>
<li>Combine black pepper, coconut milk, rice wine vinegar and curry powder in a blender and turn machine on; a creamy emulsion will form within 30 seconds. Taste and add more vinegar a teaspoon or two at a time until balance tastes right to you, then add more curry powder, salt, or pepper, if needed.</li>
<li>Drizzle vinaigrette over rice and vegetables.</li>
<li>Use 2 big forks to combine, fluffing rice and tossing gently to separate grains.</li>
<li>Stir in chili, if using, and cilantro, taste, and adjust seasoning or moisten with a little more dressing.</li>
<li>Serve at room temperature, or refrigerate for up to a day, bringing salad back to room temperature before serving.</li>
</ol>
</div>
</div>
<div id="outline-container-org22a51ea" class="outline-4">
<h4 id="org22a51ea">Yield 4 to 8 servings.</h4>
</div>
<div id="outline-container-org8b8c97b" class="outline-4">
<h4 id="org8b8c97b">Credits</h4>
<div class="outline-text-4" id="text-org8b8c97b">
<ul class="org-ul">
<li>New York Times "The Minimalist" 30 July 2008</li>
<li>(date created: 7/31/2008 9:53:08 AM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9870106" class="outline-3">
<h3 id="org9870106">Japanese Ginger Dressing</h3>
<div class="outline-text-3" id="text-org9870106">
</div>
<div id="outline-container-org0875db9" class="outline-4">
<h4 id="org0875db9">Ingredients</h4>
<div class="outline-text-4" id="text-org0875db9">
<ol class="org-ol">
<li>1/2 onion</li>
<li>1/2 cup canola oil</li>
<li>1/2 cup rice vinegar</li>
<li>1/4 cup soy sauce</li>
<li>1 inch chunk of fresh ginger</li>
<li>1 tbs sugar</li>
<li>Salt and pepper to taste</li>
</ol>
</div>
</div>
<div id="outline-container-orgb08bdbf" class="outline-4">
<h4 id="orgb08bdbf">Method</h4>
<div class="outline-text-4" id="text-orgb08bdbf">
<p>
Mix everything
</p>
</div>
</div>
</div>
<div id="outline-container-org5b239da" class="outline-3">
<h3 id="org5b239da">Patatas Bravas</h3>
<div class="outline-text-3" id="text-org5b239da">
</div>
<div id="outline-container-org9a7b5de" class="outline-4">
<h4 id="org9a7b5de">Ingredients</h4>
<div class="outline-text-4" id="text-org9a7b5de">
</div>
<ul class="org-ul">
<li><a id="org10997b8"></a>Dipping Sauce:<br />
<div class="outline-text-5" id="text-org10997b8">
<ul class="org-ul">
<li>1 clove garlic, minced, or more to taste</li>
<li>1/2 teaspoon smoked paprika</li>
<li>1 pinch salt</li>
<li>1 cup mayonnaise</li>
<li>1 tablespoon sherry vinegar, or more to taste</li>
<li>1 teaspoon tomato paste</li>
<li>1/4 teaspoon ground chipotle peppers</li>
<li>1 pinch cayenne pepper, or more to taste</li>
</ul>
</div>
</li>
<li><a id="org8b88b93"></a>Spice Blend:<br />
<div class="outline-text-5" id="text-org8b88b93">
<ul class="org-ul">
<li>1/2 tablespoon salt (was 1T)</li>
<li>1/2 teaspoon ground black pepper</li>
<li>1/2 teaspoon paprika</li>
<li>1/2 teaspoon ground chipotle peppers</li>
</ul>
</div>
</li>
<li><a id="org90a504f"></a>Patatas<br />
<div class="outline-text-5" id="text-org90a504f">
<ul class="org-ul">
<li>2 quarts cold water</li>
<li>1 tablespoon salt</li>
<li>1 teaspoon smoked paprika</li>
<li>1 teaspoon ground cumin</li>
<li>2 bay leaves</li>
<li>2 pounds russet potatoes, peeled and cut into 1-inch cubes</li>
<li>2 cups vegetable oil for frying</li>
</ul>
</div>
</li>
</ul>
</div>
