recipes.org
*** Method
1. Combine garlic, 1/2 teaspoon smoked paprika, and a pinch of salt in a mortar and pestle or food processor; process until smooth. Mix in mayonnaise, sherry vinegar, tomato paste, 1/4 teaspoon chipotle chile powder, and cayenne pepper until combined. Cover and refrigerate dipping sauce.
2. Mix 1 tablespoon salt, black pepper, 1/2 teaspoon smoked paprika, and 1/2 teaspoon chipotle chile powder together in a small bowl. Set spice blend aside.
3. Pour water into a large saucepan and stir 1 tablespoon salt, 1 teaspoon smoked paprika, cumin, and bay leaves into water. Bring to a boil, reduce heat to low, and cover; simmer for 10 minutes.
4. Stir potatoes into water-paprika mixture, bring to a boil, and simmer until potatoes are tender but not fully cooked, 4 to 5 minutes. The tip of a paring knife should easily insert into the center of a potato cube. Drain potatoes and transfer to a wire rack to cool completely, about 45 minutes.
5. Heat vegetable oil in a large cast iron skillet or Dutch oven to 350 degrees F (175 degrees C). Add cooled potato cubes and cook, stirring frequently, until golden brown, 5 to 6 minutes. Transfer potatoes to a baking sheet lined with paper towels to cool slightly. Toss in a bowl with spice blend and serve with dipping sauce.
*** Credits
https://www.allrecipes.com/recipe/230569/chef-johns-patatas-bravas/print/?recipeType=Recipe&servings=4&isMetric=false
** Persian Carrots
*** First Recipe
**** Ingredients
- 5 medium carrots, sliced diagonally into ¼ inch thick ovals
- 1 medium onion, cut into ¼ inch thick half rings
- 4 Tbsp. unsalted butter
- ¼ cup raisins
- ¼ cup pitted dates, cut into ¼ inch thick slivers
- ½ tsp. salt
- ¼ tsp. sugar
**** Method
1. Melt butter in a medium skillet over medium heat.
2. Add carrots, onion, raisins, & dates.
3. Stir & fry gently for 5 minutes.
4. Add the salt & sugar. Stir & fry for another 4 to 5 minutes, until carrots are just tender & onion is soft.
*** Second Recipe
**** Ingredients
- salt and pepper; to taste
- 1 Onion, sliced
- 4 tb Sultanas or currants
- 3 large or 4 medium carrots
- 100 ml Water
- 8 fresh dates
- 2 tbs olive oil
Original recipe makes 4 Servings
**** Method
1. This side dish with a difference goes very well with plainly grilled or roasted chicken or braised lamb.
2. Wash 3 large or 4 medium carrots and slice into rounds.
3. Peel one onion and slice. 
4. Stone 8 fresh dates (or substitute dried) and cut into slices lengthwise.
5. Have ready 4 tablespoons of currants or sultanas.
6. Heat 2 tablespoons olive oil in a wide saucepan. Add all the prepared ingredients and stir-fry for a minute or two, then add 100 mL water, cover and bring to a fast boil. Add salt to taste and put back the lid at an angle so that steam can escape. Cook for about 10 minutes, stirring occasionally, until the carrots are tender and the water has evaporated. If water remains, remove the lid and raise the heat to dry it off.
7. Serve.
*** Credits
- Posted by Stephen Ceideburg From an article by Meryl Constance in The
- Sydney Morning Herald, 6/8/93.
- Courtesy Mark Herron.
- first recipe https://www.driftlessorganics.com/carrots-with-raisins-dates/
- second [[http://www.bigoven.com/recipe/persian-carrots/4291]]
** Socca (Farinata) 
Time: 45 minutes 
*** Ingredients
- 1 cup chickpea flour 
- 1 teaspoon salt 
- 1 teaspoon, at least, ground black pepper 
- 1 cup water, lukewarm
- 4 to 6 tablespoons olive oil, divided
- 1/2 large (red?) onion, thinly sliced, optional 
- 1 tablespoon fresh rosemary leaves, optional
*** Method
1. Heat oven to 450 degrees. Put a well-seasoned or nonstick 12-inch pizza pan or cast-iron skillet in oven.
2. Sift chickpea flour into a bowl.
3. Add salt and pepper, then slowly add 1 cup lukewarm water, whisking to eliminate lumps.
4. Stir in 2 tablespoons olive oil.
5. Cover, and let sit while oven heats, or as long as 12 hours. Batter should be about the consistency of heavy cream.
6. If using onion and rosemary, stir them into batter.
7. Pour 2 tablespoons oil into heated pan, and swirl to cover pan evenly.
8. Pour in batter, and bake 12 to 15 minutes, or until pancake is firm and edges set.
9. Heat broiler, and brush top of socca with 1 or 2 tablespoons of oil if it looks dry.
10. Set socca a few inches away from broiler for a few minutes, just long enough to brown it spottily. Cut it into wedges, and serve hot, or at least warm. 
*** Yield 4 to 6 appetizer servings.
*** Credits
http://query.nytimes.com/gst/fullpage.html?res=9E05E6D7153FF93AA25753C1A9639C8B63
** Soup of Bitter Greens with Cheese Dumplings
*** Ingredients
- 1 cup parmesean cheese
- 1 cup pecorino romano cheese
- 3/4 cup fine dry bread crumbs
- 1 Tblsp parsley
- 4 large eggs, lightly beaten
- 2 cloves garlic
- 2 Tblsp olive oil
- 1/2 pound bitter greens, chopped
- (e.g., escarole, chickory)
- 2 quarts broth
*** Method
1. In a large bowl combine parmesean, romano, bread crumbs, parley, eggs and half of the garlic. Stir until a soft dough forms. Using moistened hands, roll the mixture in to  3/4 inch balls and arrange in a single layer on a baking sheet lined with plastic wrap. Refrigerate about 30 minutes.
2. Meanwhile, in a medium saucepan, heat the olive oil until shimmering. Add the remaining garlic and cook over moderately high heat, about 30 seconds. Add the greens and cook, stirring, until wilted and just beginning to brown, about 3-4 minutes longer.
3. Add the stock and bring to simmer. Drop the dumplings into the stock and cook until they rise to the surface, about 5 minutes.
4. Season with salt and pepper and serve in deep bowls, passing extra pecorino at the table. 
5. Make ahead: the uncooked dumplings may be made overnight.
*** Credits
- Food and Wine April 2003
- (date created: 6/27/2007 4:42:13 PM)
** White Corn Tortilla Soup
