recipes.html
<div id="outline-container-org3e5f4fe" class="outline-4">
<h4 id="org3e5f4fe">Method</h4>
<div class="outline-text-4" id="text-org3e5f4fe">
<ol class="org-ol">
<li>Combine garlic, 1/2 teaspoon smoked paprika, and a pinch of salt in a mortar and pestle or food processor; process until smooth. Mix in mayonnaise, sherry vinegar, tomato paste, 1/4 teaspoon chipotle chile powder, and cayenne pepper until combined. Cover and refrigerate dipping sauce.</li>
<li>Mix 1 tablespoon salt, black pepper, 1/2 teaspoon smoked paprika, and 1/2 teaspoon chipotle chile powder together in a small bowl. Set spice blend aside.</li>
<li>Pour water into a large saucepan and stir 1 tablespoon salt, 1 teaspoon smoked paprika, cumin, and bay leaves into water. Bring to a boil, reduce heat to low, and cover; simmer for 10 minutes.</li>
<li>Stir potatoes into water-paprika mixture, bring to a boil, and simmer until potatoes are tender but not fully cooked, 4 to 5 minutes. The tip of a paring knife should easily insert into the center of a potato cube. Drain potatoes and transfer to a wire rack to cool completely, about 45 minutes.</li>
<li>Heat vegetable oil in a large cast iron skillet or Dutch oven to 350 degrees F (175 degrees C). Add cooled potato cubes and cook, stirring frequently, until golden brown, 5 to 6 minutes. Transfer potatoes to a baking sheet lined with paper towels to cool slightly. Toss in a bowl with spice blend and serve with dipping sauce.</li>
</ol>
</div>
</div>
<div id="outline-container-orga874d33" class="outline-4">
<h4 id="orga874d33">Credits</h4>
<div class="outline-text-4" id="text-orga874d33">
<p>
<a href="https://www.allrecipes.com/recipe/230569/chef-johns-patatas-bravas/print/?recipeType=Recipe&amp;servings=4&amp;isMetric=false">https://www.allrecipes.com/recipe/230569/chef-johns-patatas-bravas/print/?recipeType=Recipe&amp;servings=4&amp;isMetric=false</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org78fd27f" class="outline-3">
<h3 id="org78fd27f">Persian Carrots</h3>
<div class="outline-text-3" id="text-org78fd27f">
</div>
<div id="outline-container-orga0cb0b1" class="outline-4">
<h4 id="orga0cb0b1">First Recipe</h4>
<div class="outline-text-4" id="text-orga0cb0b1">
</div>
<ul class="org-ul">
<li><a id="org4bcc62b"></a>Ingredients<br />
<div class="outline-text-5" id="text-org4bcc62b">
<ul class="org-ul">
<li>5 medium carrots, sliced diagonally into ¼ inch thick ovals</li>
<li>1 medium onion, cut into ¼ inch thick half rings</li>
<li>4 Tbsp. unsalted butter</li>
<li>¼ cup raisins</li>
<li>¼ cup pitted dates, cut into ¼ inch thick slivers</li>
<li>½ tsp. salt</li>
<li>¼ tsp. sugar</li>
</ul>
</div>
</li>
<li><a id="org77405aa"></a>Method<br />
<div class="outline-text-5" id="text-org77405aa">
<ol class="org-ol">
<li>Melt butter in a medium skillet over medium heat.</li>
<li>Add carrots, onion, raisins, &amp; dates.</li>
<li>Stir &amp; fry gently for 5 minutes.</li>
<li>Add the salt &amp; sugar. Stir &amp; fry for another 4 to 5 minutes, until carrots are just tender &amp; onion is soft.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org32547a2" class="outline-4">
<h4 id="org32547a2">Second Recipe</h4>
<div class="outline-text-4" id="text-org32547a2">
</div>
<ul class="org-ul">
<li><a id="orgf1f5f4a"></a>Ingredients<br />
<div class="outline-text-5" id="text-orgf1f5f4a">
<ul class="org-ul">
<li>salt and pepper; to taste</li>
<li>1 Onion, sliced</li>
<li>4 tb Sultanas or currants</li>
<li>3 large or 4 medium carrots</li>
<li>100 ml Water</li>
<li>8 fresh dates</li>
<li>2 tbs olive oil</li>
</ul>
<p>
Original recipe makes 4 Servings
</p>
</div>
</li>
<li><a id="org73d618f"></a>Method<br />
<div class="outline-text-5" id="text-org73d618f">
<ol class="org-ol">
<li>This side dish with a difference goes very well with plainly grilled or roasted chicken or braised lamb.</li>
<li>Wash 3 large or 4 medium carrots and slice into rounds.</li>
<li>Peel one onion and slice.</li>
<li>Stone 8 fresh dates (or substitute dried) and cut into slices lengthwise.</li>
<li>Have ready 4 tablespoons of currants or sultanas.</li>
<li>Heat 2 tablespoons olive oil in a wide saucepan. Add all the prepared ingredients and stir-fry for a minute or two, then add 100 mL water, cover and bring to a fast boil. Add salt to taste and put back the lid at an angle so that steam can escape. Cook for about 10 minutes, stirring occasionally, until the carrots are tender and the water has evaporated. If water remains, remove the lid and raise the heat to dry it off.</li>
<li>Serve.</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd4e3d1a" class="outline-4">
<h4 id="orgd4e3d1a">Credits</h4>
<div class="outline-text-4" id="text-orgd4e3d1a">
<ul class="org-ul">
<li>Posted by Stephen Ceideburg From an article by Meryl Constance in The</li>
<li>Sydney Morning Herald, 6/8/93.</li>
<li>Courtesy Mark Herron.</li>
<li>first recipe <a href="https://www.driftlessorganics.com/carrots-with-raisins-dates/">https://www.driftlessorganics.com/carrots-with-raisins-dates/</a></li>
<li>second <a href="http://www.bigoven.com/recipe/persian-carrots/4291">http://www.bigoven.com/recipe/persian-carrots/4291</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgec7646c" class="outline-3">
<h3 id="orgec7646c">Socca (Farinata)</h3>
<div class="outline-text-3" id="text-orgec7646c">
<p>
Time: 45 minutes 
</p>
</div>
<div id="outline-container-orgfcad817" class="outline-4">
<h4 id="orgfcad817">Ingredients</h4>
<div class="outline-text-4" id="text-orgfcad817">
<ul class="org-ul">
<li>1 cup chickpea flour</li>
<li>1 teaspoon salt</li>
<li>1 teaspoon, at least, ground black pepper</li>
<li>1 cup water, lukewarm</li>
<li>4 to 6 tablespoons olive oil, divided</li>
<li>1/2 large (red?) onion, thinly sliced, optional</li>
<li>1 tablespoon fresh rosemary leaves, optional</li>
</ul>
</div>
</div>
<div id="outline-container-org6a1295f" class="outline-4">
<h4 id="org6a1295f">Method</h4>
<div class="outline-text-4" id="text-org6a1295f">
<ol class="org-ol">
<li>Heat oven to 450 degrees. Put a well-seasoned or nonstick 12-inch pizza pan or cast-iron skillet in oven.</li>
<li>Sift chickpea flour into a bowl.</li>
<li>Add salt and pepper, then slowly add 1 cup lukewarm water, whisking to eliminate lumps.</li>
<li>Stir in 2 tablespoons olive oil.</li>
<li>Cover, and let sit while oven heats, or as long as 12 hours. Batter should be about the consistency of heavy cream.</li>
<li>If using onion and rosemary, stir them into batter.</li>
<li>Pour 2 tablespoons oil into heated pan, and swirl to cover pan evenly.</li>
<li>Pour in batter, and bake 12 to 15 minutes, or until pancake is firm and edges set.</li>
<li>Heat broiler, and brush top of socca with 1 or 2 tablespoons of oil if it looks dry.</li>
<li>Set socca a few inches away from broiler for a few minutes, just long enough to brown it spottily. Cut it into wedges, and serve hot, or at least warm.</li>
</ol>
</div>
</div>
<div id="outline-container-orgc53a13c" class="outline-4">
<h4 id="orgc53a13c">Yield 4 to 6 appetizer servings.</h4>
</div>
<div id="outline-container-org4ee43c4" class="outline-4">
<h4 id="org4ee43c4">Credits</h4>
<div class="outline-text-4" id="text-org4ee43c4">
<p>
<a href="http://query.nytimes.com/gst/fullpage.html?res=9E05E6D7153FF93AA25753C1A9639C8B63">http://query.nytimes.com/gst/fullpage.html?res=9E05E6D7153FF93AA25753C1A9639C8B63</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgb21e146" class="outline-3">
<h3 id="orgb21e146">Soup of Bitter Greens with Cheese Dumplings</h3>
<div class="outline-text-3" id="text-orgb21e146">
</div>
<div id="outline-container-orgf4059f1" class="outline-4">
<h4 id="orgf4059f1">Ingredients</h4>
<div class="outline-text-4" id="text-orgf4059f1">
<ul class="org-ul">
<li>1 cup parmesean cheese</li>
<li>1 cup pecorino romano cheese</li>
<li>3/4 cup fine dry bread crumbs</li>
<li>1 Tblsp parsley</li>
<li>4 large eggs, lightly beaten</li>
<li>2 cloves garlic</li>
<li>2 Tblsp olive oil</li>
<li>1/2 pound bitter greens, chopped</li>
<li>(e.g., escarole, chickory)</li>
<li>2 quarts broth</li>
</ul>
</div>
</div>
<div id="outline-container-orgf2166e4" class="outline-4">
<h4 id="orgf2166e4">Method</h4>
<div class="outline-text-4" id="text-orgf2166e4">
<ol class="org-ol">
<li>In a large bowl combine parmesean, romano, bread crumbs, parley, eggs and half of the garlic. Stir until a soft dough forms. Using moistened hands, roll the mixture in to  3/4 inch balls and arrange in a single layer on a baking sheet lined with plastic wrap. Refrigerate about 30 minutes.</li>
<li>Meanwhile, in a medium saucepan, heat the olive oil until shimmering. Add the remaining garlic and cook over moderately high heat, about 30 seconds. Add the greens and cook, stirring, until wilted and just beginning to brown, about 3-4 minutes longer.</li>
<li>Add the stock and bring to simmer. Drop the dumplings into the stock and cook until they rise to the surface, about 5 minutes.</li>
<li>Season with salt and pepper and serve in deep bowls, passing extra pecorino at the table.</li>
<li>Make ahead: the uncooked dumplings may be made overnight.</li>
</ol>
</div>
</div>
<div id="outline-container-org5325892" class="outline-4">
<h4 id="org5325892">Credits</h4>
<div class="outline-text-4" id="text-org5325892">
<ul class="org-ul">
<li>Food and Wine April 2003</li>
<li>(date created: 6/27/2007 4:42:13 PM)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org328664c" class="outline-3">
<h3 id="org328664c">White Corn Tortilla Soup</h3>
<div class="outline-text-3" id="text-org328664c">
</div>
