recipes.org
*** Ingredients
- 3 T Olive Oil
- 1 1/2 tortillas cut into 1" squares
- 1 1/2 T minced garlic
- 2 T minced white onions
- l 1/2 t minced jalapeno pepper
- 1 lb white corn kernels
- 1 1/2 lb chopped tomatoes
- 1/3 C tomato paste
- 2 1/2 t ground cumin
- 1 T Kosher salt
- 1/8 t ground white pepper
- 1/2 t chili powder
- 1 1/2 C water
- 1 Quart (chicken) stock
*** Method
1. Fry tortilla squares in olive oil until they begin to crisp.
2. Add onion, garlic, and jalapeno.
3. Cook 1 - 2 minutes until onion becomes translucent.
4. Add half the corn and all other ingredients.
5. Bring soup to a low, even boil.
6. Boil for 5 minutes; then remove from heat and puree.
7. Return soup to burner, add reserved corn.
8. Bring soup to boil again, carefully.
9. Serve garnished with blue chips, cilantro, or sour cream.
*** Credits
- Jim Brega - February 2007
- (date created: 6/27/2007 4:42:10 PM)
