recipes.html
<div id="outline-container-orgfd68c56" class="outline-4">
<h4 id="orgfd68c56">Ingredients</h4>
<div class="outline-text-4" id="text-orgfd68c56">
<ul class="org-ul">
<li>3 T Olive Oil</li>
<li>1 1/2 tortillas cut into 1" squares</li>
<li>1 1/2 T minced garlic</li>
<li>2 T minced white onions</li>
<li>l 1/2 t minced jalapeno pepper</li>
<li>1 lb white corn kernels</li>
<li>1 1/2 lb chopped tomatoes</li>
<li>1/3 C tomato paste</li>
<li>2 1/2 t ground cumin</li>
<li>1 T Kosher salt</li>
<li>1/8 t ground white pepper</li>
<li>1/2 t chili powder</li>
<li>1 1/2 C water</li>
<li>1 Quart (chicken) stock</li>
</ul>
</div>
</div>
<div id="outline-container-orgaab454d" class="outline-4">
<h4 id="orgaab454d">Method</h4>
<div class="outline-text-4" id="text-orgaab454d">
<ol class="org-ol">
<li>Fry tortilla squares in olive oil until they begin to crisp.</li>
<li>Add onion, garlic, and jalapeno.</li>
<li>Cook 1 - 2 minutes until onion becomes translucent.</li>
<li>Add half the corn and all other ingredients.</li>
<li>Bring soup to a low, even boil.</li>
<li>Boil for 5 minutes; then remove from heat and puree.</li>
<li>Return soup to burner, add reserved corn.</li>
<li>Bring soup to boil again, carefully.</li>
<li>Serve garnished with blue chips, cilantro, or sour cream.</li>
</ol>
</div>
</div>
<div id="outline-container-orgf0ed040" class="outline-4">
<h4 id="orgf0ed040">Credits</h4>
<div class="outline-text-4" id="text-orgf0ed040">
<ul class="org-ul">
<li>Jim Brega - February 2007</li>
<li>(date created: 6/27/2007 4:42:10 PM)</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-04-26 Fri 09:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
